{"updated":"2026-02-25T03:06:17.278Z","industries":[{"id":"government","label":"Government","description":"Keywords: federal agency, government agency, municipal, defense, federal court","articles":[{"title":"FIIG Securities Fined AU$2.5 Million Following Prolonged Cybersecurity Failures","source":"The Cyber Express","date":"2026-02-10T09:28:08.000Z","url":"https://thecyberexpress.com/fiig-cyberattack-au2-5m-fine-fiig-securities/","summary":"The FIIG cyberattack exposed sensitive client data and led to a AU$2.5m Federal Court fine against FIIG Securities for cybersecurity failures.","tags":["FEDERAL COURT"]},{"title":"Ex-Google Engineer Guilty of Stealing AI Tech for Chinese Firm","source":"Databreaches","date":"2026-01-29T19:30:52.000Z","url":"https://databreaches.net/2026/01/29/ex-google-engineer-guilty-of-stealing-ai-tech-for-chinese-firm/?pk_campaign=feed&pk_kwd=ex-google-engineer-guilty-of-stealing-ai-tech-for-chinese-firm","summary":"Here's yet another example of the insider threat, and this time, Google was the victim. Isaiah Poritz reports that after a criminal trial in federal court in th","tags":["FEDERAL COURT"]},{"title":"Chinese National Jailed to 46 Months for Laundering Millions of Dollars Stolen from American Investors","source":"Cyber Security News","date":"2026-01-28T08:18:50.000Z","url":"https://cybersecuritynews.com/chinese-national-jailed-to-46-months-for-laundering-millions-of-dollars/","summary":"A Chinese national named Jingliang Su has been sentenced to 46 months in prison for his involvement in a major cryptocurrency fraud scheme targeting American investors. On January 27, 2026, federal courts ordered Su to serve his sentence and pay $26.9 million in restitution to victims. The case represents a significant law enforcement victory against […]\nThe post Chinese National Jailed to 46 Months for Laundering Millions of Dollars Stolen from American Investors appeared first on Cyber Security News.","tags":["FEDERAL COURT"]}]},{"id":"healthcare","label":"Healthcare","description":"Keywords: healthcare, hospital, clinic, medical, biotech, pharmacy, pharma, hipaa","articles":[{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["HEALTHCARE"]},{"title":"Report: Attacks 'Cascade' From IT, OT to Patient Care","source":"Inforisk","date":"2026-01-27T00:00:00.000Z","url":"https://www.inforisktoday.com/report-attacks-cascade-from-it-ot-to-patient-care-a-30608","summary":"Of the millions of threats detected in healthcare IT environments last year, email phishing, identity failures and device vulnerabilities were among the top vectors","tags":["HEALTHCARE"]},{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["HEALTHCARE"]},{"title":"Report: Attacks 'Cascade' From IT, OT to Patient Care","source":"Inforisk","date":"2026-01-27T00:00:00.000Z","url":"https://www.inforisktoday.com/report-attacks-cascade-from-it-ot-to-patient-care-a-30608","summary":"Of the millions of threats detected in healthcare IT environments last year, email phishing, identity failures and device vulnerabilities were among the top vectors","tags":["HEALTHCARE"]},{"title":"Catholic Health System & Northwell Health Settle Pixel Lawsuits","source":"HIPAA Journal","date":"2026-02-24T16:16:40.000Z","url":"https://www.hipaajournal.com/catholic-health-northwell-health-pixel-settlements/","summary":"The New York-based health systems, Catholic Health System & Northwell Health, have agreed to settle class action lawsuits stemming from […]\nThe post Catholic Health System & Northwell Health Settle Pixel Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"How to maximize HEDIS scores with synthetic data","source":"Security Boulevard","date":"2026-02-24T15:10:31.000Z","url":"https://securityboulevard.com/2026/02/how-to-maximize-hedis-scores-with-synthetic-data/","summary":"Accessing PHI for development and testing is often blocked by stringent HIPAA compliance requirements. Learn how synthetic data helps engineers build tools to close care gaps and improve HEDIS scores.","tags":["HIPAA"]},{"title":"Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals","source":"HIPAA Journal","date":"2026-02-24T09:04:29.000Z","url":"https://www.hipaajournal.com/greater-pittsburgh-orthopedic-associates-data-breach/","summary":"Greater Pittsburgh Orthopedic Associates has experienced a ransomware attack that has affected almost 57,000 individuals. Data breaches have also been […]\nThe post Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor","source":"HIPAA Journal","date":"2026-02-23T17:51:12.000Z","url":"https://www.hipaajournal.com/vikor-scientific-catalyst-rcm-data-breach/","summary":"Vikor Scientific (now rebranded as Vanta Diagnostics), a molecular diagnostics company based in Charleston, South Carolina, has been affected by […]\nThe post Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System","source":"HIPAA Journal","date":"2026-02-23T16:35:18.000Z","url":"https://www.hipaajournal.com/va-oig-security-deficiencies-va-spokane-healthcare-system/","summary":"An audit of the Department of Veterans’ Affairs Spokane Healthcare System in Washington state by the Department of Veterans Affairs […]\nThe post VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement","source":"HIPAA Journal","date":"2026-02-23T13:13:53.000Z","url":"https://www.hipaajournal.com/senators-demand-answers-decline-osha-safety-health-enforcement/","summary":"Six Democratic Senators have written to the United States Secretary of Labor, Lori Chavez-DeReme, demanding answers about an apparent rollback […]\nThe post Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Interview: Hoala Greevy, Founder & CEO, Paubox","source":"HIPAA Journal","date":"2026-02-23T11:08:26.000Z","url":"https://www.hipaajournal.com/interview-hoala-greevy-founder-ceo-paubox/","summary":"The HIPAA Journal has spoken with Paubox founder and CEO, Hoala Greevy to find out more about their work and […]\nThe post Interview: Hoala Greevy, Founder & CEO, Paubox appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Why Healthcare Staff Need HIPAA Training for Social Media","source":"HIPAA Journal","date":"2026-02-23T06:50:30.000Z","url":"https://www.hipaajournal.com/why-healthcare-staff-need-hipaa-training-for-social-media/","summary":"Healthcare staff need HIPAA training for social media because a single post, photo, or comment can expose Protected Health Information […]\nThe post Why Healthcare Staff Need HIPAA Training for Social Media appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses","source":"HIPAA Journal","date":"2026-02-20T15:52:09.000Z","url":"https://www.hipaajournal.com/utah-department-health-human-services-audit-security-weaknesses/","summary":"An audit of the Utah Department of Health and Human Services (DHHS) by the Office of the Utah State Auditor […]\nThe post Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["MEDICAL CENTER","CLINIC","HIPAA"]},{"title":"Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-20T11:05:42.000Z","url":"https://www.hipaajournal.com/granite-wellness-centers-pediatric-home-service-data-breach-settlements/","summary":"Granite Wellness Centers in California and Pediatric Home Service in Minnesota have both settled lawsuits stemming from cyberattacks that exposed […]\nThe post Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center","source":"HIPAA Journal","date":"2026-02-20T11:00:37.000Z","url":"https://www.hipaajournal.com/cyberattacks-wirx-pharmacy-emanuel-medical-center/","summary":"WIRX Pharmacy in Pennsylvania has experienced a security incident that exposed the protected health information of more than 20,000 current […]\nThe post Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center appeared first on The HIPAA Journal.","tags":["MEDICAL CENTER","PHARMACY","PHARMA","HIPAA"]},{"title":"Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation","source":"HIPAA Journal","date":"2026-02-20T10:06:08.000Z","url":"https://www.hipaajournal.com/top-of-the-world-treatment-center-hipaa-settlement/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has announced its first financial penalty of […]\nThe post Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HHS OCR Settles HIPAA Security Rule Investigation with Top of the World Ranch Treatment Center","source":"Databreaches.net","date":"2026-02-20T02:22:00.000Z","url":"https://databreaches.net/2026/02/19/hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center/?pk_campaign=feed&pk_kwd=hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center","summary":"Settlement Marks OCR's 11th Enforcement Action in OCR's Risk Analysis Initiative Today, the U.S. Department of Health and Human Services' (HHS) Office for Civil","tags":["HIPAA"]},{"title":"Data Shows Elevenfold Increase in Data-only Extortion Attacks","source":"HIPAA Journal","date":"2026-02-19T17:39:07.000Z","url":"https://www.hipaajournal.com/data-shows-elevenfold-increase-data-only-extortion-attacks/","summary":"There has been a sharp increase in data-only extortion incidents, with ransomware gangs increasingly opting not to encrypt files, instead […]\nThe post Data Shows Elevenfold Increase in Data-only Extortion Attacks appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Three Healthcare Providers Affected by Ransomware Attacks","source":"HIPAA Journal","date":"2026-02-19T11:00:45.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-ransomware-attacks/","summary":"Issaqueena Pediatric Dentistry in South Carolina, Enhabit Home Health & Hospice in Texas, and AltaMed Health Services in California have […]\nThe post Three Healthcare Providers Affected by Ransomware Attacks appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"March 1, 2026: Small Healthcare Data Breach HIPAA Reporting Deadline","source":"HIPAA Journal","date":"2026-02-18T15:44:56.000Z","url":"https://www.hipaajournal.com/march-1-2026-small-healthcare-data-breach-hipaa-reporting-deadline/","summary":"Healthcare data breaches discovered in calendar year 2025 that affected fewer than 500 individuals must be reported to the HHS’ […]\nThe post March 1, 2026: Small Healthcare Data Breach HIPAA Reporting Deadline appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients","source":"HIPAA Journal","date":"2026-02-18T15:01:31.000Z","url":"https://www.hipaajournal.com/academic-urology-urogynecology-of-arizona-data-breach/","summary":"Academic Urology & Urogynecology of Arizona, a division of Palo Verde Hematology and Oncology that serves patients throughout Arizona, has […]\nThe post Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"March 2, 2025: Deadline for Electronic Submission of 2025 Workplace Injury and Illness Data","source":"HIPAA Journal","date":"2026-02-17T15:52:15.000Z","url":"https://www.hipaajournal.com/march-2-2025-deadline-electronic-submission-2025-workplace-injury-illness-data/","summary":"The deadline for submitting electronic workplace injury and illness information to the Occupational Safety and Health Administration (OSHA) is March […]\nThe post March 2, 2025: Deadline for Electronic Submission of 2025 Workplace Injury and Illness Data appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-17T11:00:22.000Z","url":"https://www.hipaajournal.com/carespring-health-care-management-lifebridge-health-data-breach-settlements/","summary":"Carespring Health Care Management in Ohio and LifeBridge Health in Maryland have agreed to settle class action lawsuits stemming from […]\nThe post Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Do your Staff need Training on HIPAA in Emergency Situations?","source":"HIPAA Journal","date":"2026-02-16T11:55:09.000Z","url":"https://www.hipaajournal.com/do-your-staff-need-training-on-hipaa-in-emergency-situations/","summary":"Emergencies in healthcare are not limited to extreme weather, wildfires, or other natural disasters. Today’s most disruptive incidents are just […]\nThe post Do your Staff need Training on HIPAA in Emergency Situations? appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"HHS Office for Civil Rights Establishes Part 2 Enforcement Program","source":"HIPAA Journal","date":"2026-02-16T11:35:05.000Z","url":"https://www.hipaajournal.com/hhs-part2-enforcement-program/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has established a civil enforcement program for […]\nThe post HHS Office for Civil Rights Establishes Part 2 Enforcement Program appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons","source":"HIPAA Journal","date":"2026-02-16T11:00:29.000Z","url":"https://www.hipaajournal.com/data-breach-settlements-centrelake-medical-group-des-moines-orthopaedic-surgeons/","summary":"Class action lawsuits over data breaches at Centrelake Medical Group and Des Moines Orthopaedic Surgeons have been resolved with settlements. […]\nThe post Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"2025 Healthcare Data Breach Report","source":"HIPAA Journal","date":"2026-02-13T23:54:17.000Z","url":"https://www.hipaajournal.com/2025-healthcare-data-breach-report/","summary":"More than 700 healthcare data breaches affecting 500 or more individuals are being reported to the Department of Health and […]\nThe post 2025 Healthcare Data Breach Report appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation","source":"HIPAA Journal","date":"2026-02-13T11:00:10.000Z","url":"https://www.hipaajournal.com/emergency-medical-services-authority-compassion-health-care-data-breach-settlements/","summary":"Emergency Medical Services Authority in Oklahoma and Compassion Health Care in North Carolina were sued over cyberattacks and data breaches. […]\nThe post Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance","source":"Security Boulevard","date":"2026-02-13T10:00:18.000Z","url":"https://securityboulevard.com/2026/02/ai-powered-hipaa-compliance-readiness-testing-in-healthcare-software-a-qa-leaders-guide-to-continuous-compliance/","summary":"In healthcare software, quality is inseparable from compliance. A feature working as designed is not enough. Every workflow, integration, and data exchange must protect Protected...Read More The post AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["HEALTHCARE","HIPAA"]},{"title":"Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY","source":"HIPAA Journal","date":"2026-02-12T14:15:13.000Z","url":"https://www.hipaajournal.com/healthcare-most-targeted-sector-2025-ransomware/","summary":"A new record was set for ransomware attacks last year, with disclosed ransomware attacks increasing by 49% year-over-year to a […]\nThe post Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Data Breaches Announced by MedRevenu & EyeCare Partners","source":"HIPAA Journal","date":"2026-02-12T13:43:46.000Z","url":"https://www.hipaajournal.com/data-breach-medrevenu-eyecare-partners/","summary":"Data breaches have been confirmed by the revenue cycle management company MedRevenu Inland Physicians Hospitalist Services, and the Missouri-based eye […]\nThe post Data Breaches Announced by MedRevenu & EyeCare Partners appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-12T12:00:57.000Z","url":"https://www.hipaajournal.com/pinehurst-radiology-tallahassee-memorial-healthcare-settlements/","summary":"Pinehurst Radiology Associates has agreed to settle a class action lawsuit over a January 2025 data breach, and Tallahassee Memorial […]\nThe post Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Your AI doctor doesn’t have to follow the same privacy rules as your real one","source":"CyberScoop","date":"2026-02-11T19:51:01.000Z","url":"https://cyberscoop.com/ai-healthcare-apps-hipaa-privacy-risks-openai-anthropic/","summary":"AI apps are making their way into healthcare. It’s not clear that rigorous data security or privacy practices will be part of the package.","tags":["HEALTHCARE"]},{"title":"Three Healthcare Providers Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-11T16:16:24.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-settle-class-action-data-breach-lawsuits/","summary":"Settlements have received preliminary approval from the courts to resolve class action lawsuits against Northeast Rehabilitation Hospital Network, American Addiction […]\nThe post Three Healthcare Providers Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HOSPITAL","HIPAA"]},{"title":"Therapy Practice Management Software","source":"HIPAA Journal","date":"2026-02-11T15:59:01.000Z","url":"https://www.hipaajournal.com/therapy-practice-management-software/","summary":"Therapy practice management software is an administrative and clinical operations system used by behavioral health providers to manage scheduling, documentation, […]\nThe post Therapy Practice Management Software appeared first on The HIPAA Journal.","tags":["CLINIC","HIPAA"]},{"title":"83,000 Clients Affected by Cyberattack on Ohio Counseling Center","source":"HIPAA Journal","date":"2026-02-11T13:34:40.000Z","url":"https://www.hipaajournal.com/ohio-counseling-center-cyberattack/","summary":"The Counseling Center of Wayne and Holmes Counties has experienced a cyberattack affecting 83,350 individuals. Data breaches have also been […]\nThe post 83,000 Clients Affected by Cyberattack on Ohio Counseling Center appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"McLaren Health Care Pays $14 Million to Settle Litigation Over Ransomware Attacks","source":"HIPAA Journal","date":"2026-02-10T10:32:12.000Z","url":"https://www.hipaajournal.com/mclaren-health-care-data-breach-settlement/","summary":"McLaren Health Care has agreed to pay $14 million to settle class action litigation stemming from two ransomware attacks in […]\nThe post McLaren Health Care Pays $14 Million to Settle Litigation Over Ransomware Attacks appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients","source":"HIPAA Journal","date":"2026-02-09T15:42:00.000Z","url":"https://www.hipaajournal.com/jbs-mental-health-authority-data-breach/","summary":"Jefferson-Blount-St. Clair Mental Health Authority in Alabama, Cottage Hospital in New Hampshire, WindRose Health Network in Indiana, and Iroquois Memorial […]\nThe post Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty","source":"HIPAA Journal","date":"2026-02-09T15:33:06.000Z","url":"https://www.hipaajournal.com/cordell-memorial-holmes-regional-medical-center-emtala-penalties/","summary":"Two hospitals have entered into settlement agreements with the Department of Health and Human Services (HHS) Office of Inspector General […]\nThe post Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"What Is Healthcare-Adjacent Data?","source":"HIPAA Journal","date":"2026-02-06T17:13:28.000Z","url":"https://www.hipaajournal.com/what-is-healthcare-adjacent-data/","summary":"Healthcare-adjacent data is any health‑related or health‑influenced information that falls outside HIPAA’s definition of Protected Health Information because it is […]\nThe post What Is Healthcare-Adjacent Data? appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches","source":"HIPAA Journal","date":"2026-02-06T15:02:28.000Z","url":"https://www.hipaajournal.com/docs-dermatology-group-center-for-neuropsychology-learning-disclose-data-breaches/","summary":"Central States Dermatology Services (DOCS Dermatology Group) in Ohio and The Center for Neuropsychology and Learning in Michigan have identified […]\nThe post DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"What is Medical Practice Management Software?","source":"HIPAA Journal","date":"2026-02-05T17:31:02.000Z","url":"https://www.hipaajournal.com/medical-practice-management-software/","summary":"Medical practice management software is a clinic operations system that helps a medical practice schedule patients, manage billing and payments, […]\nThe post What is Medical Practice Management Software? appeared first on The HIPAA Journal.","tags":["CLINIC","HIPAA"]},{"title":"Healthcare Technology Company Discloses Ransomware Attack","source":"HIPAA Journal","date":"2026-02-05T14:58:22.000Z","url":"https://www.hipaajournal.com/insightin-health-clinic-service-corporation-data-breach/","summary":"Cyberattacks and data breaches have recently been announced by the healthcare technology company Insightin Health and the Colorado-based medical billing […]\nThe post Healthcare Technology Company Discloses Ransomware Attack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience","source":"HIPAA Journal","date":"2026-02-05T13:05:37.000Z","url":"https://www.hipaajournal.com/fbi-operation-winter-shield-cybersecurity/","summary":"The Federal Bureau of Investigation (FBI) has launched a campaign to improve the resilience of industry, government, and critical infrastructure […]\nThe post FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools","source":"HIPAA Journal","date":"2026-02-05T11:58:57.000Z","url":"https://www.hipaajournal.com/legacy-health-garnet-health-pixel-settlements/","summary":"Two healthcare providers have agreed to settle class action lawsuits over their use of website tracking technologies. Website tracking technologies, […]\nThe post Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"HIPAA, Healthcare Data, and Artificial Intelligence","source":"HIPAA Journal","date":"2026-02-05T07:35:48.000Z","url":"https://www.hipaajournal.com/hipaa-healthcare-data-and-artificial-intelligence/","summary":"Artificial intelligence is rapidly reshaping healthcare, offering new ways to analyze data, support clinical decisions, streamline operations, and improve patient […]\nThe post HIPAA, Healthcare Data, and Artificial Intelligence appeared first on The HIPAA Journal.","tags":["HEALTHCARE","CLINIC","HIPAA"]},{"title":"HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital","source":"HIPAA Journal","date":"2026-02-04T15:57:00.000Z","url":"https://www.hipaajournal.com/hhs-oig-web-application-security-weaknesses-audit-large-hospital/","summary":"An audit of a large Southeastern hospital by the Department of Health and Human Services Office of Inspector General (HHS-OIG) […]\nThe post HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Central Ozarks Medical Center Discloses Data Breach Affecting Almost 12,000 Patients","source":"HIPAA Journal","date":"2026-02-04T14:49:43.000Z","url":"https://www.hipaajournal.com/central-ozarks-medical-center-data-breach/","summary":"Data breaches have recently been announced by Central Ozarks Medical Center in Missouri, AdventHealth Daytona Beach in Florida, and the […]\nThe post Central Ozarks Medical Center Discloses Data Breach Affecting Almost 12,000 Patients appeared first on The HIPAA Journal.","tags":["MEDICAL CENTER","HIPAA"]},{"title":"Is Wix HIPAA Compliant?","source":"HIPAA Journal","date":"2026-02-04T13:21:40.000Z","url":"https://www.hipaajournal.com/is-wix-hipaa-compliant/","summary":"When this article was first published in early 2025, Wix was not a HIPAA-compliant service; however, the company has since […]\nThe post Is Wix HIPAA Compliant? appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Capital Health Data Breach Litigation Settled for $4.5M","source":"HIPAA Journal","date":"2026-02-04T12:20:48.000Z","url":"https://www.hipaajournal.com/capital-health-class-action-data-breach-settlement/","summary":"Capital Health has agreed to pay $4.5 million to settle a class action lawsuit stemming from a 2023 ransomware attack. […]\nThe post Capital Health Data Breach Litigation Settled for $4.5M appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit","source":"HIPAA Journal","date":"2026-02-04T11:33:13.000Z","url":"https://www.hipaajournal.com/gryphon-healthcare-class-action-data-breach-lawsuits/","summary":"Gryphon Healthcare, a Houston, TX-based revenue cycle, coding, compliance, consultancy, and management services vendor, faced multiple class action lawsuits over […]\nThe post Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Why do Hackers Focus on Medical Records?","source":"HIPAA Journal","date":"2026-02-04T10:50:06.000Z","url":"https://www.hipaajournal.com/hackers-and-medical-records/","summary":"Hackers focus on medical records because the combination of demographic data, insurance details, clinical information, and financial identifiers creates a […]\nThe post Why do Hackers Focus on Medical Records? appeared first on The HIPAA Journal.","tags":["CLINIC","HIPAA"]},{"title":"Questions Loom Ahead of Substance Abuse Privacy Rules Shift","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/questions-loom-ahead-substance-abuse-privacy-rules-shift-i-5522","summary":"As the compliance deadline quickly approaches for changes to align the federal rules for the confidentiality of substance use disorder records with HIPAA, entities","tags":["HIPAA"]},{"title":"CISA Issues Guidance for Proactively Defending Against Insider Threats","source":"HIPAA Journal","date":"2026-02-03T16:34:41.000Z","url":"https://www.hipaajournal.com/cisa-issues-guidance-proactively-defending-against-insider-threats/","summary":"Insider threats are one of the leading causes of data breaches in healthcare, more so than in many other industry […]\nThe post CISA Issues Guidance for Proactively Defending Against Insider Threats appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Patients Learn Their Health Data Was Compromised More Than a Year Ago","source":"HIPAA Journal","date":"2026-02-03T14:48:35.000Z","url":"https://www.hipaajournal.com/patients-notified-2024-data-breaches/","summary":"Alpine Ear, Nose, and Throat in Colorado, The Phia Group in Massachusetts, and Community Health Northwest Florida have started notifying […]\nThe post Patients Learn Their Health Data Was Compromised More Than a Year Ago appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Bayada Home Health Care Affected by Doctor Alliance Data Breach","source":"HIPAA Journal","date":"2026-02-03T14:37:48.000Z","url":"https://www.hipaajournal.com/bayada-home-health-care-doctor-alliance-data-breach/","summary":"Bayada Home Health Care, a New Jersey-based home healthcare provider serving 22 U.S. states, has recently announced a data breach […]\nThe post Bayada Home Health Care Affected by Doctor Alliance Data Breach appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"December 2025 Healthcare Data Breach Report","source":"HIPAA Journal","date":"2026-02-02T16:00:55.000Z","url":"https://www.hipaajournal.com/december-2025-healthcare-data-breach-report/","summary":"In the final month of 2025, a further 41 healthcare data breaches affecting 500 or more individuals were reported to […]\nThe post December 2025 Healthcare Data Breach Report appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident","source":"HIPAA Journal","date":"2026-01-30T16:06:53.000Z","url":"https://www.hipaajournal.com/healthcare-interactive-data-breach/","summary":"Healthcare Interactive, better known as HCIactive, reported a data breach to the HHS’ Office for Civil Rights on September 22, […]\nThe post Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"U.S. Data Compromises Hit Record High in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-compromises-record-high-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record High in 2025 appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"U.S. Data Compromises Hit Record Breaches in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-breach-record-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record Breaches in 2025 appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Northwell Health & Northbay Healthcare Settle Litigation Over Website Pixel Use","source":"HIPAA Journal","date":"2026-01-30T11:00:15.000Z","url":"https://www.hipaajournal.com/northwell-health-northbay-healthcare-data-breach-settlements/","summary":"Northwell Health & Northbay Healthcare were sued over the use of tracking tools on their websites, which are alleged to […]\nThe post Northwell Health & Northbay Healthcare Settle Litigation Over Website Pixel Use appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Comstar to Pay State AGs $515,000 to Settle Alleged HIPAA Violations","source":"HIPAA Journal","date":"2026-01-29T11:35:21.000Z","url":"https://www.hipaajournal.com/comstar-hipaa-violation-penalty-mass-conn-2025/","summary":"Comstar, a Massachusetts-based ambulance billing and collections company, has been investigated by the Massachusetts Attorney General and found to have […]\nThe post Comstar to Pay State AGs $515,000 to Settle Alleged HIPAA Violations appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HHS Applies Inflation Increase to Penalties for HIPAA Violations","source":"HIPAA Journal","date":"2026-01-28T17:45:00.000Z","url":"https://www.hipaajournal.com/hhs-applies-inflation-increase-penalties-for-hipaa-violations/","summary":"The HHS’ Office for Civil Rights has increased the penalties for HIPAA violations with immediate effect. As of January 28, […]\nThe post HHS Applies Inflation Increase to Penalties for HIPAA Violations appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HIPAA Training for IT Professionals","source":"HIPAA Journal","date":"2026-01-28T13:59:53.000Z","url":"https://www.hipaajournal.com/hipaa-training-for-it-professionals/","summary":"HIPAA training for IT professionals is required for IT workforce members who support systems that create, receive, maintain, or transmit […]\nThe post HIPAA Training for IT Professionals appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches","source":"HIPAA Journal","date":"2026-01-28T13:33:30.000Z","url":"https://www.hipaajournal.com/four-healthcare-providers-class-action-data-brteach-settlements/","summary":"Settlements have been agreed to resolve class action lawsuits over healthcare data breaches experienced by Alabama Cardiovascular Group, Carolina Arthritis […]\nThe post Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Blue Cross Blue Shield of Montana Faces Data Breach Probe","source":"HIPAA Journal","date":"2026-01-28T13:23:11.000Z","url":"https://www.hipaajournal.com/blue-cross-blue-shield-montana-data-breach-probe/","summary":"Health Care Service Corporation, doing business as Blue Cross Blue Shield of Montana (BCBSMT), is facing a probe into whether […]\nThe post Blue Cross Blue Shield of Montana Faces Data Breach Probe appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Aligning Substance Use Privacy Regs With HIPAA Isn’t Simple","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/aligning-substance-use-privacy-regs-hipaa-isnt-simple-i-5519","summary":"Revisions to 42 CFR Part 2 that go into effect soon to better align federal regulations for the confidentiality of substance use disorder records with HIPAA require","tags":["HIPAA"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-01-27T15:26:06.000Z","url":"https://www.hipaajournal.com/texas-new-jersey-dermatology-practices-data-breach-settlements/","summary":"Two U.S. dermatology practices have agreed to settle class action lawsuits stemming from cybersecurity incidents that exposed patient data. The […]\nThe post Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability","source":"HIPAA Journal","date":"2026-01-27T13:10:22.000Z","url":"https://www.hipaajournal.com/microsoft-issues-emergency-patch-for-actively-exploited-office-vulnerability/","summary":"Microsoft has issued an out-of-band security update to fix an actively exploited zero-day vulnerability in Microsoft Office. The vulnerability is tracked […]\nThe post Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"MACT Health Board Patients Affected by November 2025 Ransomware Attack","source":"HIPAA Journal","date":"2026-01-26T14:35:38.000Z","url":"https://www.hipaajournal.com/mact-health-board-data-breach/","summary":"MACT Health Board has confirmed that patient data was stolen in a November 2025 cyberattack, for which the INC Ransom […]\nThe post MACT Health Board Patients Affected by November 2025 Ransomware Attack appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack","source":"HIPAA Journal","date":"2026-01-26T14:24:54.000Z","url":"https://www.hipaajournal.com/munson-healthcare-cerner-data-breach/","summary":"Munson Healthcare, the largest health system in Northern Michigan, has recently notified patients about unauthorized access to its electronic medical […]\nThe post More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Healthcare Cyber Resilience: Building a Trusted Data Foundation for Secure, AI-Ready Operations","source":"Inforisk","date":"2026-02-17T00:14:49.010Z","url":"https://www.inforisktoday.com/webinars/healthcare-cyber-resilience-building-trusted-data-foundation-for-w-6851","summary":". information risk management","tags":["HEALTHCARE"]},{"title":"Building Visibility to Enable Secure Healthcare AI Adoption","source":"Zscaler","date":"2026-01-27T22:53:44.000Z","url":"https://www.zscaler.com/blogs/product-insights/building-visibility-enable-secure-healthcare-ai-adoption","summary":"Secure generative AI adoption in healthcare. Protect PHI, tackle shadow AI risks, and enable innovation with WebSocket inspection and Zero Trust governance.","tags":["HEALTHCARE"]},{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["MEDICAL CENTER","CLINIC"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["HOSPITAL","MEDICAL CENTER","CLINIC"]},{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["MEDICAL CENTER"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["MEDICAL CENTER","CLINIC","HIPAA"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["MEDICAL CENTER","CLINIC"]},{"title":"Cyberattack Forces Clinic Closures, Surgery Cancellations at University of Mississippi Medical Center","source":"The Cyber Express","date":"2026-02-20T09:26:46.000Z","url":"https://thecyberexpress.com/ummc-cyberattack-clinic-closures-it-shutdown/","summary":"A UMMC cyberattack forced clinic closures, surgery cancellations and IT shutdowns as federal agencies investigate the breach.","tags":["MEDICAL CENTER","CLINIC"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["MEDICAL CENTER","CLINIC"]},{"title":"Univ. of Mississippi Medical Center Dealing With Cyberattack","source":"Inforisk","date":"2026-02-19T00:00:00.000Z","url":"https://www.inforisktoday.com/univ-mississippi-medical-center-dealing-cyberattack-a-30808","summary":"The University of Mississippi Medical Center on Thursday said a ransomware attack has triggered its emergency operations plan and forced its hospitals to cancel all","tags":["HOSPITAL","MEDICAL CENTER"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["CLINIC"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["HEALTHCARE"]},{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["HEALTHCARE"]},{"title":"The AI Influx is Here. Time to Establish Your “Department of Know.”","source":"Netskope","date":"2026-02-17T16:21:35.000Z","url":"https://www.netskope.com/blog/the-ai-influx-is-here-time-to-establish-your-department-of-know","summary":"AI has forced healthcare leaders into a precarious position. While many were still debating whether the technology should be used, its value was so clear","tags":["HEALTHCARE"]},{"title":"Healthcare Technology Company Discloses Ransomware Attack","source":"HIPAA Journal","date":"2026-02-05T14:58:22.000Z","url":"https://www.hipaajournal.com/insightin-health-clinic-service-corporation-data-breach/","summary":"Cyberattacks and data breaches have recently been announced by the healthcare technology company Insightin Health and the Colorado-based medical billing […]\nThe post Healthcare Technology Company Discloses Ransomware Attack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]}]},{"id":"construction","label":"Construction","description":"Keywords: construction, hvac, building contractor","articles":[{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["CONSTRUCTION"]}]},{"id":"business-services","label":"Business Services","description":"Keywords: law firm, llp, accounting firm, professional services","articles":[{"title":"GrayCharlie Hijacks Law Firm Sites in Suspected Supply-Chain Attack","source":"Recorded Future","date":"2026-02-19T00:00:00.000Z","url":"https://www.recordedfuture.com/research/graycharlie-hijacks-law-firm-sites-suspected-supply-chain-attack","summary":"GrayCharlie turns compromised WordPress sites into malware delivery machines. Discover how this threat actor chains fake browser updates and ClickFix lures to deploy NetSupport RAT, Stealc, and SectopRAT.","tags":["LAW FIRM"]},{"title":"GUEST ESSAY: The hidden risks lurking beneath legal AI — permission sprawl, governance drift","source":"Security Boulevard","date":"2026-02-16T19:06:54.000Z","url":"https://securityboulevard.com/2026/02/guest-essay-the-hidden-risks-lurking-beneath-legal-ai-permission-sprawl-governance-drift/","summary":"In many law firms today, leadership believes their data is secure. Policies are documented, annual reviews are completed, and vendor questionnaires are answered with confidence. On paper, the safeguards look strong. Related: The cost of law firm breaches Yet in … (more…) The post GUEST ESSAY: The hidden risks lurking beneath legal AI — permission sprawl, governance drift first appeared on The Last Watchdog.","tags":["LAW FIRM"]},{"title":"Researchers Expose Network of 150 Cloned Law Firm Websites in AI-Powered Scam Campaign","source":"Security Week","date":"2026-02-05T14:00:00.000Z","url":"https://www.securityweek.com/researchers-expose-network-of-150-cloned-law-firm-websites-in-ai-powered-scam-campaign/","summary":"Sygnia uncovers a massive network of 150+ cloned legal websites using AI-driven infrastructure to scale \"recovery scams.\"","tags":["LAW FIRM"]},{"title":"CVE-2026-1600 | Bdtask Bhojon All-In-One Restaurant Management System up to 20260116 Add-to-Cart Submission Endpoint /hungry/addtocart price/allprice logic error","source":"Vuldb","date":"2026-01-29T08:49:55.000Z","url":"https://vuldb.com/?id.343362","summary":"A vulnerability marked as problematic has been reported in Bdtask Bhojon All-In-One Restaurant Management System up to 20260116. The impacted element is an unknown function of the file /hungry/addtocart of the component Add-to-Cart Submission Endpoint. The manipulation of the argument price/allprice leads to business logic errors.\n\nThis vulnerability is documented as CVE-2026-1600. The attack can be initiated remotely. Additionally, an exploit exists.\n\nThe vendor was contacted early about this disclosure but did not respond in any way.","tags":["LLP"]}]},{"id":"education","label":"Education","description":"Keywords: school district, k-12, university, college, higher education","articles":[{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – RadSee: See Your Handwriting Through Walls Using FMCW Rada","source":"Security Boulevard","date":"2026-02-24T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-radsee-see-your-handwriting-through-walls-using-fmcw-rada/","summary":"Authors, Creators & Presenters: Shichen Zhang (Michigan State University), Qijun Wang (Michigan State University), Maolin Gan (Michigan State University), Zhichao Cao (Michigan State University), Huacheng Zeng (Michigan State University) PAPER RadSee: See Your Handwriting Through Walls Using FMCW Radar This paper aims to design and implement a radio device capable of detecting a person's handwriting through a wall. Although there is extensive research on radio frequency (RF) based human activity recognition, this task is particularly challenging due to the through-wall requirement and the tiny-scale handwriting movements. To address these challenges, we present RadSee---a 6 GHz frequency modulated continuous wave (FMCW) radar system designed for detecting handwriting content behind a wall. RadSee is realized through a joint hardware and software design. On the hardware side, RadSee features a 6 GHz FMCW radar device equipped with two custom-designed, high-gain patch antennas. These two","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Generating API Specifications For Bug Detection Via Specification Propagation Analysis","source":"Security Boulevard","date":"2026-02-23T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-specifications-for-bug-detection-via-specification-propagation-analysis/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Uncovering The Iceberg From The Tip: Generating API Specifications For Bug Detection Via Specification Propagation Analysis Modern software often provides diverse APIs to facilitate development. Certain APIs, when used, can affect variables and requi","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Generating API Parameter Security Rules With LLM For API Misuse Detection","source":"Security Boulevard","date":"2026-02-23T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-parameter-security-rules-with-llm-for-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Generating API Parameter Security Rules with LLM for API Misuse Detection When utilizing library APIs, developers should follow the API security rules to mitigate the risk of API misuse. API Parameter Security Rule (APSR) is a common type of security","tags":["UNIVERSITY"]},{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["UNIVERSITY"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – The Midas Touch: Triggering The Capability Of LLMs For RM-API Misuse Detection","source":"Security Boulevard","date":"2026-02-22T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-the-midas-touch-triggering-the-capability-of-llms-for-rm-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER The Midas Touch: Triggering the Capability of LLMs for RM-API Misuse Detection As the basis of software resource management (RM), strictly following the RM-API constraints guarantees secure resource management and software. To enhance the RM-API appl","tags":["UNIVERSITY"]},{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["UNIVERSITY"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["UNIVERSITY"]},{"title":"Cyberattack Forces Clinic Closures, Surgery Cancellations at University of Mississippi Medical Center","source":"The Cyber Express","date":"2026-02-20T09:26:46.000Z","url":"https://thecyberexpress.com/ummc-cyberattack-clinic-closures-it-shutdown/","summary":"A UMMC cyberattack forced clinic closures, surgery cancellations and IT shutdowns as federal agencies investigate the breach.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – NDSS 2025 – BARBIE: Robust Backdoor Detection Based On Latent Separability","source":"Security Boulevard","date":"2026-02-19T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ndss-2025-barbie-robust-backdoor-detection-based-on-latent-separability/","summary":"Session 12D: ML Backdoors   Authors, Creators & Presenters: Hanlei Zhang (Zhejiang University), Yijie Bai (Zhejiang University), Yanjiao Chen (Zhejiang University), Zhongming Ma (Zhejiang University), Wenyuan Xu (Zhejiang University) PAPER BARBIE: Robust Backdoor Detection Based On Latent Separability Backdoor attacks are an essential risk to deep learning model sharing. Fundamentally, backdoored models are different from benign models considering latent separability, i.e., distinguishable differences in model latent representations. However, existing methods quantify latent separability by clustering latent representations or computing distances between latent representations, which are easy to be compromised by adaptive attacks. In this paper, we propose BARBIE, a backdoor detection approach that can pinpoint latent separability under adaptive backdoor attacks. To achieve this goal, we propose a new latent separability metric, named relative competition score (RCS), by characterizing","tags":["UNIVERSITY"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["UNIVERSITY"]},{"title":"Univ. of Mississippi Medical Center Dealing With Cyberattack","source":"Inforisk","date":"2026-02-19T00:00:00.000Z","url":"https://www.inforisktoday.com/univ-mississippi-medical-center-dealing-cyberattack-a-30808","summary":"The University of Mississippi Medical Center on Thursday said a ransomware attack has triggered its emergency operations plan and forced its hospitals to cancel all","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – CLIBE: Detecting Dynamic Backdoors In Transformer-based NLP Models","source":"Security Boulevard","date":"2026-02-18T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-clibe-detecting-dynamic-backdoors-in-transformer-based-nlp-models/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Rui Zeng (Zhejiang University), Xi Chen (Zhejiang University), Yuwen Pu (Zhejiang University), Xuhong Zhang (Zhejiang University), Tianyu Du (Zhejiang University), Shouling Ji (Zhejiang University) PAPER CLIBE: Detecting Dynamic Backdoors in Transformer-based NLP Models Backdoors can be injected into NLP models to induce misbehavior when the input text contains a specific feature, known as a trigger, which the attacker secretly selects. Unlike fixed tokens, words, phrases, or sentences used in the static text trigger, dynamic backdoor attacks on NLP models design triggers associated with abstract and latent text features (e.g., style), making them considerably stealthier than traditional static backdoor attacks. However, existing research on NLP backdoor detection primarily focuses on defending against static backdoor attacks, while research on detecting dynamic backdoors in NLP models remains largely unexplored. This paper pre","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["UNIVERSITY"]},{"title":"University of Pennsylvania - 623,750 breached accounts","source":"Have I Been Pwned","date":"2026-02-16T21:57:51.000Z","url":"https://haveibeenpwned.com/Breach/UniversityOfPennsylvania","summary":"In October 2025, the University of Pennsylvania was the victim of a data breach followed by a ransom demand, largely affecting its donor database. After the incident, the attackers sent inflammatory emails to some victims. The data was later published online in February 2026 and included 624k unique email addresses alongside names and physical addresses. For some donor records, additional personal information was exposed, including gender and date of birth. A small subset of records also contained religion, spouse name, estimated income and donation history.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Diffence: Fencing Membership Privacy With Diffusion Models","source":"Security Boulevard","date":"2026-02-15T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-diffence-fencing-membership-privacy-with-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters:  PAPER Yuefeng Peng (University of Massachusetts Amherst), Ali Naseh (University of Massachusetts Amherst), Amir Houmansadr (University of Massachusetts Amherst) Deep learning models, while achieving remarkable performances across various tasks, are vulnerable to membership inference attacks (MIAs), wherein adversaries identify if a specific data point was part of the model's training set. This susceptibility raises substantial privacy concerns, especially when models are trained on sensitive datasets. Although various defenses have been proposed, there is still substantial room for improvement in the privacy-utility trade-off. In this work, we introduce a novel defense framework against MIAs by leveraging generative models. The key intuition of our defense is to *remove the differences between member and non-member inputs*, which is exploited by MIAs, by re-generating input samples before feeding them to the target mod","tags":["UNIVERSITY"]},{"title":"Upcoming Speaking Engagements","source":"Schneier on Security","date":"2026-02-14T17:04:59.000Z","url":"https://www.schneier.com/blog/archives/2026/02/upcoming-speaking-engagements-53.html","summary":"This is a current list of where and when I am scheduled to speak: I’m speaking at Ontario Tech University in Oshawa, Ontario, Canada, at 2 PM ET on Thursday, February 26, 2026. I’m speaking at the Personal AI Summit in Los Angeles, California, USA, on Thursday, March 5, 2026. I’m speaking at Tech Live: Cybersecurity in New York City, USA, on Wednesday, March 11, 2026. I’m giving the Ross Anderson Lecture at the University of Cambridge’s Churchill College at 5:30 PM GMT on Thursday, March 19, 2026. I’m speaking at RSAC 2026 in San Francisco, California, USA, on Wednesday, March 25, 2026...","tags":["UNIVERSITY"]},{"title":"NDSS 2025 –  Black-Box Membership Inference Attacks Against Fine-Tuned Diffusion Models","source":"Security Boulevard","date":"2026-02-14T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-black-box-membership-inference-attacks-against-fine-tuned-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Yan Pang (University of Virginia), Tianhao Wang (University of Virginia) PAPER Black-box Membership Inference Attacks against Fine-tuned Diffusion Models With the rapid advancement of diffusion-based image-generative models, the quality of generated images has become increasingly photorealistic. Moreover, with the release of high-quality pre-trained image-generative models, a growing number of users are downloading these pre-trained models to fine-tune them with downstream datasets for various image-generation tasks. However, employing such powerful pre-trained models in downstream tasks presents significant privacy leakage risks. In this paper, we propose the first scores-based membership inference attack framework tailored for recent diffusion models, and in the more stringent black-box access setting. Considering four distinct attack scenarios and three types of attacks, this framework is capable of targeting any pop","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["UNIVERSITY"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Italian university La Sapienza still offline to mitigate recent cyber attack","source":"Security Affairs","date":"2026-02-07T18:02:53.000Z","url":"https://securityaffairs.com/187702/cyber-crime/italian-university-la-sapienza-still-offline-to-mitigate-recent-cyber-attack.html","summary":"Rome’s La Sapienza University was hit by a cyberattack that disrupted IT systems and caused widespread operational issues.","tags":["UNIVERSITY"]},{"title":"Man pleads guilty to hacking nearly 600 women’s Snapchat accounts","source":"Bleeping Computer","date":"2026-02-06T12:34:30.000Z","url":"https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-nearly-600-womens-snapchat-accounts/","summary":"An Illinois man pleaded guilty to hacking nearly 600 women's Snapchat accounts to steal nude photos that he kept, sold, or traded online, including accounts he compromised at the request of a former university track coach who was later convicted of sextortion.","tags":["UNIVERSITY"]},{"title":"La Sapienza Cyberattack Forces Italy’s Largest University Offline","source":"The Cyber Express","date":"2026-02-06T09:46:30.000Z","url":"https://thecyberexpress.com/la-sapienza-cyberattack-bablock-ransomware/","summary":"The La Sapienza cyberattack forced Italy’s largest university offline as officials investigate a possible BabLock ransomware incident.","tags":["UNIVERSITY"]},{"title":"Cyberattack Forces Network Shutdown at Rome’s La Sapienza University","source":"Secure Reading","date":"2026-02-06T06:23:45.000Z","url":"https://securereading.com/la-sapienza-university-cyberattack/","summary":"La Sapienza University cyberattack","tags":["UNIVERSITY"]},{"title":"One of Europe’s largest universities knocked offline for days after cyberattack","source":"TechCrunch","date":"2026-02-05T19:00:46.000Z","url":"https://techcrunch.com/2026/02/05/one-of-europes-largest-universities-knocked-offline-for-days-after-cyberattack/","summary":"An alleged ransomware attack has taken down the systems of the Sapienza University of Rome.","tags":["UNIVERSITY"]},{"title":"Italian university La Sapienza goes offline after cyberattack","source":"Bleeping Computer","date":"2026-02-05T17:02:45.000Z","url":"https://www.bleepingcomputer.com/news/security/italian-university-la-sapienza-goes-offline-after-cyberattack/","summary":"Rome's \"La Sapienza\" university has been targeted by a cyberattack that impacted its IT systems and caused widespread operational disruptions at the educational institute.","tags":["UNIVERSITY"]},{"title":"Two Ivy League universities had donor information breaches. Will donors be notified?","source":"Databreaches.net","date":"2026-02-05T02:47:16.000Z","url":"https://databreaches.net/2026/02/04/two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified/?pk_campaign=feed&pk_kwd=two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified","summary":"Harvard University and the University of Pennsylvania (UPenn) have more in common than just being Ivy League universities. Both suffered data breaches involving","tags":["UNIVERSITY"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["UNIVERSITY"]},{"title":"Harvard, UPenn Data Leaked in ShinyHunters Shakedown","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/harvard-upenn-data-leaked-in-shinyhunters-shakedown-a-30677","summary":"Harvard University has been named as a victim and doxed by hack-and-leak group ShinyHunters, apparently as a result of the cybercrime group's ongoing \"live","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Silence False Alarms","source":"Security Boulevard","date":"2026-01-30T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-silence-false-alarms/","summary":"Session 11A: Blockchain Security 2  Authors, Creators & Presenters: Qiyang Song (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Heqing Huang (Institute of Information Engineering, Chinese Academy of Sciences), Xiaoqi Jia (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Yuanbo Xie (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Jiahao Cao (Institute for Network Sciences and Cyberspace, Tsinghua University) PAPER Silence False Alarms: Identifying Anti-Reentrancy Patterns on Ethereum to Refine Smart Contract Reentrancy Detection Reentrancy vulnerabilities in Ethereum smart contracts have caused significant financial losses, prompting the creation of several automated reentrancy detectors. However, these detectors frequently","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Provably Unlearnable Data Examples","source":"Security Boulevard","date":"2026-01-30T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-provably-unlearnable-data-examples/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Derui Wang (CSIRO's Data61), Minhui Xue (CSIRO's Data61), Bo Li (The University of Chicago), Seyit Camtepe (CSIRO's Data61), Liming Zhu (CSIRO's Data61) PAPER Provably Unlearnable Data Examples The exploitation of publicly accessible data has led to escalating concerns regarding data privacy and intellectual property (IP) breaches in the age of artificial intelligence. To safeguard both data privacy and IP-related domain knowledge, efforts have been undertaken to render shared data unlearnable for unauthorized models in the wild. Existing methods apply empirically optimized perturbations to the data in the hope of disrupting the correlation between the inputs and the corresponding labels such that the data samples are converted into Unlearnable Examples (UEs). Nevertheless, the absence of mechanisms to verify the robustness of UEs against uncertainty in unauthorized models and their training procedures engenders several","tags":["UNIVERSITY"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["UNIVERSITY"]},{"title":"Why life changes increase digital risk: Are you ready for moving, new jobs, or university?","source":"Panda (Labs)","date":"2026-01-30T07:00:22.000Z","url":"https://www.pandasecurity.com/en/mediacenter/why-life-changes-increase-digital-risk-are-you-ready-for-moving-new-jobs-or-university/","summary":"Life changes increase digital risk ⚠️ Are you ready for digital threats when moving, changing jobs or starting university?","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Reinforcement Unlearning","source":"Security Boulevard","date":"2026-01-29T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-reinforcement-unlearning/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Dayong Ye (University of Technology Sydney), Tianqing Zhu (City University of Macau), Congcong Zhu (City University of Macau), Derui Wang (CSIRO's Data61), Kun Gao (University of Technology Sydney), Zewei Shi (CSIRO's Data61), Sheng Shen (Torrens University Australia), Wanlei Zhou (City University of Macau), Minhui Xue (CSIRO's Data61) PAPER Reinforcement Unlearning Machine unlearning refers to the process of mitigating the influence of specific training data on machine learning models based on removal requests from data owners. However, one important area that has been largely overlooked in the research of unlearning is reinforcement learning. Reinforcement learning focuses on training an agent to make optimal decisions within an environment to maximize its cumulative rewards. During the training, the agent tends to memorize the features of the environment, which raises a significant concern about privacy. As per data p","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["UNIVERSITY"]},{"title":"What happens if agentic AI falls into the wrong hands? [Q&A]","source":"Beta News","date":"2026-01-29T13:59:10.000Z","url":"https://betanews.com/article/what-happens-if-agentic-ai-falls-into-the-wrong-hands-qa/","summary":"Agentic AI systems are increasingly taking on real-world roles -- by 2028 Gartner predicts that 15 percent of day-to-day work decisions will be made by agentic AI. But do we fully understand the potential harm that could be caused if these systems were weaponized by bad actors? We spoke to Keeley Crockett, senior IEEE member and professor in computational intelligence at the Manchester Metropolitan University to find out. BN: What is agentic AI and what differentiates it from a standard AI assistant? KC: Agentic AI refers to artificial intelligence systems with a high degree of autonomy that can act independently… [Continue Reading]","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Recurrent Private Set Intersection For Unbalanced Databases With Cuckoo Hashing","source":"Security Boulevard","date":"2026-01-28T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-recurrent-private-set-intersection-for-unbalanced-databases-with-cuckoo-hashing/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Eduardo Chielle (New York University Abu Dhabi), Michail Maniatakos (New York University Abu Dhabi) PAPER Recurrent Private Set Intersection for Unbalanced Databases with Cuckoo Hashing and Leveled FHE A Private Set Intersection (PSI) protocol is a cryptographic method allowing two parties, each with a private set, to determine the intersection of their sets without revealing any information about their entries except for the intersection itself. While extensive research has focused on PSI protocols, most studies have centered on scenarios where two parties possess sets of similar sizes, assuming a semi-honest threat model. However, when the sizes of the parties' sets differ significantly, a generalized solution tends to underperform compared to a specialized one, as recent research has demonstrated. Additionally, conventional PSI protocols are typically designed for a single execution, requiring the entire protocol to","tags":["UNIVERSITY"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["UNIVERSITY"]},{"title":"Inside Arizona's Push to Modernize and Secure Campus IT","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/inside-arizonas-push-to-modernize-secure-campus-it-a-30619","summary":"The University of Arizona is advancing a campus-wide modernization and security agenda by centralizing a previously fragmented IT environment and unifying core","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["UNIVERSITY"]},{"title":"Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety","source":"Security Boulevard","date":"2026-02-17T12:16:00.000Z","url":"https://securityboulevard.com/2026/02/ahead-of-the-curve-hickman-county-school-districts-proactive-approach-to-student-safety/","summary":"How Cloud Monitor provides long-term value and consistent student protection in Google Workspace In Centerville, Tennessee, Hickman County School District serves approximately 2,500 students across nine schools with a small but highly capable technology team. Leading that effort is Brad Gilbert, Director of Technology, a forward-thinking IT leader who has long recognized that student safety ... The post Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety appeared first on ManagedMethods Cybersecurity, Safety & Compliance for K-12.","tags":["SCHOOL DISTRICT","K-12"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["UNIVERSITY"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["UNIVERSITY"]}]},{"id":"retail","label":"Retail","description":"Keywords: retailer, e-commerce, consumer goods, fmcg, franchise","articles":[]},{"id":"transportation","label":"Transportation","description":"Keywords: logistics, trucking, freight, airline, air traffic control","articles":[{"title":"Week in review: Exploited newly patched BeyondTrust RCE, United Airlines CISO on building resilience","source":"Help Net Security","date":"2026-02-15T09:00:42.000Z","url":"https://www.helpnetsecurity.com/2026/02/15/week-in-review-exploited-newly-patched-beyondtrust-rce-united-airlines-ciso-on-building-resilience/","summary":"Here’s an overview of some of last week’s most interesting news, articles, interviews and videos: United Airlines CISO on building resilience when","tags":["AIRLINE"]},{"title":"United Airlines CISO on building resilience when disruption is inevitable","source":"Help Net Security","date":"2026-02-09T06:30:29.000Z","url":"https://www.helpnetsecurity.com/2026/02/09/deneen-defiore-united-airlines-aviation-cybersecurity-strategy/","summary":"United Airlines CISO shares how aviation cybersecurity strategy balances modernization, safety-critical systems, resilience, and risk.","tags":["AIRLINE"]}]},{"id":"software","label":"Software","description":"Keywords: software company, saas, xss, owasp","articles":[{"title":"Schneider Electric EcoStruxure Building Operation Workstation","source":"CISA (Alerts)","date":"2026-02-24T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-02","summary":"View CSAF\nSummary\nSchneider Electric is aware of a vulnerability in EcoStruxure Building Operation Workstation and EcoStruxure Building Operation WebStation. [EcoStruxure Building Operation (EBO)](https://www.se.com/ww/en/product-range/62111-ecostruxure-building-operation-software/#overview) is an open and scalable software platform providing insight, control and management of multiple building systems and devices in one mobile-enabled convenient view. It delivers valuable data for decision-making to improve energy management and increase efficiency for better building performance and comfort, reduced carbon, and more sustainable building environments. Failure to apply the remediations below may risk exposure of local files or denial of service, which could result in data breaches, and operational disruptions.\nThe following versions of Schneider Electric EcoStruxure Building Operation Workstation are affected:\nEcoStruxure Building Operation Workstation vers:generic/>=7.0.x|<7.0.3.2000_","tags":["SOFTWARE PLATFORM"]},{"title":"Building Secure SaaS Architecture: Why Identity Must Be Designed from Day One","source":"Security Boulevard","date":"2026-02-24T09:35:57.000Z","url":"https://securityboulevard.com/2026/02/building-secure-saas-architecture-why-identity-must-be-designed-from-day-one/","summary":"Learn why identity must be built into SaaS architecture from day one to ensure secure authentication, compliance, and scalable growth.","tags":["SAAS"]},{"title":"Building Secure Authentication Faster: When SaaS Teams Should Go Passwordless","source":"Security Boulevard","date":"2026-02-16T11:28:32.000Z","url":"https://securityboulevard.com/2026/02/building-secure-authentication-faster-when-saas-teams-should-go-passwordless/","summary":"Learn when SaaS teams should adopt passwordless authentication to boost security, reduce friction, and accelerate secure product development.","tags":["SAAS"]},{"title":"AI Governance. When AI becomes an Identity.","source":"Security Boulevard","date":"2026-02-13T06:17:51.000Z","url":"https://securityboulevard.com/2026/02/ai-governance-when-ai-becomes-an-identity/","summary":"Building the Control Plane for ERP, Finance, and SaaS AI didn’t come with a rollout plan; it crept in unnoticed. Someone turned on a copilot in a finance or CRM application, an IT team tested an agent on a non‑production system that still contained real audit data, or a regional team started using an AI The post AI Governance. When AI becomes an Identity. appeared first on Safepaas.","tags":["SAAS"]},{"title":"Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","source":"Arctic Wolf","date":"2026-02-23T16:59:04.000Z","url":"https://arcticwolf.com/resources/blog/welcoming-sevco-security-expanding-the-aurora-platform-with-visionary-exposure-management/","summary":"By Dan Schiappa, President, Technology and Services, Arctic Wolf Security operations is undergoing a fundamental shift. For years, organizations have focused primarily on detecting and responding to threats after they occur. But as attack surfaces expand across endpoints, cloud, identity, SaaS, and infrastructure, that reactive model is no longer enough. Security teams are increasingly being ... Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","tags":["SAAS"]}]},{"id":"agriculture","label":"Agriculture","description":"Keywords: agriculture, farm, crops, livestock, agritech","articles":[]},{"id":"consulting","label":"Consulting","description":"Keywords: consulting firm, management consultant, advisory","articles":[]},{"id":"food","label":"Food & Beverage","description":"Keywords: food company, beverage, restaurant chain, catering","articles":[]},{"id":"insurance","label":"Insurance","description":"Keywords: insurance, reinsurance, underwriting, insurer","articles":[{"title":"Why do Hackers Focus on Medical Records?","source":"HIPAA Journal","date":"2026-02-04T10:50:06.000Z","url":"https://www.hipaajournal.com/hackers-and-medical-records/","summary":"Hackers focus on medical records because the combination of demographic data, insurance details, clinical information, and financial identifiers creates a […]\nThe post Why do Hackers Focus on Medical Records? appeared first on The HIPAA Journal.","tags":["INSURANCE"]}]},{"id":"real-estate","label":"Real Estate","description":"Keywords: real estate, reit, property management, realtor","articles":[{"title":"Real estate agents in Australia using apps that leave millions of lease documents at risk, digital researcher says","source":"The Guardian","date":"2026-02-01T14:00:32.000Z","url":"https://www.theguardian.com/australia-news/2026/feb/02/real-estate-agents-in-australia-using-apps-that-leave-millions-of-lease-documents-at-risk-digital-researcher-says","summary":"‘This is a blatant and disturbing disregard for the law and for people’s security,’ digital rights advocate says","tags":["REAL ESTATE"]}]},{"id":"manufacturing","label":"Manufacturing","description":"Keywords: manufacturing, industrial control, ics, factory","articles":[{"title":"Manufacturers fortify cyber defenses in response to dramatic surge in attacks","source":"Cybersecurity Dive","date":"2026-01-29T21:57:30.000Z","url":"https://www.cybersecuritydive.com/news/manufacturing-sector-cyber-threats-collaboration-ransomware/810930/","summary":"IT/OT convergence and other trends are making the manufacturing industry’s networks more vulnerable and more frequently targeted, but sector leaders are working to improve their cyber posture.","tags":["MANUFACTURING"]},{"title":"3 Threat Groups Started Targeting ICS/OT in 2025: Dragos","source":"Security Week","date":"2026-02-17T11:05:26.000Z","url":"https://www.securityweek.com/3-threat-groups-started-targeting-ics-ot-in-2025-dragos/","summary":"Industrial cybersecurity firm Dragos has published its 9th Year in Review OT/ICS Cybersecurity Report.\nThe post 3 Threat Groups Started Targeting ICS/OT in 2025: Dragos  appeared first on SecurityWeek.","tags":["ICS"]},{"title":"ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Aveva, Phoenix Contact","source":"Security Week","date":"2026-02-11T07:42:01.000Z","url":"https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-aveva-phoenix-contact/","summary":"Siemens, Schneider Electric, Aveva, and Phoenix Contact publish Patch Tuesday advisories for vulnerabilities found in their ICS/OT products.","tags":["ICS"]},{"title":"Poland Energy Sector Cyber Incident Highlights OT and ICS Security Gaps","source":"CISA (Alerts)","date":"2026-02-10T12:00:00.000Z","url":"https://www.cisa.gov/news-events/alerts/2026/02/10/poland-energy-sector-cyber-incident-highlights-ot-and-ics-security-gaps","summary":"The purpose of this Alert is to amplify Poland’s Computer Emergency Response Team (CERT Polska’s) Energy Sector Incident Report published on Jan. 30, 2026, and highlight key mitigations for Energy Sector stakeholders.","tags":["ICS"]},{"title":"Manufacturers fortify cyber defenses in response to dramatic surge in attacks","source":"Cybersecurity Dive","date":"2026-01-29T21:57:30.000Z","url":"https://www.cybersecuritydive.com/news/manufacturing-sector-cyber-threats-collaboration-ransomware/810930/","summary":"IT/OT convergence and other trends are making the manufacturing industry’s networks more vulnerable and more frequently targeted, but sector leaders are working to improve their cyber posture.","tags":["MANUFACTURING"]},{"title":"Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor","source":"HIPAA Journal","date":"2026-02-23T17:51:12.000Z","url":"https://www.hipaajournal.com/vikor-scientific-catalyst-rcm-data-breach/","summary":"Vikor Scientific (now rebranded as Vanta Diagnostics), a molecular diagnostics company based in Charleston, South Carolina, has been affected by […]\nThe post Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor appeared first on The HIPAA Journal.","tags":["ICS"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["ICS"]},{"title":"Big oil is betting big on Toyota to win the solid-state battery race","source":"Electrek","date":"2026-02-09T23:04:48.000Z","url":"https://electrek.co/2026/02/09/big-oil-is-betting-big-on-toyota-to-win-the-solid-state-battery-race/","summary":"Toyota has been working on a solid-state program with Japanese refining oil giant Idemitsu Kosan since 2023. Now they're building a factory.","tags":["FACTORY"]},{"title":"Texas Sues TP-Link for Covering Up Chinese Manufacturing","source":"Inforisk","date":"2026-02-18T00:00:00.000Z","url":"https://www.inforisktoday.com/texas-sues-tp-link-for-covering-up-chinese-manufacturing-a-30792","summary":"The Texas attorney general invoked state consumer protection law to sue Wi-Fi router maker TP-Link Systems for misrepresenting its connections to mainland China and","tags":["MANUFACTURING"]},{"title":"Fake CAPTCHA Attacks Emerge as Key Entry Point for LummaStealer Malware Campaigns","source":"Cyber Security News","date":"2026-02-12T09:41:12.000Z","url":"https://cybersecuritynews.com/fake-captcha-attacks-emerge-as-entry-point-for-lummastealer/","summary":"LummaStealer, a notorious information-stealing malware, has made a significant comeback following a major law enforcement disruption in 2025. This resurgence is characterized by a shift in distribution tactics, moving away from traditional exploit kits towards aggressive social engineering campaigns. Cybercriminals are now leveraging “ClickFix” techniques, which present users with fake CAPTCHA verification pages. These deceptive […]\nThe post Fake CAPTCHA Attacks Emerge as Key Entry Point for LummaStealer Malware Campaigns appeared first on Cyber Security News.","tags":["ICS"]},{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["ICS"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["ICS"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["ICS"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["ICS"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["ICS"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ICS"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["FACTORY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ICS"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["ICS"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["ICS"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["ICS"]},{"title":"Hackers target Microsoft Entra accounts in device code vishing attacks","source":"Bleeping Computer","date":"2026-02-19T12:30:37.000Z","url":"https://www.bleepingcomputer.com/news/security/hackers-target-microsoft-entra-accounts-in-device-code-vishing-attacks/","summary":"Threat actors are targeting technology, manufacturing, and financial organizations in campaigns that combine device code phishing and voice phishing (vishing) to abuse the OAuth 2.0 Device Authorization flow and compromise Microsoft Entra accounts.","tags":["MANUFACTURING"]},{"title":"Jinan USR IOT Technology Limited (PUSR) USR-W610","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials.\nThe following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected:\nUSR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nJinan USR IOT Technology Limited (PUSR)\nJinan USR IOT Technology Limited (PUSR) USR-W610\nWeak Password Requirements, Cleartext Transmission of Sensitive Information, Insufficiently Protected Credentials, Missing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25715\nThe web management interface of the device allows the administrator username and password to be set to blank va","tags":["MANUFACTURING"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ICS"]},{"title":"Agentic AI must be deployed at scale with a systematic approach","source":"Techmonitor","date":"2026-02-17T11:08:43.000Z","url":"https://www.techmonitor.ai/comment-2/agentic-ai-must-be-deployed-at-scale-with-a-systematic-approach","summary":"Rajan Padmanabhan, principal technology architect for data analytics and AI at Infosys advises data readiness for effective agentic AI deployment.","tags":["ICS"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["FACTORY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ICS"]},{"title":"Siemens SINEC NMS","source":"CISA (Alerts)","date":"2026-02-12T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-01","summary":"View CSAF\nSummary\nMultiple Siemens products are affected by two local privilege escalation vulnerabilities which could allow an low privileged attacker to load malicious DLLs, potentially leading to arbitrary code execution with elevated privileges. Siemens has released new versions for the affected products and recommends to update to the latest versions.\nThe following versions of Siemens SINEC NMS are affected:\nSINEC NMS: Versions prior to V4.0 SP2 (CVE-2026-25655)\nSINEC NMS: All Versions (CVE-2026-25656)\nUser Management Component (UMC) vers:intdot/<2.15.2.1 (CVE-2026-25656)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 7.8\nSiemens\nSiemens SINEC NMS\nUncontrolled Search Path Element\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology, Energy, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\nVulnerabilities\nExpand All +\nCVE-2026-25655\nThe affected application permits improper modification of a configuration file by a lo","tags":["MANUFACTURING"]},{"title":"ZLAN Information Technology Co. ZLAN5143D","source":"CISA (Alerts)","date":"2026-02-10T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-02","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in an attacker bypassing authentication, or resetting the device password.\nThe following versions of ZLAN Information Technology Co. ZLAN5143D are affected:\nZLAN5143D v1.600 (CVE-2026-25084, CVE-2026-24789)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nZLAN Information Technology Co.\nZLAN Information Technology Co. ZLAN5143D\nMissing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25084\nAuthentication for the device can be bypassed by directly accessing internal URLs.\nView CVE Details\nAffected Products\nZLAN Information Technology Co. ZLAN5143D\nVendor:\nZLAN Information Technology Co.\nProduct Version:\nZLAN Information Technology Co. ZLAN5143D: v1.600\nProduct Status:\nknown_affected\nRemediations\nVendor fix\nZLAN Information Technology Co. did","tags":["MANUFACTURING"]}]},{"id":"energy","label":"Energy & Utilities","description":"Keywords: energy company, power grid, renewable energy, utilities, oil and gas","articles":[{"title":"New NCSC-Led OT Security Guidance for Nuclear Reactors","source":"Inforisk","date":"2026-02-13T00:00:00.000Z","url":"https://www.inforisktoday.com/blogs/new-ncsc-led-ot-security-guidance-for-nuclear-reactors-p-4044","summary":"OT weaknesses are compounding across utilities, with 22% of critical infrastructure firms reporting OT incidents and external access driving half of breaches. U.K. NCSC's new guidance outlines connectivity principles that utilities can embed to avoid costly retrofits and compliance issues.","tags":["UTILITIES"]},{"title":"Global Energy Systems Exposed: Study Finds Widespread Cybersecurity Gaps in Power Grid OT Networks","source":"Secure Reading","date":"2026-01-29T14:27:04.000Z","url":"https://securereading.com/energy-ot-cybersecurity-gaps/","summary":"energy OT cybersecurity gaps","tags":["POWER GRID"]},{"title":"Russian ELECTRUM Tied to December 2025 Cyber Attack on Polish Power Grid","source":"The Hackers News","date":"2026-01-28T16:06:00.000Z","url":"https://thehackernews.com/2026/01/russian-electrum-tied-to-december-2025.html","summary":"Dragos attributes a December 2025 Polish grid attack to ELECTRUM, disrupting ~30 DER sites without outages but damaging OT.","tags":["POWER GRID"]}]},{"id":"finance","label":"Financial Services","description":"Keywords: bank, fintech, investment firm, cryptocurrency, wire fraud","articles":[{"title":"Illinois man pleads guilty to hacking hundreds of Snapchat accounts to steal nude photos","source":"The Record","date":"2026-02-06T16:02:38.000Z","url":"https://therecord.media/illinois-man-pleads-guilty-snapchat-nude-photo-hacks","summary":"Kyle Svara of Oswego, Illinois is facing decades in prison after pleading guilty to aggravated identity theft, wire fraud, computer fraud, conspiracy to commit computer fraud and false statements related to child pornography.","tags":["WIRE FRAUD"]},{"title":"Building a Zero-Trust Framework for Cloud Banking","source":"Security Boulevard","date":"2026-02-04T08:24:38.000Z","url":"https://securityboulevard.com/2026/02/building-a-zero-trust-framework-for-cloud-banking/","summary":"Zero-trust architecture helps banks secure cloud environments, meet regulations, and scale innovation through identity-first security.","tags":["BANK"]},{"title":"Chinese National Jailed to 46 Months for Laundering Millions of Dollars Stolen from American Investors","source":"Cyber Security News","date":"2026-01-28T08:18:50.000Z","url":"https://cybersecuritynews.com/chinese-national-jailed-to-46-months-for-laundering-millions-of-dollars/","summary":"A Chinese national named Jingliang Su has been sentenced to 46 months in prison for his involvement in a major cryptocurrency fraud scheme targeting American investors. On January 27, 2026, federal courts ordered Su to serve his sentence and pay $26.9 million in restitution to victims. The case represents a significant law enforcement victory against […]\nThe post Chinese National Jailed to 46 Months for Laundering Millions of Dollars Stolen from American Investors appeared first on Cyber Security News.","tags":["CRYPTOCURRENCY"]},{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["CRYPTOCURRENCY"]},{"title":"Figure Breach Enters New Phase After Data Leak Claims","source":"Security Boulevard","date":"2026-02-18T21:53:41.000Z","url":"https://securityboulevard.com/2026/02/figure-breach-enters-new-phase-after-data-leak-claims/","summary":"The data breach disclosed by fintech lender Figure Technology Solutions is moving beyond a contained security incident, as reports that stolen customer information is circulating online coincide with early legal investigations. The developments mark the point where an internal breach begins to create broader consumer risk and potential liability. Latest Developments Data associated with the The post Figure Breach Enters New Phase After Data Leak Claims appeared first on Centraleyes.","tags":["FINTECH"]},{"title":"Data breach at fintech firm Figure affects nearly 1 million accounts","source":"Bleeping Computer","date":"2026-02-18T14:01:08.000Z","url":"https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/","summary":"Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company.","tags":["FINTECH"]},{"title":"Why Banks Need AI-Driven Segmentation Against Ransomware","source":"Inforisk","date":"2026-02-10T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/banks-need-ai-driven-segmentation-against-ransomware-i-5524","summary":"AI-powered ransomware compresses attacks from weeks to minutes. Michael Villar, director of field security technology at Akamai, says banks need AI-driven","tags":["BANK"]}]},{"id":"telecom","label":"Telecommunications","description":"Keywords: telecom, internet service provider, broadband, 5g network","articles":[{"title":"9th February – Threat Intelligence Report","source":"Checkpoint Research","date":"2026-02-09T12:50:16.000Z","url":"https://research.checkpoint.com/2026/9th-february-threat-intelligence-report/","summary":"For the latest discoveries in cyber research for the week of 9th February, please download our Threat Intelligence Bulletin. TOP ATTACKS AND BREACHES Romania’s national oil pipeline operator, Conpet, has suffered a cyberattack that disrupted its IT systems and took its website offline. The company said operational technology, including pipeline control and telecommunications systems, remained […]","tags":["TELECOM"]}]}]}