{"updated":"2026-02-25T01:05:50.865Z","industries":[{"id":"government","label":"Government","description":"Keywords: government, county, federal, defense, court","articles":[{"title":"Cyberattack Forces Clinic Closures, Surgery Cancellations at University of Mississippi Medical Center","source":"The Cyber Express","date":"2026-02-20T09:26:46.000Z","url":"https://thecyberexpress.com/ummc-cyberattack-clinic-closures-it-shutdown/","summary":"A UMMC cyberattack forced clinic closures, surgery cancellations and IT shutdowns as federal agencies investigate the breach.","tags":["FEDERAL"]},{"title":"NDSS 2025 – Diffence: Fencing Membership Privacy With Diffusion Models","source":"Security Boulevard","date":"2026-02-15T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-diffence-fencing-membership-privacy-with-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters:  PAPER Yuefeng Peng (University of Massachusetts Amherst), Ali Naseh (University of Massachusetts Amherst), Amir Houmansadr (University of Massachusetts Amherst) Deep learning models, while achieving remarkable performances across various tasks, are vulnerable to membership inference attacks (MIAs), wherein adversaries identify if a specific data point was part of the model's training set. This susceptibility raises substantial privacy concerns, especially when models are trained on sensitive datasets. Although various defenses have been proposed, there is still substantial room for improvement in the privacy-utility trade-off. In this work, we introduce a novel defense framework against MIAs by leveraging generative models. The key intuition of our defense is to *remove the differences between member and non-member inputs*, which is exploited by MIAs, by re-generating input samples before feeding them to the target mod","tags":["DEFENSE"]}]},{"id":"healthcare","label":"Healthcare","description":"Keywords: healthcare, hospital, clinic, medical, biotech, pharmacy, pharma, hipaa","articles":[{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["CLINIC","MEDICAL"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["HOSPITAL","CLINIC","MEDICAL"]},{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["MEDICAL"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["CLINIC","MEDICAL","HIPAA"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["CLINIC","MEDICAL"]},{"title":"Cyberattack Forces Clinic Closures, Surgery Cancellations at University of Mississippi Medical Center","source":"The Cyber Express","date":"2026-02-20T09:26:46.000Z","url":"https://thecyberexpress.com/ummc-cyberattack-clinic-closures-it-shutdown/","summary":"A UMMC cyberattack forced clinic closures, surgery cancellations and IT shutdowns as federal agencies investigate the breach.","tags":["CLINIC","MEDICAL"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["CLINIC","MEDICAL"]},{"title":"Univ. of Mississippi Medical Center Dealing With Cyberattack","source":"Inforisk","date":"2026-02-19T00:00:00.000Z","url":"https://www.inforisktoday.com/univ-mississippi-medical-center-dealing-cyberattack-a-30808","summary":"The University of Mississippi Medical Center on Thursday said a ransomware attack has triggered its emergency operations plan and forced its hospitals to cancel all","tags":["HOSPITAL","MEDICAL"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["CLINIC"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["MEDICAL","HIPAA"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["HEALTHCARE"]}]},{"id":"construction","label":"Construction","description":"Keywords: construction, construct, HVAC, building","articles":[{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["CONSTRUCT"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["BUILDING"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["CONSTRUCTION","CONSTRUCT"]}]},{"id":"business-services","label":"Business Services","description":"Keywords: business, professional, services, accounting, law firm, LLP, associates, law","articles":[{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["BUSINESS"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["BUSINESS","LAW"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["BUSINESS"]}]},{"id":"education","label":"Education","description":"Keywords: education, school, district, K-12, college, higher education, highered, university","articles":[{"title":"NDSS 2025 – RadSee: See Your Handwriting Through Walls Using FMCW Rada","source":"Security Boulevard","date":"2026-02-24T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-radsee-see-your-handwriting-through-walls-using-fmcw-rada/","summary":"Authors, Creators & Presenters: Shichen Zhang (Michigan State University), Qijun Wang (Michigan State University), Maolin Gan (Michigan State University), Zhichao Cao (Michigan State University), Huacheng Zeng (Michigan State University) PAPER RadSee: See Your Handwriting Through Walls Using FMCW Radar This paper aims to design and implement a radio device capable of detecting a person's handwriting through a wall. Although there is extensive research on radio frequency (RF) based human activity recognition, this task is particularly challenging due to the through-wall requirement and the tiny-scale handwriting movements. To address these challenges, we present RadSee---a 6 GHz frequency modulated continuous wave (FMCW) radar system designed for detecting handwriting content behind a wall. RadSee is realized through a joint hardware and software design. On the hardware side, RadSee features a 6 GHz FMCW radar device equipped with two custom-designed, high-gain patch antennas. These two","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Generating API Specifications For Bug Detection Via Specification Propagation Analysis","source":"Security Boulevard","date":"2026-02-23T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-specifications-for-bug-detection-via-specification-propagation-analysis/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Uncovering The Iceberg From The Tip: Generating API Specifications For Bug Detection Via Specification Propagation Analysis Modern software often provides diverse APIs to facilitate development. Certain APIs, when used, can affect variables and requi","tags":["SCHOOL","UNIVERSITY"]},{"title":"NDSS 2025 – Generating API Parameter Security Rules With LLM For API Misuse Detection","source":"Security Boulevard","date":"2026-02-23T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-parameter-security-rules-with-llm-for-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Generating API Parameter Security Rules with LLM for API Misuse Detection When utilizing library APIs, developers should follow the API security rules to mitigate the risk of API misuse. API Parameter Security Rule (APSR) is a common type of security","tags":["SCHOOL","UNIVERSITY"]},{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["UNIVERSITY"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – The Midas Touch: Triggering The Capability Of LLMs For RM-API Misuse Detection","source":"Security Boulevard","date":"2026-02-22T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-the-midas-touch-triggering-the-capability-of-llms-for-rm-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER The Midas Touch: Triggering the Capability of LLMs for RM-API Misuse Detection As the basis of software resource management (RM), strictly following the RM-API constraints guarantees secure resource management and software. To enhance the RM-API appl","tags":["SCHOOL","UNIVERSITY"]},{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["UNIVERSITY"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["UNIVERSITY"]},{"title":"Cyberattack Forces Clinic Closures, Surgery Cancellations at University of Mississippi Medical Center","source":"The Cyber Express","date":"2026-02-20T09:26:46.000Z","url":"https://thecyberexpress.com/ummc-cyberattack-clinic-closures-it-shutdown/","summary":"A UMMC cyberattack forced clinic closures, surgery cancellations and IT shutdowns as federal agencies investigate the breach.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – NDSS 2025 – BARBIE: Robust Backdoor Detection Based On Latent Separability","source":"Security Boulevard","date":"2026-02-19T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ndss-2025-barbie-robust-backdoor-detection-based-on-latent-separability/","summary":"Session 12D: ML Backdoors   Authors, Creators & Presenters: Hanlei Zhang (Zhejiang University), Yijie Bai (Zhejiang University), Yanjiao Chen (Zhejiang University), Zhongming Ma (Zhejiang University), Wenyuan Xu (Zhejiang University) PAPER BARBIE: Robust Backdoor Detection Based On Latent Separability Backdoor attacks are an essential risk to deep learning model sharing. Fundamentally, backdoored models are different from benign models considering latent separability, i.e., distinguishable differences in model latent representations. However, existing methods quantify latent separability by clustering latent representations or computing distances between latent representations, which are easy to be compromised by adaptive attacks. In this paper, we propose BARBIE, a backdoor detection approach that can pinpoint latent separability under adaptive backdoor attacks. To achieve this goal, we propose a new latent separability metric, named relative competition score (RCS), by characterizing","tags":["UNIVERSITY"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["UNIVERSITY"]},{"title":"Univ. of Mississippi Medical Center Dealing With Cyberattack","source":"Inforisk","date":"2026-02-19T00:00:00.000Z","url":"https://www.inforisktoday.com/univ-mississippi-medical-center-dealing-cyberattack-a-30808","summary":"The University of Mississippi Medical Center on Thursday said a ransomware attack has triggered its emergency operations plan and forced its hospitals to cancel all","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – CLIBE: Detecting Dynamic Backdoors In Transformer-based NLP Models","source":"Security Boulevard","date":"2026-02-18T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-clibe-detecting-dynamic-backdoors-in-transformer-based-nlp-models/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Rui Zeng (Zhejiang University), Xi Chen (Zhejiang University), Yuwen Pu (Zhejiang University), Xuhong Zhang (Zhejiang University), Tianyu Du (Zhejiang University), Shouling Ji (Zhejiang University) PAPER CLIBE: Detecting Dynamic Backdoors in Transformer-based NLP Models Backdoors can be injected into NLP models to induce misbehavior when the input text contains a specific feature, known as a trigger, which the attacker secretly selects. Unlike fixed tokens, words, phrases, or sentences used in the static text trigger, dynamic backdoor attacks on NLP models design triggers associated with abstract and latent text features (e.g., style), making them considerably stealthier than traditional static backdoor attacks. However, existing research on NLP backdoor detection primarily focuses on defending against static backdoor attacks, while research on detecting dynamic backdoors in NLP models remains largely unexplored. This paper pre","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["UNIVERSITY"]},{"title":"University of Pennsylvania - 623,750 breached accounts","source":"Have I Been Pwned","date":"2026-02-16T21:57:51.000Z","url":"https://haveibeenpwned.com/Breach/UniversityOfPennsylvania","summary":"In October 2025, the University of Pennsylvania was the victim of a data breach followed by a ransom demand, largely affecting its donor database. After the incident, the attackers sent inflammatory emails to some victims. The data was later published online in February 2026 and included 624k unique email addresses alongside names and physical addresses. For some donor records, additional personal information was exposed, including gender and date of birth. A small subset of records also contained religion, spouse name, estimated income and donation history.","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Diffence: Fencing Membership Privacy With Diffusion Models","source":"Security Boulevard","date":"2026-02-15T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-diffence-fencing-membership-privacy-with-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters:  PAPER Yuefeng Peng (University of Massachusetts Amherst), Ali Naseh (University of Massachusetts Amherst), Amir Houmansadr (University of Massachusetts Amherst) Deep learning models, while achieving remarkable performances across various tasks, are vulnerable to membership inference attacks (MIAs), wherein adversaries identify if a specific data point was part of the model's training set. This susceptibility raises substantial privacy concerns, especially when models are trained on sensitive datasets. Although various defenses have been proposed, there is still substantial room for improvement in the privacy-utility trade-off. In this work, we introduce a novel defense framework against MIAs by leveraging generative models. The key intuition of our defense is to *remove the differences between member and non-member inputs*, which is exploited by MIAs, by re-generating input samples before feeding them to the target mod","tags":["UNIVERSITY"]},{"title":"Upcoming Speaking Engagements","source":"Schneier on Security","date":"2026-02-14T17:04:59.000Z","url":"https://www.schneier.com/blog/archives/2026/02/upcoming-speaking-engagements-53.html","summary":"This is a current list of where and when I am scheduled to speak: I’m speaking at Ontario Tech University in Oshawa, Ontario, Canada, at 2 PM ET on Thursday, February 26, 2026. I’m speaking at the Personal AI Summit in Los Angeles, California, USA, on Thursday, March 5, 2026. I’m speaking at Tech Live: Cybersecurity in New York City, USA, on Wednesday, March 11, 2026. I’m giving the Ross Anderson Lecture at the University of Cambridge’s Churchill College at 5:30 PM GMT on Thursday, March 19, 2026. I’m speaking at RSAC 2026 in San Francisco, California, USA, on Wednesday, March 25, 2026...","tags":["COLLEGE","UNIVERSITY"]},{"title":"NDSS 2025 –  Black-Box Membership Inference Attacks Against Fine-Tuned Diffusion Models","source":"Security Boulevard","date":"2026-02-14T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-black-box-membership-inference-attacks-against-fine-tuned-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Yan Pang (University of Virginia), Tianhao Wang (University of Virginia) PAPER Black-box Membership Inference Attacks against Fine-tuned Diffusion Models With the rapid advancement of diffusion-based image-generative models, the quality of generated images has become increasingly photorealistic. Moreover, with the release of high-quality pre-trained image-generative models, a growing number of users are downloading these pre-trained models to fine-tune them with downstream datasets for various image-generation tasks. However, employing such powerful pre-trained models in downstream tasks presents significant privacy leakage risks. In this paper, we propose the first scores-based membership inference attack framework tailored for recent diffusion models, and in the more stringent black-box access setting. Considering four distinct attack scenarios and three types of attacks, this framework is capable of targeting any pop","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["UNIVERSITY"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Italian university La Sapienza still offline to mitigate recent cyber attack","source":"Security Affairs","date":"2026-02-07T18:02:53.000Z","url":"https://securityaffairs.com/187702/cyber-crime/italian-university-la-sapienza-still-offline-to-mitigate-recent-cyber-attack.html","summary":"Rome’s La Sapienza University was hit by a cyberattack that disrupted IT systems and caused widespread operational issues.","tags":["UNIVERSITY"]},{"title":"Man pleads guilty to hacking nearly 600 women’s Snapchat accounts","source":"Bleeping Computer","date":"2026-02-06T12:34:30.000Z","url":"https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-nearly-600-womens-snapchat-accounts/","summary":"An Illinois man pleaded guilty to hacking nearly 600 women's Snapchat accounts to steal nude photos that he kept, sold, or traded online, including accounts he compromised at the request of a former university track coach who was later convicted of sextortion.","tags":["UNIVERSITY"]},{"title":"La Sapienza Cyberattack Forces Italy’s Largest University Offline","source":"The Cyber Express","date":"2026-02-06T09:46:30.000Z","url":"https://thecyberexpress.com/la-sapienza-cyberattack-bablock-ransomware/","summary":"The La Sapienza cyberattack forced Italy’s largest university offline as officials investigate a possible BabLock ransomware incident.","tags":["UNIVERSITY"]},{"title":"Cyberattack Forces Network Shutdown at Rome’s La Sapienza University","source":"Secure Reading","date":"2026-02-06T06:23:45.000Z","url":"https://securereading.com/la-sapienza-university-cyberattack/","summary":"La Sapienza University cyberattack","tags":["UNIVERSITY"]},{"title":"One of Europe’s largest universities knocked offline for days after cyberattack","source":"TechCrunch","date":"2026-02-05T19:00:46.000Z","url":"https://techcrunch.com/2026/02/05/one-of-europes-largest-universities-knocked-offline-for-days-after-cyberattack/","summary":"An alleged ransomware attack has taken down the systems of the Sapienza University of Rome.","tags":["UNIVERSITY"]},{"title":"Italian university La Sapienza goes offline after cyberattack","source":"Bleeping Computer","date":"2026-02-05T17:02:45.000Z","url":"https://www.bleepingcomputer.com/news/security/italian-university-la-sapienza-goes-offline-after-cyberattack/","summary":"Rome's \"La Sapienza\" university has been targeted by a cyberattack that impacted its IT systems and caused widespread operational disruptions at the educational institute.","tags":["EDUCATION","UNIVERSITY"]},{"title":"Two Ivy League universities had donor information breaches. Will donors be notified?","source":"Databreaches.net","date":"2026-02-05T02:47:16.000Z","url":"https://databreaches.net/2026/02/04/two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified/?pk_campaign=feed&pk_kwd=two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified","summary":"Harvard University and the University of Pennsylvania (UPenn) have more in common than just being Ivy League universities. Both suffered data breaches involving","tags":["UNIVERSITY"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["SCHOOL","UNIVERSITY"]},{"title":"Harvard, UPenn Data Leaked in ShinyHunters Shakedown","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/harvard-upenn-data-leaked-in-shinyhunters-shakedown-a-30677","summary":"Harvard University has been named as a victim and doxed by hack-and-leak group ShinyHunters, apparently as a result of the cybercrime group's ongoing \"live","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["SCHOOL","UNIVERSITY"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Silence False Alarms","source":"Security Boulevard","date":"2026-01-30T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-silence-false-alarms/","summary":"Session 11A: Blockchain Security 2  Authors, Creators & Presenters: Qiyang Song (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Heqing Huang (Institute of Information Engineering, Chinese Academy of Sciences), Xiaoqi Jia (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Yuanbo Xie (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Jiahao Cao (Institute for Network Sciences and Cyberspace, Tsinghua University) PAPER Silence False Alarms: Identifying Anti-Reentrancy Patterns on Ethereum to Refine Smart Contract Reentrancy Detection Reentrancy vulnerabilities in Ethereum smart contracts have caused significant financial losses, prompting the creation of several automated reentrancy detectors. However, these detectors frequently","tags":["SCHOOL","UNIVERSITY"]},{"title":"NDSS 2025 – Provably Unlearnable Data Examples","source":"Security Boulevard","date":"2026-01-30T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-provably-unlearnable-data-examples/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Derui Wang (CSIRO's Data61), Minhui Xue (CSIRO's Data61), Bo Li (The University of Chicago), Seyit Camtepe (CSIRO's Data61), Liming Zhu (CSIRO's Data61) PAPER Provably Unlearnable Data Examples The exploitation of publicly accessible data has led to escalating concerns regarding data privacy and intellectual property (IP) breaches in the age of artificial intelligence. To safeguard both data privacy and IP-related domain knowledge, efforts have been undertaken to render shared data unlearnable for unauthorized models in the wild. Existing methods apply empirically optimized perturbations to the data in the hope of disrupting the correlation between the inputs and the corresponding labels such that the data samples are converted into Unlearnable Examples (UEs). Nevertheless, the absence of mechanisms to verify the robustness of UEs against uncertainty in unauthorized models and their training procedures engenders several","tags":["UNIVERSITY"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["EDUCATION","UNIVERSITY"]},{"title":"Why life changes increase digital risk: Are you ready for moving, new jobs, or university?","source":"Panda (Labs)","date":"2026-01-30T07:00:22.000Z","url":"https://www.pandasecurity.com/en/mediacenter/why-life-changes-increase-digital-risk-are-you-ready-for-moving-new-jobs-or-university/","summary":"Life changes increase digital risk ⚠️ Are you ready for digital threats when moving, changing jobs or starting university?","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Reinforcement Unlearning","source":"Security Boulevard","date":"2026-01-29T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-reinforcement-unlearning/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Dayong Ye (University of Technology Sydney), Tianqing Zhu (City University of Macau), Congcong Zhu (City University of Macau), Derui Wang (CSIRO's Data61), Kun Gao (University of Technology Sydney), Zewei Shi (CSIRO's Data61), Sheng Shen (Torrens University Australia), Wanlei Zhou (City University of Macau), Minhui Xue (CSIRO's Data61) PAPER Reinforcement Unlearning Machine unlearning refers to the process of mitigating the influence of specific training data on machine learning models based on removal requests from data owners. However, one important area that has been largely overlooked in the research of unlearning is reinforcement learning. Reinforcement learning focuses on training an agent to make optimal decisions within an environment to maximize its cumulative rewards. During the training, the agent tends to memorize the features of the environment, which raises a significant concern about privacy. As per data p","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["UNIVERSITY"]},{"title":"What happens if agentic AI falls into the wrong hands? [Q&A]","source":"Beta News","date":"2026-01-29T13:59:10.000Z","url":"https://betanews.com/article/what-happens-if-agentic-ai-falls-into-the-wrong-hands-qa/","summary":"Agentic AI systems are increasingly taking on real-world roles -- by 2028 Gartner predicts that 15 percent of day-to-day work decisions will be made by agentic AI. But do we fully understand the potential harm that could be caused if these systems were weaponized by bad actors? We spoke to Keeley Crockett, senior IEEE member and professor in computational intelligence at the Manchester Metropolitan University to find out. BN: What is agentic AI and what differentiates it from a standard AI assistant? KC: Agentic AI refers to artificial intelligence systems with a high degree of autonomy that can act independently… [Continue Reading]","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Recurrent Private Set Intersection For Unbalanced Databases With Cuckoo Hashing","source":"Security Boulevard","date":"2026-01-28T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-recurrent-private-set-intersection-for-unbalanced-databases-with-cuckoo-hashing/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Eduardo Chielle (New York University Abu Dhabi), Michail Maniatakos (New York University Abu Dhabi) PAPER Recurrent Private Set Intersection for Unbalanced Databases with Cuckoo Hashing and Leveled FHE A Private Set Intersection (PSI) protocol is a cryptographic method allowing two parties, each with a private set, to determine the intersection of their sets without revealing any information about their entries except for the intersection itself. While extensive research has focused on PSI protocols, most studies have centered on scenarios where two parties possess sets of similar sizes, assuming a semi-honest threat model. However, when the sizes of the parties' sets differ significantly, a generalized solution tends to underperform compared to a specialized one, as recent research has demonstrated. Additionally, conventional PSI protocols are typically designed for a single execution, requiring the entire protocol to","tags":["UNIVERSITY"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["UNIVERSITY"]},{"title":"Inside Arizona's Push to Modernize and Secure Campus IT","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/inside-arizonas-push-to-modernize-secure-campus-it-a-30619","summary":"The University of Arizona is advancing a campus-wide modernization and security agenda by centralizing a previously fragmented IT environment and unifying core","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["UNIVERSITY"]}]},{"id":"retail","label":"Retail","description":"Keywords: retail, e-commerce, stores, consumer, buyer, goods, fmcg, franchise, ATO","articles":[{"title":"NDSS 2025 – RadSee: See Your Handwriting Through Walls Using FMCW Rada","source":"Security Boulevard","date":"2026-02-24T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-radsee-see-your-handwriting-through-walls-using-fmcw-rada/","summary":"Authors, Creators & Presenters: Shichen Zhang (Michigan State University), Qijun Wang (Michigan State University), Maolin Gan (Michigan State University), Zhichao Cao (Michigan State University), Huacheng Zeng (Michigan State University) PAPER RadSee: See Your Handwriting Through Walls Using FMCW Radar This paper aims to design and implement a radio device capable of detecting a person's handwriting through a wall. Although there is extensive research on radio frequency (RF) based human activity recognition, this task is particularly challenging due to the through-wall requirement and the tiny-scale handwriting movements. To address these challenges, we present RadSee---a 6 GHz frequency modulated continuous wave (FMCW) radar system designed for detecting handwriting content behind a wall. RadSee is realized through a joint hardware and software design. On the hardware side, RadSee features a 6 GHz FMCW radar device equipped with two custom-designed, high-gain patch antennas. These two","tags":["ATO"]},{"title":"NDSS 2025 – Generating API Specifications For Bug Detection Via Specification Propagation Analysis","source":"Security Boulevard","date":"2026-02-23T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-specifications-for-bug-detection-via-specification-propagation-analysis/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Uncovering The Iceberg From The Tip: Generating API Specifications For Bug Detection Via Specification Propagation Analysis Modern software often provides diverse APIs to facilitate development. Certain APIs, when used, can affect variables and requi","tags":["ATO"]},{"title":"NDSS 2025 – Generating API Parameter Security Rules With LLM For API Misuse Detection","source":"Security Boulevard","date":"2026-02-23T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-parameter-security-rules-with-llm-for-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Generating API Parameter Security Rules with LLM for API Misuse Detection When utilizing library APIs, developers should follow the API security rules to mitigate the risk of API misuse. API Parameter Security Rule (APSR) is a common type of security","tags":["ATO"]},{"title":"NDSS 2025 – The Midas Touch: Triggering The Capability Of LLMs For RM-API Misuse Detection","source":"Security Boulevard","date":"2026-02-22T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-the-midas-touch-triggering-the-capability-of-llms-for-rm-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER The Midas Touch: Triggering the Capability of LLMs for RM-API Misuse Detection As the basis of software resource management (RM), strictly following the RM-API constraints guarantees secure resource management and software. To enhance the RM-API appl","tags":["ATO"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["ATO"]},{"title":"NDSS 2025 – NDSS 2025 – BARBIE: Robust Backdoor Detection Based On Latent Separability","source":"Security Boulevard","date":"2026-02-19T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ndss-2025-barbie-robust-backdoor-detection-based-on-latent-separability/","summary":"Session 12D: ML Backdoors   Authors, Creators & Presenters: Hanlei Zhang (Zhejiang University), Yijie Bai (Zhejiang University), Yanjiao Chen (Zhejiang University), Zhongming Ma (Zhejiang University), Wenyuan Xu (Zhejiang University) PAPER BARBIE: Robust Backdoor Detection Based On Latent Separability Backdoor attacks are an essential risk to deep learning model sharing. Fundamentally, backdoored models are different from benign models considering latent separability, i.e., distinguishable differences in model latent representations. However, existing methods quantify latent separability by clustering latent representations or computing distances between latent representations, which are easy to be compromised by adaptive attacks. In this paper, we propose BARBIE, a backdoor detection approach that can pinpoint latent separability under adaptive backdoor attacks. To achieve this goal, we propose a new latent separability metric, named relative competition score (RCS), by characterizing","tags":["ATO"]},{"title":"NDSS 2025 – CLIBE: Detecting Dynamic Backdoors In Transformer-based NLP Models","source":"Security Boulevard","date":"2026-02-18T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-clibe-detecting-dynamic-backdoors-in-transformer-based-nlp-models/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Rui Zeng (Zhejiang University), Xi Chen (Zhejiang University), Yuwen Pu (Zhejiang University), Xuhong Zhang (Zhejiang University), Tianyu Du (Zhejiang University), Shouling Ji (Zhejiang University) PAPER CLIBE: Detecting Dynamic Backdoors in Transformer-based NLP Models Backdoors can be injected into NLP models to induce misbehavior when the input text contains a specific feature, known as a trigger, which the attacker secretly selects. Unlike fixed tokens, words, phrases, or sentences used in the static text trigger, dynamic backdoor attacks on NLP models design triggers associated with abstract and latent text features (e.g., style), making them considerably stealthier than traditional static backdoor attacks. However, existing research on NLP backdoor detection primarily focuses on defending against static backdoor attacks, while research on detecting dynamic backdoors in NLP models remains largely unexplored. This paper pre","tags":["ATO"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ATO"]},{"title":"University of Pennsylvania - 623,750 breached accounts","source":"Have I Been Pwned","date":"2026-02-16T21:57:51.000Z","url":"https://haveibeenpwned.com/Breach/UniversityOfPennsylvania","summary":"In October 2025, the University of Pennsylvania was the victim of a data breach followed by a ransom demand, largely affecting its donor database. After the incident, the attackers sent inflammatory emails to some victims. The data was later published online in February 2026 and included 624k unique email addresses alongside names and physical addresses. For some donor records, additional personal information was exposed, including gender and date of birth. A small subset of records also contained religion, spouse name, estimated income and donation history.","tags":["ATO"]},{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["ATO"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["ATO"]},{"title":"NDSS 2025 – Diffence: Fencing Membership Privacy With Diffusion Models","source":"Security Boulevard","date":"2026-02-15T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-diffence-fencing-membership-privacy-with-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters:  PAPER Yuefeng Peng (University of Massachusetts Amherst), Ali Naseh (University of Massachusetts Amherst), Amir Houmansadr (University of Massachusetts Amherst) Deep learning models, while achieving remarkable performances across various tasks, are vulnerable to membership inference attacks (MIAs), wherein adversaries identify if a specific data point was part of the model's training set. This susceptibility raises substantial privacy concerns, especially when models are trained on sensitive datasets. Although various defenses have been proposed, there is still substantial room for improvement in the privacy-utility trade-off. In this work, we introduce a novel defense framework against MIAs by leveraging generative models. The key intuition of our defense is to *remove the differences between member and non-member inputs*, which is exploited by MIAs, by re-generating input samples before feeding them to the target mod","tags":["ATO"]},{"title":"NDSS 2025 –  Black-Box Membership Inference Attacks Against Fine-Tuned Diffusion Models","source":"Security Boulevard","date":"2026-02-14T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-black-box-membership-inference-attacks-against-fine-tuned-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Yan Pang (University of Virginia), Tianhao Wang (University of Virginia) PAPER Black-box Membership Inference Attacks against Fine-tuned Diffusion Models With the rapid advancement of diffusion-based image-generative models, the quality of generated images has become increasingly photorealistic. Moreover, with the release of high-quality pre-trained image-generative models, a growing number of users are downloading these pre-trained models to fine-tune them with downstream datasets for various image-generation tasks. However, employing such powerful pre-trained models in downstream tasks presents significant privacy leakage risks. In this paper, we propose the first scores-based membership inference attack framework tailored for recent diffusion models, and in the more stringent black-box access setting. Considering four distinct attack scenarios and three types of attacks, this framework is capable of targeting any pop","tags":["ATO"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["ATO"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ATO"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["ATO"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["ATO"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["ATO"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["ATO"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["ATO"]},{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["ATO"]},{"title":"NDSS 2025 – Silence False Alarms","source":"Security Boulevard","date":"2026-01-30T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-silence-false-alarms/","summary":"Session 11A: Blockchain Security 2  Authors, Creators & Presenters: Qiyang Song (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Heqing Huang (Institute of Information Engineering, Chinese Academy of Sciences), Xiaoqi Jia (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Yuanbo Xie (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Jiahao Cao (Institute for Network Sciences and Cyberspace, Tsinghua University) PAPER Silence False Alarms: Identifying Anti-Reentrancy Patterns on Ethereum to Refine Smart Contract Reentrancy Detection Reentrancy vulnerabilities in Ethereum smart contracts have caused significant financial losses, prompting the creation of several automated reentrancy detectors. However, these detectors frequently","tags":["ATO"]},{"title":"NDSS 2025 – Provably Unlearnable Data Examples","source":"Security Boulevard","date":"2026-01-30T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-provably-unlearnable-data-examples/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Derui Wang (CSIRO's Data61), Minhui Xue (CSIRO's Data61), Bo Li (The University of Chicago), Seyit Camtepe (CSIRO's Data61), Liming Zhu (CSIRO's Data61) PAPER Provably Unlearnable Data Examples The exploitation of publicly accessible data has led to escalating concerns regarding data privacy and intellectual property (IP) breaches in the age of artificial intelligence. To safeguard both data privacy and IP-related domain knowledge, efforts have been undertaken to render shared data unlearnable for unauthorized models in the wild. Existing methods apply empirically optimized perturbations to the data in the hope of disrupting the correlation between the inputs and the corresponding labels such that the data samples are converted into Unlearnable Examples (UEs). Nevertheless, the absence of mechanisms to verify the robustness of UEs against uncertainty in unauthorized models and their training procedures engenders several","tags":["ATO"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["ATO"]},{"title":"NDSS 2025 – Reinforcement Unlearning","source":"Security Boulevard","date":"2026-01-29T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-reinforcement-unlearning/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Dayong Ye (University of Technology Sydney), Tianqing Zhu (City University of Macau), Congcong Zhu (City University of Macau), Derui Wang (CSIRO's Data61), Kun Gao (University of Technology Sydney), Zewei Shi (CSIRO's Data61), Sheng Shen (Torrens University Australia), Wanlei Zhou (City University of Macau), Minhui Xue (CSIRO's Data61) PAPER Reinforcement Unlearning Machine unlearning refers to the process of mitigating the influence of specific training data on machine learning models based on removal requests from data owners. However, one important area that has been largely overlooked in the research of unlearning is reinforcement learning. Reinforcement learning focuses on training an agent to make optimal decisions within an environment to maximize its cumulative rewards. During the training, the agent tends to memorize the features of the environment, which raises a significant concern about privacy. As per data p","tags":["ATO"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["ATO"]},{"title":"NDSS 2025 – Recurrent Private Set Intersection For Unbalanced Databases With Cuckoo Hashing","source":"Security Boulevard","date":"2026-01-28T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-recurrent-private-set-intersection-for-unbalanced-databases-with-cuckoo-hashing/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Eduardo Chielle (New York University Abu Dhabi), Michail Maniatakos (New York University Abu Dhabi) PAPER Recurrent Private Set Intersection for Unbalanced Databases with Cuckoo Hashing and Leveled FHE A Private Set Intersection (PSI) protocol is a cryptographic method allowing two parties, each with a private set, to determine the intersection of their sets without revealing any information about their entries except for the intersection itself. While extensive research has focused on PSI protocols, most studies have centered on scenarios where two parties possess sets of similar sizes, assuming a semi-honest threat model. However, when the sizes of the parties' sets differ significantly, a generalized solution tends to underperform compared to a specialized one, as recent research has demonstrated. Additionally, conventional PSI protocols are typically designed for a single execution, requiring the entire protocol to","tags":["ATO"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["ATO"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["ATO"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["ATO"]}]},{"id":"transportation","label":"Transportation","description":"Keywords: transportation, truck, logistics, shipping, cars, trucking, freight, airline, air traffic control","articles":[]},{"id":"software","label":"Software","description":"Keywords: software, SaaS, applications, platforms, code, XSS, OWASP","articles":[{"title":"NDSS 2025 – RadSee: See Your Handwriting Through Walls Using FMCW Rada","source":"Security Boulevard","date":"2026-02-24T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-radsee-see-your-handwriting-through-walls-using-fmcw-rada/","summary":"Authors, Creators & Presenters: Shichen Zhang (Michigan State University), Qijun Wang (Michigan State University), Maolin Gan (Michigan State University), Zhichao Cao (Michigan State University), Huacheng Zeng (Michigan State University) PAPER RadSee: See Your Handwriting Through Walls Using FMCW Radar This paper aims to design and implement a radio device capable of detecting a person's handwriting through a wall. Although there is extensive research on radio frequency (RF) based human activity recognition, this task is particularly challenging due to the through-wall requirement and the tiny-scale handwriting movements. To address these challenges, we present RadSee---a 6 GHz frequency modulated continuous wave (FMCW) radar system designed for detecting handwriting content behind a wall. RadSee is realized through a joint hardware and software design. On the hardware side, RadSee features a 6 GHz FMCW radar device equipped with two custom-designed, high-gain patch antennas. These two","tags":["SOFTWARE"]},{"title":"NDSS 2025 – Generating API Specifications For Bug Detection Via Specification Propagation Analysis","source":"Security Boulevard","date":"2026-02-23T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-specifications-for-bug-detection-via-specification-propagation-analysis/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Uncovering The Iceberg From The Tip: Generating API Specifications For Bug Detection Via Specification Propagation Analysis Modern software often provides diverse APIs to facilitate development. Certain APIs, when used, can affect variables and requi","tags":["SOFTWARE"]},{"title":"NDSS 2025 – The Midas Touch: Triggering The Capability Of LLMs For RM-API Misuse Detection","source":"Security Boulevard","date":"2026-02-22T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-the-midas-touch-triggering-the-capability-of-llms-for-rm-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER The Midas Touch: Triggering the Capability of LLMs for RM-API Misuse Detection As the basis of software resource management (RM), strictly following the RM-API constraints guarantees secure resource management and software. To enhance the RM-API appl","tags":["SOFTWARE"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["CODE"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["CODE"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["SOFTWARE","CODE"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["SOFTWARE","CODE"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["SOFTWARE"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["APPLICATIONS"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["PLATFORMS"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["APPLICATIONS"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["CODE"]}]},{"id":"agriculture","label":"Agriculture","description":"Keywords: agriculture, farm, crops, seeds, livestock, agritech, produce food, soil","articles":[]},{"id":"consulting","label":"Consulting","description":"Keywords: consult, consulting, solutions, consultant","articles":[{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["SOLUTIONS"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["SOLUTIONS"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["SOLUTIONS"]}]},{"id":"food","label":"Food & Beverage","description":"Keywords: food, beverage, catering, FMCG, restaurant","articles":[]},{"id":"insurance","label":"Insurance","description":"Keywords: insurance, insure, reinsurance, underwriting, underwriter","articles":[]},{"id":"real-estate","label":"Real Estate","description":"Keywords: real estate, REIT, property, realtor","articles":[{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["PROPERTY"]},{"title":"NDSS 2025 – Provably Unlearnable Data Examples","source":"Security Boulevard","date":"2026-01-30T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-provably-unlearnable-data-examples/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Derui Wang (CSIRO's Data61), Minhui Xue (CSIRO's Data61), Bo Li (The University of Chicago), Seyit Camtepe (CSIRO's Data61), Liming Zhu (CSIRO's Data61) PAPER Provably Unlearnable Data Examples The exploitation of publicly accessible data has led to escalating concerns regarding data privacy and intellectual property (IP) breaches in the age of artificial intelligence. To safeguard both data privacy and IP-related domain knowledge, efforts have been undertaken to render shared data unlearnable for unauthorized models in the wild. Existing methods apply empirically optimized perturbations to the data in the hope of disrupting the correlation between the inputs and the corresponding labels such that the data samples are converted into Unlearnable Examples (UEs). Nevertheless, the absence of mechanisms to verify the robustness of UEs against uncertainty in unauthorized models and their training procedures engenders several","tags":["PROPERTY"]}]},{"id":"manufacturing","label":"Manufacturing","description":"Keywords: industrial, manufacturing, ICS","articles":[{"title":"University of Mississippi Medical Center closes clinics amid ransomware attack","source":"HealthcareDive","date":"2026-02-23T15:18:54.000Z","url":"https://www.healthcaredive.com/news/university-of-mississippi-medical-center-ransomware-attack/812823/","summary":"The academic medical center’s clinics will be closed through Tuesday. The attack, which hit UMMC last week, took its Epic electronic health record system offline.","tags":["ICS"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["ICS"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["ICS"]},{"title":"Mississippi medical center closes all clinics after ransomware attack","source":"Bleeping Computer","date":"2026-02-20T11:50:14.000Z","url":"https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/","summary":"The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack.","tags":["ICS"]},{"title":"University of Mississippi Medical Center closes all clinics in wake of cyberattack","source":"Databreaches.net","date":"2026-02-19T15:29:40.000Z","url":"https://databreaches.net/2026/02/19/university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack/?pk_campaign=feed&pk_kwd=university-of-mississippi-medical-center-closes-all-clinics-in-wake-of-cyberattack","summary":"Dysruption Hub reports what sounds like a very serious cyberattack affecting the University of Mississippi Medical Center (UMMC): University of Mississippi Medi","tags":["ICS"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ICS"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ICS"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["ICS"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["ICS"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["ICS"]}]},{"id":"energy","label":"Energy & Utilities","description":"Keywords: energy, grid, renewables, utilities, oil, gas, power, OT","articles":[{"title":"In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business","source":"Security Boulevard","date":"2026-02-22T05:47:47.000Z","url":"https://securityboulevard.com/2026/02/in-2026-businesses-should-be-breach-ready-and-never-shut-down-their-core-business/","summary":"“We do not know how long this situation may last. As a precaution, all of our IT systems have been taken down, and a risk assessment will be conducted before we bring things back up.” Vice Chancellor LouAnn Woodward of the University of Mississippi Medical Center uttered these words standing before cameras on Thursday, February The post In 2026, Businesses Should Be Breach Ready and Never Shut Down Their Core Business appeared first on ColorTokens.","tags":["OT"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["OT"]},{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["OT"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["OT"]},{"title":"NDSS 2025 –  Black-Box Membership Inference Attacks Against Fine-Tuned Diffusion Models","source":"Security Boulevard","date":"2026-02-14T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-black-box-membership-inference-attacks-against-fine-tuned-diffusion-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Yan Pang (University of Virginia), Tianhao Wang (University of Virginia) PAPER Black-box Membership Inference Attacks against Fine-tuned Diffusion Models With the rapid advancement of diffusion-based image-generative models, the quality of generated images has become increasingly photorealistic. Moreover, with the release of high-quality pre-trained image-generative models, a growing number of users are downloading these pre-trained models to fine-tune them with downstream datasets for various image-generation tasks. However, employing such powerful pre-trained models in downstream tasks presents significant privacy leakage risks. In this paper, we propose the first scores-based membership inference attack framework tailored for recent diffusion models, and in the more stringent black-box access setting. Considering four distinct attack scenarios and three types of attacks, this framework is capable of targeting any pop","tags":["POWER","OT"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["OT"]},{"title":"NDSS 2025 – Revisiting Concept Drift In Windows Malware Detection","source":"Security Boulevard","date":"2026-02-12T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-revisiting-concept-drift-in-windows-malware-detection/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Adrian Shuai Li (Purdue University), Arun Iyengar (Intelligent Data Management and Analytics, LLC), Ashish Kundu (Cisco Research), Elisa Bertino (Purdue University) PAPER Revisiting Concept Drift in Windows Malware Detection: Adaptation to Real Drifted Malware with Minimal Samples In applying deep learning for malware classification, it is crucial to account for the prevalence of malware evolution, which can cause trained classifiers to fail on drifted malware. Existing solutions to address concept drift use active learning. They select new samples for analysts to label and then retrain the classifier with the new labels. Our key finding is that the current retraining techniques do not achieve optimal results. These techniques overlook that updating the model with scarce drifted samples requires learning features that remain consistent across pre-drift and post-drift data. The model should thus be able to disregard specific features","tags":["OT"]},{"title":"Man pleads guilty to hacking nearly 600 women’s Snapchat accounts","source":"Bleeping Computer","date":"2026-02-06T12:34:30.000Z","url":"https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-nearly-600-womens-snapchat-accounts/","summary":"An Illinois man pleaded guilty to hacking nearly 600 women's Snapchat accounts to steal nude photos that he kept, sold, or traded online, including accounts he compromised at the request of a former university track coach who was later convicted of sextortion.","tags":["OT"]},{"title":"Two Ivy League universities had donor information breaches. Will donors be notified?","source":"Databreaches.net","date":"2026-02-05T02:47:16.000Z","url":"https://databreaches.net/2026/02/04/two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified/?pk_campaign=feed&pk_kwd=two-ivy-league-universities-had-donor-information-breaches-will-donors-be-notified","summary":"Harvard University and the University of Pennsylvania (UPenn) have more in common than just being Ivy League universities. Both suffered data breaches involving","tags":["OT"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["OT"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["OT"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["OT"]},{"title":"NDSS 2025 – Provably Unlearnable Data Examples","source":"Security Boulevard","date":"2026-01-30T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-provably-unlearnable-data-examples/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: Derui Wang (CSIRO's Data61), Minhui Xue (CSIRO's Data61), Bo Li (The University of Chicago), Seyit Camtepe (CSIRO's Data61), Liming Zhu (CSIRO's Data61) PAPER Provably Unlearnable Data Examples The exploitation of publicly accessible data has led to escalating concerns regarding data privacy and intellectual property (IP) breaches in the age of artificial intelligence. To safeguard both data privacy and IP-related domain knowledge, efforts have been undertaken to render shared data unlearnable for unauthorized models in the wild. Existing methods apply empirically optimized perturbations to the data in the hope of disrupting the correlation between the inputs and the corresponding labels such that the data samples are converted into Unlearnable Examples (UEs). Nevertheless, the absence of mechanisms to verify the robustness of UEs against uncertainty in unauthorized models and their training procedures engenders several","tags":["OT"]},{"title":"NDSS 2025 – TrajDeleter: Enabling Trajectory Forgetting In Offline Reinforcement Learning Agents","source":"Security Boulevard","date":"2026-01-29T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-trajdeleter-enabling-trajectory-forgetting-in-offline-reinforcement-learning-agents/","summary":"Session 10D: Machine Unlearning   Authors, Creators & Presenters: hen Gong (University of Vriginia), Kecen Li (Chinese Academy of Sciences), Jin Yao (University of Virginia), Tianhao Wang (University of Virginia) PAPER TrajDeleter: Enabling Trajectory Forgetting in Offline Reinforcement Learning Agents Reinforcement learning (RL) trains an agent from experiences interacting with the environment. In scenarios where online interactions are impractical, offline RL, which trains the agent using pre-collected datasets, has become popular. While this new paradigm presents remarkable effectiveness across various real-world domains, like healthcare and energy management, there is a growing demand to enable agents to rapidly and completely eliminate the influence of specific trajectories from both the training dataset and the trained agents. To meet this problem, this paper advocates TRAJDELETER, the first practical approach to trajectory unlearning for offline RL agents. The key idea of TRAJDE","tags":["ENERGY","OT"]},{"title":"What happens if agentic AI falls into the wrong hands? [Q&A]","source":"Beta News","date":"2026-01-29T13:59:10.000Z","url":"https://betanews.com/article/what-happens-if-agentic-ai-falls-into-the-wrong-hands-qa/","summary":"Agentic AI systems are increasingly taking on real-world roles -- by 2028 Gartner predicts that 15 percent of day-to-day work decisions will be made by agentic AI. But do we fully understand the potential harm that could be caused if these systems were weaponized by bad actors? We spoke to Keeley Crockett, senior IEEE member and professor in computational intelligence at the Manchester Metropolitan University to find out. BN: What is agentic AI and what differentiates it from a standard AI assistant? KC: Agentic AI refers to artificial intelligence systems with a high degree of autonomy that can act independently… [Continue Reading]","tags":["OT"]},{"title":"NDSS 2025 – Recurrent Private Set Intersection For Unbalanced Databases With Cuckoo Hashing","source":"Security Boulevard","date":"2026-01-28T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-recurrent-private-set-intersection-for-unbalanced-databases-with-cuckoo-hashing/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Eduardo Chielle (New York University Abu Dhabi), Michail Maniatakos (New York University Abu Dhabi) PAPER Recurrent Private Set Intersection for Unbalanced Databases with Cuckoo Hashing and Leveled FHE A Private Set Intersection (PSI) protocol is a cryptographic method allowing two parties, each with a private set, to determine the intersection of their sets without revealing any information about their entries except for the intersection itself. While extensive research has focused on PSI protocols, most studies have centered on scenarios where two parties possess sets of similar sizes, assuming a semi-honest threat model. However, when the sizes of the parties' sets differ significantly, a generalized solution tends to underperform compared to a specialized one, as recent research has demonstrated. Additionally, conventional PSI protocols are typically designed for a single execution, requiring the entire protocol to","tags":["OT"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["OT"]},{"title":"NDSS 2025 – On the Robustness Of LDP Protocols For Numerical Attributes Under Data Poisoning Attacks","source":"Security Boulevard","date":"2026-01-27T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-on-the-robustness-of-ldp-protocols-for-numerical-attributes-under-data-poisoning-attacks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Xiaoguang Li (Xidian University, Purdue University), Zitao Li (Alibaba Group (U.S.) Inc.), Ninghui Li (Purdue University), Wenhai Sun (Purdue University, West Lafayette, USA) PAPER On the Robustness of LDP Protocols for Numerical Attributes under Data Poisoning Attacks Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate p","tags":["OT"]},{"title":"NDSS 2025 – Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach","source":"Security Boulevard","date":"2026-01-27T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-detecting-ransomware-despite-i-o-overhead-a-practical-multi-staged-approach/","summary":"Session 10B: Ransomware   Authors, Creators & Presenters: Christian van Sloun (RWTH Aachen University), Vincent Woeste (RWTH Aachen University), Konrad Wolsing (RWTH Aachen University & Fraunhofer FKIE), Jan Pennekamp (RWTH Aachen University), Klaus Wehrle (RWTH Aachen University) PAPER Detecting Ransomware Despite I/O Overhead: A Practical Multi-Staged Approach Ransomware attacks have become one of the most widely feared cyber attacks for businesses and home users. Since attacks are evolving and use advanced phishing campaigns and zero-day exploits, everyone is at risk, ranging from novice users to experts. As a result, much research has focused on preventing and detecting ransomware attacks, with real-time monitoring of I/O activity being the most prominent approach for detection. These approaches have in common that they inject code into the execution of the operating system's I/O stack, a more and more optimized system. However, they seemingly do not consider the impact the integra","tags":["OT"]}]},{"id":"finance","label":"Banking & Finance","description":"Keywords: finance, banking, fintech, investment, cryptocurrency, SEC, wire fraud","articles":[{"title":"NDSS 2025 – Generating API Specifications For Bug Detection Via Specification Propagation Analysis","source":"Security Boulevard","date":"2026-02-23T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-specifications-for-bug-detection-via-specification-propagation-analysis/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Uncovering The Iceberg From The Tip: Generating API Specifications For Bug Detection Via Specification Propagation Analysis Modern software often provides diverse APIs to facilitate development. Certain APIs, when used, can affect variables and requi","tags":["SEC"]},{"title":"NDSS 2025 – Generating API Parameter Security Rules With LLM For API Misuse Detection","source":"Security Boulevard","date":"2026-02-23T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-generating-api-parameter-security-rules-with-llm-for-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER Generating API Parameter Security Rules with LLM for API Misuse Detection When utilizing library APIs, developers should follow the API security rules to mitigate the risk of API misuse. API Parameter Security Rule (APSR) is a common type of security","tags":["SEC"]},{"title":"Mississippi Hospital System Closes All Clinics After Ransomware Attack","source":"Security Week","date":"2026-02-23T10:29:13.000Z","url":"https://www.securityweek.com/mississippi-hospital-system-closes-all-clinics-after-ransomware-attack/","summary":"A ransomware attack forced the University of Mississippi Medical Center to close all of its roughly three dozen clinics around the state and cancel elective procedures.\nThe post Mississippi Hospital System Closes All Clinics After Ransomware Attack appeared first on SecurityWeek.","tags":["SEC"]},{"title":"NDSS 2025 – The Midas Touch: Triggering The Capability Of LLMs For RM-API Misuse Detection","source":"Security Boulevard","date":"2026-02-22T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-the-midas-touch-triggering-the-capability-of-llms-for-rm-api-misuse-detection/","summary":"Session 13B: API Security  Authors, Creators & Presenters: Yi Yang (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Jinghua Liu (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Kai Chen (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China), Miaoqian Lin (Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China; School of Cyber Security, University of Chinese Academy of Sciences, China) PAPER The Midas Touch: Triggering the Capability of LLMs for RM-API Misuse Detection As the basis of software resource management (RM), strictly following the RM-API constraints guarantees secure resource management and software. To enhance the RM-API appl","tags":["SEC"]},{"title":"NDSS 2025 – NodeMedic-FINE: Automatic Detection And Exploit Synthesis For Node.js Vulnerabilities","source":"Security Boulevard","date":"2026-02-20T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-nodemedic-fine-automatic-detection-and-exploit-synthesis-for-node-js-vulnerabilities/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Darion Cassel (Carnegie Mellon University), Nuno Sabino (IST & CMU), Min-Chien Hsu (Carnegie Mellon University), Ruben Martins (Carnegie Mellon University), Limin Jia (Carnegie Mellon University) PAPER NodeMedic-FINE: Automatic Detection and Exploit Synthesis for Node.js Vulnerabilities The Node.js ecosystem comprises millions of packages written in JavaScript. Many packages suffer from vulnerabilities such as arbitrary code execution (ACE) and arbitrary command injection (ACI). Prior work has developed automated tools based on dynamic taint tracking to detect potential vulnerabilities, and to synthesize proof-of-concept exploits that confirm them, with limited success. One challenge these tools face is that expected inputs to package APIs often have varied types and object structure. Failure to call these APIs with inputs of the correct type and with specific fields leads to unsuccessful exploit generation and missed vu","tags":["SEC"]},{"title":"NDSS 2025 – CLIBE: Detecting Dynamic Backdoors In Transformer-based NLP Models","source":"Security Boulevard","date":"2026-02-18T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-clibe-detecting-dynamic-backdoors-in-transformer-based-nlp-models/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Rui Zeng (Zhejiang University), Xi Chen (Zhejiang University), Yuwen Pu (Zhejiang University), Xuhong Zhang (Zhejiang University), Tianyu Du (Zhejiang University), Shouling Ji (Zhejiang University) PAPER CLIBE: Detecting Dynamic Backdoors in Transformer-based NLP Models Backdoors can be injected into NLP models to induce misbehavior when the input text contains a specific feature, known as a trigger, which the attacker secretly selects. Unlike fixed tokens, words, phrases, or sentences used in the static text trigger, dynamic backdoor attacks on NLP models design triggers associated with abstract and latent text features (e.g., style), making them considerably stealthier than traditional static backdoor attacks. However, existing research on NLP backdoor detection primarily focuses on defending against static backdoor attacks, while research on detecting dynamic backdoors in NLP models remains largely unexplored. This paper pre","tags":["SEC"]},{"title":"NDSS 2025 – SiGuard: Guarding Secure Inference With Post Data Privacy","source":"Security Boulevard","date":"2026-02-16T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-siguard-guarding-secure-inference-with-post-data-privacy/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Xinqian Wang (RMIT University), Xiaoning Liu (RMIT University), Shangqi Lai (CSIRO Data61), Xun Yi (RMIT University), Xingliang Yuan (University of Melbourne) PAPER SIGuard: Guarding Secure Inference with Post Data Privacy Secure inference is designed to enable encrypted machine learning model prediction over encrypted data. It will ease privacy concerns when models are deployed in Machine Learning as a Service (MLaaS). For efficiency, most of recent secure inference protocols are constructed using secure multi-party computation (MPC) techniques. They can ensure that MLaaS computes inference without knowing the inputs of users and model owners. However, MPC-based protocols do not hide information revealed from their output. In the context of secure inference, prediction outputs (i.e., inference results of encrypted user inputs) are revealed to the users. As a result, adversaries can compromise output privacy of secure i","tags":["SEC"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["SEC"]},{"title":"Upcoming Speaking Engagements","source":"Schneier on Security","date":"2026-02-14T17:04:59.000Z","url":"https://www.schneier.com/blog/archives/2026/02/upcoming-speaking-engagements-53.html","summary":"This is a current list of where and when I am scheduled to speak: I’m speaking at Ontario Tech University in Oshawa, Ontario, Canada, at 2 PM ET on Thursday, February 26, 2026. I’m speaking at the Personal AI Summit in Los Angeles, California, USA, on Thursday, March 5, 2026. I’m speaking at Tech Live: Cybersecurity in New York City, USA, on Wednesday, March 11, 2026. I’m giving the Ross Anderson Lecture at the University of Cambridge’s Churchill College at 5:30 PM GMT on Thursday, March 19, 2026. I’m speaking at RSAC 2026 in San Francisco, California, USA, on Wednesday, March 25, 2026...","tags":["SEC"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["SEC"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["SEC"]},{"title":"NDSS 2025 – VeriBin: Adaptive Verification Of Patches At The Binary Level","source":"Security Boulevard","date":"2026-02-02T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-veribin-adaptive-verification-of-patches-at-the-binary-level/","summary":"Session 11B: Binary Analysis  Authors, Creators & Presenters: Hongwei Wu (Purdue University), Jianliang Wu (Simon Fraser University), Ruoyu Wu (Purdue University), Ayushi Sharma (Purdue University), Aravind Machiry (Purdue University), Antonio Bianchi (Purdue University) PAPER VeriBin: Adaptive Verification of Patches at the Binary Level Vendors are often provided with updated versions of a piece of software, fixing known security issues. However, the inability to have any guarantee that the provided patched software does not break the functionality of its original version often hinders patch deployment. This issue is particularly severe when the patched software is only provided in its compiled binary form. In this case, manual analysis of the patch's source code is impossible, and existing automated patch analysis techniques, which rely on source code, are not applicable. Even when the source code is accessible, the necessity of binary-level patch verification is still crucial, as hi","tags":["SEC"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["SEC"]},{"title":"NDSS 2025 – Alba: The Dawn Of Scalable Bridges For Blockchains","source":"Security Boulevard","date":"2026-02-01T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-alba-the-dawn-of-scalable-bridges-for-blockchains/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Giulia Scaffino (TU Wien), Lukas Aumayr (TU Wien), Mahsa Bastankhah (Princeton University), Zeta Avarikioti (TU Wien), Matteo Maffei (TU Wien) PAPER Alba: The Dawn of Scalable Bridges for Blockchains Over the past decade, cryptocurrencies have garnered attention from academia and industry alike, fostering a diverse blockchain ecosystem and novel applications. The inception of bridges improved interoperability, enabling asset transfers across different blockchains to capitalize on their unique features. Despite their surge in popularity and the emergence of Decentralized Finance (DeFi), trustless bridge protocols remain inefficient, either relaying too much information (e.g., light-client-based bridges) or demanding expensive computation (e.g., zk-based bridges). These inefficiencies arise because existing bridges securely prove a transaction's on-chain inclusion on another blockchain. Yet this is unnecessary as off-ch","tags":["FINANCE","SEC"]},{"title":"NDSS 2025 – PropertyGPT","source":"Security Boulevard","date":"2026-01-31T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-propertygpt/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Ye Liu (Singapore Management University), Yue Xue (MetaTrust Labs), Daoyuan Wu (The Hong Kong University of Science and Technology), Yuqiang Sun (Nanyang Technological University), Yi Li (Nanyang Technological University), Miaolei Shi (MetaTrust Labs), Yang Liu (Nanyang Technological University) PAPER PropertyGPT: LLM-driven Formal Verification of Smart Contracts through Retrieval-Augmented Property Generation Formal verification is a technique that can prove the correctness of a system with respect to a certain specification or property. It is especially valuable for security-sensitive smart contracts that manage billions in cryptocurrency assets. Although existing research has developed various static verification tools (or provers) for smart contracts, a key missing component is the automated generation of comprehensive properties, including invariants, pre-/post-conditions, and rules. Hence, industry-leading playe","tags":["CRYPTOCURRENCY","SEC"]},{"title":"NDSS 2025 – Silence False Alarms","source":"Security Boulevard","date":"2026-01-30T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-silence-false-alarms/","summary":"Session 11A: Blockchain Security 2  Authors, Creators & Presenters: Qiyang Song (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Heqing Huang (Institute of Information Engineering, Chinese Academy of Sciences), Xiaoqi Jia (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Yuanbo Xie (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Jiahao Cao (Institute for Network Sciences and Cyberspace, Tsinghua University) PAPER Silence False Alarms: Identifying Anti-Reentrancy Patterns on Ethereum to Refine Smart Contract Reentrancy Detection Reentrancy vulnerabilities in Ethereum smart contracts have caused significant financial losses, prompting the creation of several automated reentrancy detectors. However, these detectors frequently","tags":["SEC"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["SEC"]},{"title":"NDSS 2025 – Recurrent Private Set Intersection For Unbalanced Databases With Cuckoo Hashing","source":"Security Boulevard","date":"2026-01-28T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-recurrent-private-set-intersection-for-unbalanced-databases-with-cuckoo-hashing/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Eduardo Chielle (New York University Abu Dhabi), Michail Maniatakos (New York University Abu Dhabi) PAPER Recurrent Private Set Intersection for Unbalanced Databases with Cuckoo Hashing and Leveled FHE A Private Set Intersection (PSI) protocol is a cryptographic method allowing two parties, each with a private set, to determine the intersection of their sets without revealing any information about their entries except for the intersection itself. While extensive research has focused on PSI protocols, most studies have centered on scenarios where two parties possess sets of similar sizes, assuming a semi-honest threat model. However, when the sizes of the parties' sets differ significantly, a generalized solution tends to underperform compared to a specialized one, as recent research has demonstrated. Additionally, conventional PSI protocols are typically designed for a single execution, requiring the entire protocol to","tags":["SEC"]},{"title":"Inside Arizona's Push to Modernize and Secure Campus IT","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/inside-arizonas-push-to-modernize-secure-campus-it-a-30619","summary":"The University of Arizona is advancing a campus-wide modernization and security agenda by centralizing a previously fragmented IT environment and unifying core","tags":["SEC"]}]},{"id":"telecom","label":"Telecommunications","description":"Keywords: telecom, network, ISP, broadband, 5G, carrier","articles":[{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["NETWORK"]},{"title":"NDSS 2025 – A Method To Facilitate Membership Inference Attacks In Deep Learning Models","source":"Security Boulevard","date":"2026-02-16T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-a-method-to-facilitate-membership-inference-attacks-in-deep-learning-models/","summary":"Session 12C: Membership Inference  Authors, Creators & Presenters: Zitao Chen (University of British Columbia), Karthik Pattabiraman (University of British Columbia) PAPER A Method to Facilitate Membership Inference Attacks in Deep Learning Models Modern machine learning (ML) ecosystems offer a surging number of ML frameworks and code repositories that can greatly facilitate the development of ML models. Today, even ordinary data holders who are not ML experts can apply off-the-shelf codebase to build high-performance ML models on their data, many of which are sensitive in nature (e.g., clinical records). ABOUT NDSS The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enabl","tags":["NETWORK"]},{"title":"Cyberattack Forces Network Shutdown at Rome’s La Sapienza University","source":"Secure Reading","date":"2026-02-06T06:23:45.000Z","url":"https://securereading.com/la-sapienza-university-cyberattack/","summary":"La Sapienza University cyberattack","tags":["NETWORK"]},{"title":"NDSS 2025 – Preventing Channel Depletion Via Universal and Enhanced Multi-Hop Payments","source":"Security Boulevard","date":"2026-02-02T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-preventing-channel-depletion-via-universal-and-enhanced-multi-hop-payments/","summary":"Session 11A: Blockchain Security 2   Authors, Creators & Presenters: Anqi Tian (Institute of Software, Chinese Academy of Sciences; School of Computer Science and Technology, University of Chinese Academy of Sciences), Peifang Ni (Institute of Software, Chinese Academy of Sciences; Zhongguancun Laboratory, Beijing, P.R.China), Yingzi Gao (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences), Jing Xu (Institute of Software, Chinese Academy of Sciences; University of Chinese Academy of Sciences；Zhongguancun Laboratory, Beijing, P.R.China) PAPER Horcrux: Synthesize, Split, Shift and Stay Alive; Preventing Channel Depletion via Universal and Enhanced Multi-hop Payments Payment Channel Networks (PCNs) have been highlighted as viable solutions to address the scalability issues in current permissionless blockchains. They facilitate off-chain transactions, significantly reducing the load on the blockchain. However, the extensive reuse of multi-hop rout","tags":["NETWORK"]},{"title":"NDSS 2025 – Silence False Alarms","source":"Security Boulevard","date":"2026-01-30T20:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-silence-false-alarms/","summary":"Session 11A: Blockchain Security 2  Authors, Creators & Presenters: Qiyang Song (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Heqing Huang (Institute of Information Engineering, Chinese Academy of Sciences), Xiaoqi Jia (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Yuanbo Xie (Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences), Jiahao Cao (Institute for Network Sciences and Cyberspace, Tsinghua University) PAPER Silence False Alarms: Identifying Anti-Reentrancy Patterns on Ethereum to Refine Smart Contract Reentrancy Detection Reentrancy vulnerabilities in Ethereum smart contracts have caused significant financial losses, prompting the creation of several automated reentrancy detectors. However, these detectors frequently","tags":["NETWORK"]},{"title":"Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed","source":"Cyber Security News","date":"2026-01-30T08:45:50.000Z","url":"https://cybersecuritynews.com/education-themed-malicious-domains-linked/","summary":"Security researchers have uncovered a sophisticated traffic distribution network leveraging deceptive education-themed domains to deliver malware and phishing attacks. The operation, tracked under infrastructure indicators pointing to TOXICSNAKE, uses legitimate-looking university and educational institution branding to deceive users into visiting malicious websites. This tactic exploits the trust users place in educational platforms, making it an […]\nThe post Education-Themed Malicious Domains Linked to Bulletproof Hosting Infrastructure Exposed appeared first on Cyber Security News.","tags":["NETWORK"]},{"title":"NDSS 2025 –  Iris: Dynamic Privacy Preserving Search In Authenticated Chord Peer-To-Peer Networks","source":"Security Boulevard","date":"2026-01-28T16:00:00.000Z","url":"https://securityboulevard.com/2026/01/ndss-2025-iris-dynamic-privacy-preserving-search-in-authenticated-chord-peer-to-peer-networks/","summary":"Session 10C: Privacy Preservation   Authors, Creators & Presenters: Angeliki Aktypi (University of Oxford), Kasper Rasmussen (University of Oxford) PAPER Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer-to-Peer Networks In structured peer-to-peer networks, like Chord, users find data by asking a number of intermediate nodes in the network. Each node provides the identity of the closet known node to the address of the data, until eventually the node responsible for the data is reached. This structure means that the intermediate nodes learn the address of the sought after data. Revealing this information to other nodes makes Chord unsuitable for applications that require query privacy so in this paper we present a scheme Iris to provide query privacy while maintaining compatibility with the existing Chord protocol. This means that anyone using it will be able to execute a privacy preserving query but it does not require other nodes in the network to use it (or even kno","tags":["NETWORK"]}]}]}