{"updated":"2026-02-25T01:05:20.731Z","industries":[{"id":"government","label":"Government","description":"Keywords: government, county, federal, defense, court","articles":[{"title":"Building an AI-powered defense-in-depth security architecture for serverless microservices","source":"AWS Security Blog","date":"2026-02-16T20:10:44.000Z","url":"https://aws.amazon.com/blogs/security/building-an-ai-powered-defense-in-depth-security-architecture-for-serverless-microservices/","summary":"Enterprise customers face an unprecedented security landscape where sophisticated cyber threats use artificial intelligence to identify vulnerabilities, automate attacks, and evade detection at machine speed. Traditional perimeter-based security models are insufficient when adversaries can analyze millions of attack vectors in seconds and exploit zero-day vulnerabilities before patches are available. The distributed nature of serverless architectures […]","tags":["DEFENSE"]},{"title":"Pompelmi: Open-source secure file upload scanning for Node.js","source":"Help Net Security","date":"2026-02-02T06:00:01.000Z","url":"https://www.helpnetsecurity.com/2026/02/02/pompelmi-open-source-secure-file-upload-scanning-node-js/","summary":"Software teams building services in JavaScript are adding more layers of defense to handle untrusted file uploads. An open-source project called Pompelmi","tags":["DEFENSE"]}]},{"id":"healthcare","label":"Healthcare","description":"Keywords: healthcare, hospital, clinic, medical, biotech, pharmacy, pharma, hipaa","articles":[{"title":"Healthcare Cyber Resilience: Building a Trusted Data Foundation for Secure, AI-Ready Operations","source":"Inforisk","date":"2026-02-17T00:14:49.010Z","url":"https://www.inforisktoday.com/webinars/healthcare-cyber-resilience-building-trusted-data-foundation-for-w-6851","summary":". information risk management","tags":["HEALTHCARE"]},{"title":"Demand for outpatient medical buildings growing: reports","source":"HealthcareDive","date":"2026-02-12T17:06:40.000Z","url":"https://www.healthcaredive.com/news/demand-for-outpatient-medical-buildings-growing-reports/812336/","summary":"The average fit-out cost to turn space into a medical office building is $412 per square foot, not counting structural upgrades, according to an analysis.","tags":["MEDICAL"]},{"title":"Building Visibility to Enable Secure Healthcare AI Adoption","source":"Zscaler","date":"2026-01-27T22:53:44.000Z","url":"https://www.zscaler.com/blogs/product-insights/building-visibility-enable-secure-healthcare-ai-adoption","summary":"Secure generative AI adoption in healthcare. Protect PHI, tackle shadow AI risks, and enable innovation with WebSocket inspection and Zero Trust governance.","tags":["HEALTHCARE"]}]},{"id":"construction","label":"Construction","description":"Keywords: construction, construct, HVAC, building","articles":[{"title":"Schneider Electric EcoStruxure Building Operation Workstation","source":"CISA (Alerts)","date":"2026-02-24T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-02","summary":"View CSAF\nSummary\nSchneider Electric is aware of a vulnerability in EcoStruxure Building Operation Workstation and EcoStruxure Building Operation WebStation. [EcoStruxure Building Operation (EBO)](https://www.se.com/ww/en/product-range/62111-ecostruxure-building-operation-software/#overview) is an open and scalable software platform providing insight, control and management of multiple building systems and devices in one mobile-enabled convenient view. It delivers valuable data for decision-making to improve energy management and increase efficiency for better building performance and comfort, reduced carbon, and more sustainable building environments. Failure to apply the remediations below may risk exposure of local files or denial of service, which could result in data breaches, and operational disruptions.\nThe following versions of Schneider Electric EcoStruxure Building Operation Workstation are affected:\nEcoStruxure Building Operation Workstation vers:generic/>=7.0.x|<7.0.3.2000_","tags":["BUILDING"]},{"title":"Building Secure SaaS Architecture: Why Identity Must Be Designed from Day One","source":"Security Boulevard","date":"2026-02-24T09:35:57.000Z","url":"https://securityboulevard.com/2026/02/building-secure-saas-architecture-why-identity-must-be-designed-from-day-one/","summary":"Learn why identity must be built into SaaS architecture from day one to ensure secure authentication, compliance, and scalable growth.","tags":["BUILDING"]},{"title":"Building a Detection Foundation: Part 1 - The Single-Source Problem","source":"TrustedSec","date":"2026-02-24T05:00:00.000Z","url":"https://trustedsec.com/blog/building-a-detection-foundation-part-1-the-single-source-problem","summary":"<p>The Uncomfortable Truth About Your Telemetry Let me start with an observation that might hit close to home. In my years working Incident Response cases and running Tabletop Exercises, I&#039;ve noticed a pattern that…</p>","tags":["BUILDING"]},{"title":"Top Technology Stacks for MVP Development in 2026","source":"HackRead","date":"2026-02-23T13:53:40.000Z","url":"https://hackread.com/top-technology-stacks-mvp-development-2026/","summary":"Top technology stacks for MVP development in 2026, best tools for fast launch, scalability, cost efficiency, and proven frameworks for startups building products.","tags":["BUILDING"]},{"title":"Modern Workplaces Demand a New Meaning for “Site” in Network Security","source":"Security Boulevard","date":"2026-02-23T12:44:53.000Z","url":"https://securityboulevard.com/2026/02/modern-workplaces-demand-a-new-meaning-for-site-in-network-security/","summary":"The Problem with the Traditional Idea of a Site For a long time, the concept of a “site” in networking and security was synonymous with a physical office. This included: a headquarters building a branch office a campus connected to the corporate network This traditional model was built on several assumptions: employees primarily worked from... The post Modern Workplaces Demand a New Meaning for “Site” in Network Security appeared first on Aryaka.","tags":["BUILDING"]},{"title":"Building Resilient Operations With Predictive Issue Resolution","source":"Comodo","date":"2026-02-23T11:32:04.000Z","url":"https://blog.comodo.com/it-security/predictive-issue-resolution/","summary":"Discover how predictive issue resolution prevents downtime, strengthens cybersecurity, and improves operational efficiency across modern organizations.","tags":["BUILDING"]},{"title":"Building an Agentic Cloud Security Ecosystem: A Reference Architecture with Wiz MCP and Infosys Cyber Next","source":"Wiz","date":"2026-02-20T17:28:34.000Z","url":"https://www.wiz.io/blog/infosys-mcp","summary":"Discover how Wiz MCP bridges AI and cloud security data to enable multi-agent risk analysis with human-governed remediation.","tags":["BUILDING"]},{"title":"Building Stronger Control and Visibility With IT Asset Management","source":"Comodo","date":"2026-02-20T16:28:26.000Z","url":"https://blog.comodo.com/it-management/it-asset-management/","summary":"Discover how IT asset management improves visibility, security, compliance, and cost control across modern digital environments.","tags":["BUILDING"]},{"title":"Using threat modeling and prompt injection to audit Comet","source":"Security Boulevard","date":"2026-02-20T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/using-threat-modeling-and-prompt-injection-to-audit-comet/","summary":"Before launching their Comet browser, Perplexity hired us to test the security of their AI-powered browsing features. Using adversarial testing guided by our TRAIL threat model, we demonstrated how four prompt injection techniques could extract users’ private information from Gmail by exploiting the browser’s AI assistant. The vulnerabilities we found reflect how AI agents behave when external content isn’t treated as untrusted input. We’ve distilled our findings into five recommendations that any team building AI-powered products should consider before deployment. If you want to learn more about how Perplexity addressed these findings, please see their corresponding blog post and research paper on addressing prompt injection within AI browser agents. Background Comet is a web browser that provides LLM-powered agentic browsing capabilities. The Perplexity assistant is available on a sidebar, which the user can interact with on any web page. The assistant has access to information like","tags":["BUILDING"]},{"title":"Building Application Security from the Ground Up: An Organizational Approach","source":"Orca Security","date":"2026-02-19T13:50:00.000Z","url":"https://orca.security/resources/blog/building-application-security-from-the-ground-up/","summary":"Learn why technology alone can't fix security. Discover a proven framework for building an application security program to stop vulnerabilities at the source.","tags":["BUILDING"]},{"title":"How to Organize Safely in the Age of Surveillance","source":"Wired","date":"2026-02-19T10:00:00.000Z","url":"https://www.wired.com/story/how-to-organize-safely-in-the-age-of-surveillance/","summary":"From threat modeling to encrypted collaboration apps, we’ve collected experts’ tips and tools for safely and effectively building a group—even while being targeted and tracked by the powerful.","tags":["BUILDING"]},{"title":"Smashing Security podcast #455: Face off: Meta’s Glasses and America’s internet kill switch","source":"Graham Cluley","date":"2026-02-19T00:30:44.000Z","url":"https://grahamcluley.com/smashing-security-podcast-455/","summary":"Could America turn off Europe's internet?\r\n\r\nThat’s one of the questions that Graham and special guest James Ball will be exploring as they discuss tech sovereignty.  Could Gmail, cloud services, and critical infrastructure really become geopolitical leverage? And is anyone actually building a Plan B?\r\n\r\nPlus we explore if Meta is quietly plotting to turn its smart glasses into face-recognising surveillance specs? With reports of internal memos suggesting they plan to launch controversial features while everyone’s distracted by political chaos, we ask: is this innovation really wanted by the public... or something far creepier?\r\n\r\nAll of this, and much more, in episode 455 of the award-winning \"Smashing Security\" podcast with cybersecurity veteran Graham Cluley, joined this week by journalist and author James Ball.","tags":["BUILDING"]},{"title":"From Firewall Management to Adaptive Security: What IDC’s 2026 Report Means for Security Leaders","source":"Security Boulevard","date":"2026-02-18T22:24:03.000Z","url":"https://securityboulevard.com/2026/02/from-firewall-management-to-adaptive-security-what-idcs-2026-report-means-for-security-leaders/","summary":"Last year, IDC called firewall policy management a foundation organizations could no longer ignore. This year, the message is more direct. In its 2026 report, Building on Enforcement: Network Security...","tags":["BUILDING"]},{"title":"Building Resilient Operations With Incident Management Software","source":"Comodo","date":"2026-02-18T18:35:00.000Z","url":"https://blog.comodo.com/it-management/incident-management-software/","summary":"Discover how incident management software improves response times, reduces risk, and strengthens cybersecurity and business resilience.","tags":["BUILDING"]},{"title":"Building an Effective Incident Response Strategy to Combat Cyberattacks","source":"Security Boulevard","date":"2026-02-18T11:22:41.000Z","url":"https://securityboulevard.com/2026/02/building-an-effective-incident-response-strategy-to-combat-cyberattacks/","summary":"Developing a robust Incident Response (IR) strategy is vital for minimizing risks and damage during cyberattacks. Learn how to create an effective IR plan, the six phases of incident response, and the importance of assembling a skilled IR team with the right tools to ensure swift recovery and protection.\"","tags":["BUILDING"]},{"title":"CVE-2024-11218 Podman: buildah: container breakout by using --jobs=2 and a race condition when building a malicious containerfile","source":"Microsoft MSRC","date":"2026-02-18T10:35:03.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-11218","summary":"Information published.","tags":["BUILDING"]},{"title":"CVE-2021-3602 An information disclosure flaw was found in Buildah when building containers using chroot isolation. Running processes in container builds (e.g. Dockerfile RUN commands) can access environment variables from parent and grandparent processes. When run in a container in a CI/CD environment environment variables may include sensitive information that was shared with the container in order to be used only by Buildah itself (e.g. container registry credentials).","source":"Microsoft MSRC","date":"2026-02-18T10:21:51.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-3602","summary":"Information published.","tags":["BUILDING"]},{"title":"Will Your Organization Take the Quantum Leap in 2026? Read This First","source":"Security Boulevard","date":"2026-02-18T10:20:54.000Z","url":"https://securityboulevard.com/2026/02/will-your-organization-take-the-quantum-leap-in-2026-read-this-first/","summary":"Explore how organizations can prepare for the quantum age by developing quantum security intelligence, establishing governance plans, and prioritizing system updates. Learn strategies for building resilience without exorbitant investments as quantum computing technology advances","tags":["BUILDING"]},{"title":"CVE-2024-28835 Gnutls: potential crash during chain building/verification","source":"Microsoft MSRC","date":"2026-02-18T10:11:02.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-28835","summary":"Information published.","tags":["BUILDING"]},{"title":"90% of AI projects fail - here are 3 ways to ensure yours doesn't","source":"ZDNet","date":"2026-02-18T08:00:45.000Z","url":"https://www.zdnet.com/article/how-to-target-your-ai-investments-gartner/","summary":"With AI spending forecast to reach $2.52 trillion in 2026, Gartner recommends focusing on building capacity, creating partnerships and avoiding random exploration.","tags":["BUILDING"]},{"title":"Building a faster YARA engine in pure Go","source":"Sansec","date":"2026-02-18T00:00:00.000Z","url":"https://sansec.io/research/yargo","summary":"We built a pure Go YARA engine that's 6.8x faster for text-based scanning, with no C dependencies. It now processes over 57,000 scans per day in production, ...","tags":["BUILDING"]},{"title":"Building Operational Excellence With an ITIL Aligned Service Desk","source":"Comodo","date":"2026-02-17T16:49:36.000Z","url":"https://blog.comodo.com/it-security/itil-aligned-service-desk/","summary":"Discover how an ITIL aligned service desk improves service quality streamlines workflows and strengthens operational and security outcomes.","tags":["BUILDING"]},{"title":"Zero Trust Execution: Building Verified Confidence at the Zscaler Public Sector Summit","source":"Zscaler","date":"2026-02-17T14:00:14.000Z","url":"https://www.zscaler.com/blogs/product-insights/zero-trust-execution-building-verified-confidence-zscaler-public-sector","summary":"Join Zscaler's Public Sector Summit (March 3, 2026, D.C.) to master Zero Trust execution, build verified confidence, and hear from top cyber policy leaders.","tags":["BUILDING"]},{"title":"Healthcare Cyber Resilience: Building a Trusted Data Foundation for Secure, AI-Ready Operations","source":"Inforisk","date":"2026-02-17T00:14:49.010Z","url":"https://www.inforisktoday.com/webinars/healthcare-cyber-resilience-building-trusted-data-foundation-for-w-6851","summary":". information risk management","tags":["BUILDING"]},{"title":"Building an AI-powered defense-in-depth security architecture for serverless microservices","source":"AWS Security Blog","date":"2026-02-16T20:10:44.000Z","url":"https://aws.amazon.com/blogs/security/building-an-ai-powered-defense-in-depth-security-architecture-for-serverless-microservices/","summary":"Enterprise customers face an unprecedented security landscape where sophisticated cyber threats use artificial intelligence to identify vulnerabilities, automate attacks, and evade detection at machine speed. Traditional perimeter-based security models are insufficient when adversaries can analyze millions of attack vectors in seconds and exploit zero-day vulnerabilities before patches are available. The distributed nature of serverless architectures […]","tags":["BUILDING"]},{"title":"Building Secure Authentication Faster: When SaaS Teams Should Go Passwordless","source":"Security Boulevard","date":"2026-02-16T11:28:32.000Z","url":"https://securityboulevard.com/2026/02/building-secure-authentication-faster-when-saas-teams-should-go-passwordless/","summary":"Learn when SaaS teams should adopt passwordless authentication to boost security, reduce friction, and accelerate secure product development.","tags":["BUILDING"]},{"title":"Week in review: Exploited newly patched BeyondTrust RCE, United Airlines CISO on building resilience","source":"Help Net Security","date":"2026-02-15T09:00:42.000Z","url":"https://www.helpnetsecurity.com/2026/02/15/week-in-review-exploited-newly-patched-beyondtrust-rce-united-airlines-ciso-on-building-resilience/","summary":"Here’s an overview of some of last week’s most interesting news, articles, interviews and videos: United Airlines CISO on building resilience when","tags":["BUILDING"]},{"title":"AI Governance. When AI becomes an Identity.","source":"Security Boulevard","date":"2026-02-13T06:17:51.000Z","url":"https://securityboulevard.com/2026/02/ai-governance-when-ai-becomes-an-identity/","summary":"Building the Control Plane for ERP, Finance, and SaaS AI didn’t come with a rollout plan; it crept in unnoticed. Someone turned on a copilot in a finance or CRM application, an IT team tested an agent on a non‑production system that still contained real audit data, or a regional team started using an AI The post AI Governance. When AI becomes an Identity. appeared first on Safepaas.","tags":["BUILDING"]},{"title":"The Clean Way to Access AWS, Azure, and GCP From Kubernetes (No Secrets, No Rotations)","source":"Hacker Noon","date":"2026-02-13T04:27:32.000Z","url":"https://hackernoon.com/the-clean-way-to-access-aws-azure-and-gcp-from-kubernetes-no-secrets-no-rotations?source=rss","summary":"A multi-cloud strategy, building a distributed system, your Kubernetes pods need secure, passwordless authentication across AWS, Azure, and GCP.","tags":["BUILDING"]},{"title":"Demand for outpatient medical buildings growing: reports","source":"HealthcareDive","date":"2026-02-12T17:06:40.000Z","url":"https://www.healthcaredive.com/news/demand-for-outpatient-medical-buildings-growing-reports/812336/","summary":"The average fit-out cost to turn space into a medical office building is $412 per square foot, not counting structural upgrades, according to an analysis.","tags":["BUILDING"]},{"title":"Webinar | Beyond Compliance: Building True Cyber Resilience","source":"Inforisk","date":"2026-02-10T00:15:44.641Z","url":"https://www.inforisktoday.com/webinars/webinar-beyond-compliance-building-true-cyber-resilience-w-6826","summary":". information risk management","tags":["BUILDING"]},{"title":"Big oil is betting big on Toyota to win the solid-state battery race","source":"Electrek","date":"2026-02-09T23:04:48.000Z","url":"https://electrek.co/2026/02/09/big-oil-is-betting-big-on-toyota-to-win-the-solid-state-battery-race/","summary":"Toyota has been working on a solid-state program with Japanese refining oil giant Idemitsu Kosan since 2023. Now they're building a factory.","tags":["BUILDING"]},{"title":"United Airlines CISO on building resilience when disruption is inevitable","source":"Help Net Security","date":"2026-02-09T06:30:29.000Z","url":"https://www.helpnetsecurity.com/2026/02/09/deneen-defiore-united-airlines-aviation-cybersecurity-strategy/","summary":"United Airlines CISO shares how aviation cybersecurity strategy balances modernization, safety-critical systems, resilience, and risk.","tags":["BUILDING"]},{"title":"8 Top MDR Providers for Mid-Market Companies","source":"HackRead","date":"2026-02-08T17:29:31.000Z","url":"https://hackread.com/8-top-mdr-providers-for-mid-market-companies/","summary":"Top 8 MDR providers for mid-market firms needing expert detection, faster response, and reduced noise without building full in-house SOCs.","tags":["BUILDING"]},{"title":"The GRU illegals","source":"Lab 52","date":"2026-02-08T09:49:56.000Z","url":"https://lab52.io/blog/the-gru-illegals/","summary":"Illegals are intelligence officers operating abroad under false identities and nationalities, without the protection of diplomatic immunity. Posing as ordinary citizens of other countries, these officers maintain fake identities, spending years building normal lives while spying. In front of other spies, these officers have no diplomatic protection: if they are discovered, they go to prison. […]","tags":["BUILDING"]},{"title":"Firefox Managed Session Controller Earns a 36 Proof of Usefulness Score by Building an Open-Source Digital Wellness Tool","source":"Hacker Noon","date":"2026-02-07T13:59:59.000Z","url":"https://hackernoon.com/firefox-managed-session-controller-earns-a-36-proof-of-usefulness-score-by-building-an-open-source-digital-wellness-tool?source=rss","summary":"Firefox Managed Session Controller earned a 36 Proof of Usefulness score for its open-source approach to helping parents manage children’s internet access.","tags":["BUILDING"]},{"title":"I Spent 15 Years Building Geospatial Threat Detection Systems. Here's Everything I Learned.","source":"Hacker Noon","date":"2026-02-06T05:28:34.000Z","url":"https://hackernoon.com/i-spent-15-years-building-geospatial-threat-detection-systems-heres-everything-i-learned?source=rss","summary":"The night I watched an attack unfold in real-time and our system caught it 47 minutes before anyone else noticed.","tags":["BUILDING"]},{"title":"New VW Sportline is the 7-passenger electric GTi the ID.Buzz SHOULD have been","source":"Electrek","date":"2026-02-05T22:50:07.000Z","url":"https://electrek.co/2026/02/05/new-vw-sportline-is-the-7-passenger-electric-gti-the-id-buzz-should-have-been/","summary":"Meet the new e-Transporter Sportline, the retro-tastic people-mover with GTI-inspired styling that VW should have been building all along.","tags":["BUILDING"]},{"title":"Midas wants AI systems to prove that confident-sounding responses are actually right","source":"Beta News","date":"2026-02-05T21:39:03.000Z","url":"https://betanews.com/article/midas-wants-ai-systems-to-prove-that-confident-sounding-responses-are-actually-right/","summary":"Midas is a new company, backed by investors connected to OpenAI, Tesla, and SpaceX, that is building mathematical verification tools that can check whether AI results are actually correct.","tags":["BUILDING"]},{"title":"Apple was once ‘carpet bombing’ Tesla with recruiting calls, per Elon Musk","source":"Electrek","date":"2026-02-05T18:59:54.000Z","url":"https://9to5mac.com/2026/02/05/apple-was-once-carpet-bombing-tesla-with-recruiting-calls-per-elon-musk/","summary":"Apple once had ambitions of building an electric car, and per Elon Musk, the company once “relentlessly” tried to poach Tesla employees.","tags":["BUILDING"]},{"title":"Subaru is now building EVs in-house, starting with a new electric SUV","source":"Electrek","date":"2026-02-05T18:29:56.000Z","url":"https://electrek.co/2026/02/05/subaru-builds-first-in-house-ev-new-electric-suv/","summary":"The new electric SUV is now rolling off the production line at Subaru’s Gunma Yajima Plant, the first time an...","tags":["BUILDING"]},{"title":"Interview: Cloudera chief AI architect on building human-first AI","source":"Techmonitor","date":"2026-02-05T10:27:25.000Z","url":"https://www.techmonitor.ai/movers-and-shakers/interview-cloudera-chief-ai-architect-on-building-human-first-ai","summary":"Manasi Vartak is a successful Silicon Valley entrepreneur who advocates a human led approach to AI development.","tags":["BUILDING"]},{"title":"Automating GOAD and Live Malware Labs","source":"Elastic","date":"2026-02-05T00:00:00.000Z","url":"https://www.elastic.co/security-labs/automating-goad-and-live-malware-labs","summary":"Stop building labs by hand. Automate the deployment of a fully instrumented Purple Team range using Ludus and Elastic Security. Spin up infrastructure, execute attacks, and validate detection rules in a single, repeatable workflow.","tags":["BUILDING"]},{"title":"AI and Regulation Redefine Application Security, New Global Study Finds","source":"IT Security Guru","date":"2026-02-04T18:14:26.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ai-and-regulation-redefine-application-security-new-global-study-finds/?utm_source=rss&utm_medium=rss&utm_campaign=ai-and-regulation-redefine-application-security-new-global-study-finds","summary":"Artificial intelligence has overtaken all other forces shaping application security, according to a major new industry study that shows organisations racing to secure AI-generated code while responding to growing regulatory pressure. The 16th edition of the Building Security In Maturity Model (BSIMM), released by Black Duck, analysed real-world software security practices across 111 organisations worldwide, […]\nThe post AI and Regulation Redefine Application Security, New Global Study Finds appeared first on IT Security Guru.","tags":["BUILDING"]},{"title":"AI is now the #1 challenge in application security","source":"Beta News","date":"2026-02-04T14:00:14.000Z","url":"https://betanews.com/article/ai-is-now-the-1-challenge-in-application-security/","summary":"The 16th edition of the Building Security In Maturity Model (BSIMM) shows that AI is now the defining challenge in application security. Organizations are","tags":["BUILDING"]},{"title":"Building a Zero-Trust Framework for Cloud Banking","source":"Security Boulevard","date":"2026-02-04T08:24:38.000Z","url":"https://securityboulevard.com/2026/02/building-a-zero-trust-framework-for-cloud-banking/","summary":"Zero-trust architecture helps banks secure cloud environments, meet regulations, and scale innovation through identity-first security.","tags":["BUILDING"]},{"title":"Building AI Security Together: New Ways to Partner with Wiz for AI Security in 2026","source":"Wiz","date":"2026-02-02T15:29:34.000Z","url":"https://www.wiz.io/blog/win-ai-partnerships","summary":"Wiz announces a new AI Security category in the Wiz Integration Network. Discover new dev tools like WIN MCP and Winnie AI Agent to scale your integrations.","tags":["BUILDING"]},{"title":"Shift Left Is Dead for Cloud PAM","source":"Security Boulevard","date":"2026-02-02T12:05:36.000Z","url":"https://securityboulevard.com/2026/02/shift-left-is-dead-for-cloud-pam/","summary":"Why I Stopped JIT’ing Users and Started JIT’ing Permissions By Cole HorsmanField CTO, Sonrai Security I first tried to “shift left” cloud identity in early 2020. We were building a greenfield AWS environment with a strong cloud team and leadership support to do things properly. The idea was familiar: push security decisions earlier, give developers","tags":["BUILDING"]},{"title":"Shift Left Is Dead for Cloud PAM","source":"Sonrai Security","date":"2026-02-02T12:05:36.000Z","url":"https://sonraisecurity.com/blog/shift-left-is-dead-for-cloud-pam/","summary":"Why I Stopped JIT’ing Users and Started JIT’ing Permissions By Cole HorsmanField CTO, Sonrai Security I first tried to “shift left” cloud identity in early 2020. We were building a greenfield AWS environment with a strong cloud team and leadership support to do things properly. The idea was familiar: push security decisions earlier, give developers […]","tags":["BUILDING"]},{"title":"Building Stronger Cyber Resilience With Automated Patch Management Software","source":"Comodo","date":"2026-02-02T11:29:28.000Z","url":"https://blog.comodo.com/pc-security/automated-patch-management-software/","summary":"Discover how automated patch management software strengthens security reduces risk and simplifies system updates for modern organizations.","tags":["BUILDING"]},{"title":"Pompelmi: Open-source secure file upload scanning for Node.js","source":"Help Net Security","date":"2026-02-02T06:00:01.000Z","url":"https://www.helpnetsecurity.com/2026/02/02/pompelmi-open-source-secure-file-upload-scanning-node-js/","summary":"Software teams building services in JavaScript are adding more layers of defense to handle untrusted file uploads. An open-source project called Pompelmi","tags":["BUILDING"]},{"title":"Tesla puts 4680 battery cells back in Model Y; Here’s why","source":"Electrek","date":"2026-01-28T22:09:40.000Z","url":"https://electrek.co/2026/01/28/tesla-puts-4680-battery-cells-back-in-model-y/","summary":"Tesla has started building Model Y battery packs with its in-house 4680 cells again, more than two years after pulling...","tags":["BUILDING"]},{"title":"Why Your Dev Team Isn’t Broken, Just Misaligned","source":"Security Boulevard","date":"2026-01-28T14:47:57.000Z","url":"https://securityboulevard.com/2026/01/why-your-dev-team-isnt-broken-just-misaligned/","summary":"You’ve got smart engineers and developers. A fast-moving product team. Plenty of Jira tickets. So why does it still feel like you’re building in the...Read More The post Why Your Dev Team Isn’t Broken, Just Misaligned appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["BUILDING"]},{"title":"Building a Unified Front Against Infostealers with Threat Intelligence","source":"VMRay","date":"2026-01-28T10:30:34.000Z","url":"https://www.vmray.com/building-a-unified-front-against-infostealers-with-threat-intelligence/","summary":"NATO strengthens cyber resilience through advanced analysis, intelligence-led defence, and coordinated response to hybrid cyber threats.","tags":["BUILDING"]},{"title":"Data Privacy Day 2026: Why the “Privacy-First” Enterprise is Winning the Trust Race","source":"Seqrite","date":"2026-01-28T05:16:08.000Z","url":"https://www.seqrite.com/blog/why-the-privacy-first-enterprise-is-winning-the-trust-race/","summary":"Discover why enterprises that embrace privacy as a strategic advantage—beyond compliance—are building stronger trust, enhancing user experience, and leading the market in 2026. Learn how privacy-first approaches fuel growth and customer confidence.","tags":["BUILDING"]},{"title":"Building Visibility to Enable Secure Healthcare AI Adoption","source":"Zscaler","date":"2026-01-27T22:53:44.000Z","url":"https://www.zscaler.com/blogs/product-insights/building-visibility-enable-secure-healthcare-ai-adoption","summary":"Secure generative AI adoption in healthcare. Protect PHI, tackle shadow AI risks, and enable innovation with WebSocket inspection and Zero Trust governance.","tags":["BUILDING"]},{"title":"Top AI Technology & Cybersecurity Podcasts to Follow in 2026","source":"Security Boulevard","date":"2026-01-27T15:24:11.000Z","url":"https://securityboulevard.com/2026/01/top-ai-technology-cybersecurity-podcasts-to-follow-in-2026/","summary":"From AI agents and MCP to cybersecurity threats - discover the podcasts that industry leaders rely on. After scaling a CIAM platform to 1B+ users, I've identified the shows delivering real value in 2026. No hype, just practical insights from practitioners building the future.","tags":["BUILDING"]},{"title":"Russian security systems firm Delta hit by cyberattack, services disrupted","source":"The Record","date":"2026-01-27T13:44:39.000Z","url":"https://therecord.media/russia-delta-security-alarm-company-cyberattack","summary":"Building and car alarm systems managed by Russian company Delta have been disrupted by a cyberattack blamed on a \"hostile foreign state.\"","tags":["BUILDING"]},{"title":"Botnet Spotlight: Pressure rises on botnets — but the fight is far from over","source":"Security Boulevard","date":"2026-01-27T11:57:32.000Z","url":"https://securityboulevard.com/2026/01/botnet-spotlight-pressure-rises-on-botnets-but-the-fight-is-far-from-over/","summary":"Momentum is building in the fight against botnets, as network operators and law enforcement ramp up crackdowns on botnet infrastructure, malware, and bulletproof hosting providers. While major takedowns show progress, cybercriminals are still adapting — learn more in this latest edition of the Botnet Spotlight.","tags":["BUILDING"]},{"title":"CVE-2026-24123","source":"Tenable CVE Watch","date":"2026-01-26T23:16:08.000Z","url":"https://www.tenable.com/cve/CVE-2026-24123","summary":"BentoML is a Python library for building online serving systems optimized for AI apps and model inference. Prior to version 1.4.34, BentoML's `bentofile.yaml` configuration allows path traversal attacks through multiple file path fields (`description`, `docker.setup_script`, `docker.dockerfile_template`, `conda.environment_yml`). An attacker can craft a malicious bentofile that, when built by a victim, exfiltrates arbitrary files from the filesystem into the bento archive. This enables supply chain attacks where sensitive files (SSH keys, credentials, environment variables) are silently embedded in bentos and exposed when pushed to registries or deployed. Version 1.4.34 contains a patch for the issue.","tags":["BUILDING"]}]},{"id":"business-services","label":"Business Services","description":"Keywords: business, professional, services, accounting, law firm, LLP, associates, law","articles":[{"title":"Smashing Security podcast #455: Face off: Meta’s Glasses and America’s internet kill switch","source":"Graham Cluley","date":"2026-02-19T00:30:44.000Z","url":"https://grahamcluley.com/smashing-security-podcast-455/","summary":"Could America turn off Europe's internet?\r\n\r\nThat’s one of the questions that Graham and special guest James Ball will be exploring as they discuss tech sovereignty.  Could Gmail, cloud services, and critical infrastructure really become geopolitical leverage? And is anyone actually building a Plan B?\r\n\r\nPlus we explore if Meta is quietly plotting to turn its smart glasses into face-recognising surveillance specs? With reports of internal memos suggesting they plan to launch controversial features while everyone’s distracted by political chaos, we ask: is this innovation really wanted by the public... or something far creepier?\r\n\r\nAll of this, and much more, in episode 455 of the award-winning \"Smashing Security\" podcast with cybersecurity veteran Graham Cluley, joined this week by journalist and author James Ball.","tags":["SERVICES"]},{"title":"Building Resilient Operations With Incident Management Software","source":"Comodo","date":"2026-02-18T18:35:00.000Z","url":"https://blog.comodo.com/it-management/incident-management-software/","summary":"Discover how incident management software improves response times, reduces risk, and strengthens cybersecurity and business resilience.","tags":["BUSINESS"]},{"title":"CVE-2021-3602 An information disclosure flaw was found in Buildah when building containers using chroot isolation. Running processes in container builds (e.g. Dockerfile RUN commands) can access environment variables from parent and grandparent processes. When run in a container in a CI/CD environment environment variables may include sensitive information that was shared with the container in order to be used only by Buildah itself (e.g. container registry credentials).","source":"Microsoft MSRC","date":"2026-02-18T10:21:51.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-3602","summary":"Information published.","tags":["LAW"]},{"title":"Building an AI-powered defense-in-depth security architecture for serverless microservices","source":"AWS Security Blog","date":"2026-02-16T20:10:44.000Z","url":"https://aws.amazon.com/blogs/security/building-an-ai-powered-defense-in-depth-security-architecture-for-serverless-microservices/","summary":"Enterprise customers face an unprecedented security landscape where sophisticated cyber threats use artificial intelligence to identify vulnerabilities, automate attacks, and evade detection at machine speed. Traditional perimeter-based security models are insufficient when adversaries can analyze millions of attack vectors in seconds and exploit zero-day vulnerabilities before patches are available. The distributed nature of serverless architectures […]","tags":["SERVICES"]},{"title":"Pompelmi: Open-source secure file upload scanning for Node.js","source":"Help Net Security","date":"2026-02-02T06:00:01.000Z","url":"https://www.helpnetsecurity.com/2026/02/02/pompelmi-open-source-secure-file-upload-scanning-node-js/","summary":"Software teams building services in JavaScript are adding more layers of defense to handle untrusted file uploads. An open-source project called Pompelmi","tags":["SERVICES"]},{"title":"Russian security systems firm Delta hit by cyberattack, services disrupted","source":"The Record","date":"2026-01-27T13:44:39.000Z","url":"https://therecord.media/russia-delta-security-alarm-company-cyberattack","summary":"Building and car alarm systems managed by Russian company Delta have been disrupted by a cyberattack blamed on a \"hostile foreign state.\"","tags":["SERVICES"]},{"title":"Botnet Spotlight: Pressure rises on botnets — but the fight is far from over","source":"Security Boulevard","date":"2026-01-27T11:57:32.000Z","url":"https://securityboulevard.com/2026/01/botnet-spotlight-pressure-rises-on-botnets-but-the-fight-is-far-from-over/","summary":"Momentum is building in the fight against botnets, as network operators and law enforcement ramp up crackdowns on botnet infrastructure, malware, and bulletproof hosting providers. While major takedowns show progress, cybercriminals are still adapting — learn more in this latest edition of the Botnet Spotlight.","tags":["LAW"]}]},{"id":"education","label":"Education","description":"Keywords: education, school, district, K-12, college, higher education, highered, university","articles":[]},{"id":"retail","label":"Retail","description":"Keywords: retail, e-commerce, stores, consumer, buyer, goods, fmcg, franchise, ATO","articles":[{"title":"AI and Regulation Redefine Application Security, New Global Study Finds","source":"IT Security Guru","date":"2026-02-04T18:14:26.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ai-and-regulation-redefine-application-security-new-global-study-finds/?utm_source=rss&utm_medium=rss&utm_campaign=ai-and-regulation-redefine-application-security-new-global-study-finds","summary":"Artificial intelligence has overtaken all other forces shaping application security, according to a major new industry study that shows organisations racing to secure AI-generated code while responding to growing regulatory pressure. The 16th edition of the Building Security In Maturity Model (BSIMM), released by Black Duck, analysed real-world software security practices across 111 organisations worldwide, […]\nThe post AI and Regulation Redefine Application Security, New Global Study Finds appeared first on IT Security Guru.","tags":["ATO"]},{"title":"Building a Unified Front Against Infostealers with Threat Intelligence","source":"VMRay","date":"2026-01-28T10:30:34.000Z","url":"https://www.vmray.com/building-a-unified-front-against-infostealers-with-threat-intelligence/","summary":"NATO strengthens cyber resilience through advanced analysis, intelligence-led defence, and coordinated response to hybrid cyber threats.","tags":["ATO"]},{"title":"Botnet Spotlight: Pressure rises on botnets — but the fight is far from over","source":"Security Boulevard","date":"2026-01-27T11:57:32.000Z","url":"https://securityboulevard.com/2026/01/botnet-spotlight-pressure-rises-on-botnets-but-the-fight-is-far-from-over/","summary":"Momentum is building in the fight against botnets, as network operators and law enforcement ramp up crackdowns on botnet infrastructure, malware, and bulletproof hosting providers. While major takedowns show progress, cybercriminals are still adapting — learn more in this latest edition of the Botnet Spotlight.","tags":["ATO"]}]},{"id":"transportation","label":"Transportation","description":"Keywords: transportation, truck, logistics, shipping, cars, trucking, freight, airline, air traffic control","articles":[{"title":"Week in review: Exploited newly patched BeyondTrust RCE, United Airlines CISO on building resilience","source":"Help Net Security","date":"2026-02-15T09:00:42.000Z","url":"https://www.helpnetsecurity.com/2026/02/15/week-in-review-exploited-newly-patched-beyondtrust-rce-united-airlines-ciso-on-building-resilience/","summary":"Here’s an overview of some of last week’s most interesting news, articles, interviews and videos: United Airlines CISO on building resilience when","tags":["AIRLINE"]},{"title":"United Airlines CISO on building resilience when disruption is inevitable","source":"Help Net Security","date":"2026-02-09T06:30:29.000Z","url":"https://www.helpnetsecurity.com/2026/02/09/deneen-defiore-united-airlines-aviation-cybersecurity-strategy/","summary":"United Airlines CISO shares how aviation cybersecurity strategy balances modernization, safety-critical systems, resilience, and risk.","tags":["AIRLINE"]}]},{"id":"software","label":"Software","description":"Keywords: software, SaaS, applications, platforms, code, XSS, OWASP","articles":[{"title":"Schneider Electric EcoStruxure Building Operation Workstation","source":"CISA (Alerts)","date":"2026-02-24T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-02","summary":"View CSAF\nSummary\nSchneider Electric is aware of a vulnerability in EcoStruxure Building Operation Workstation and EcoStruxure Building Operation WebStation. [EcoStruxure Building Operation (EBO)](https://www.se.com/ww/en/product-range/62111-ecostruxure-building-operation-software/#overview) is an open and scalable software platform providing insight, control and management of multiple building systems and devices in one mobile-enabled convenient view. It delivers valuable data for decision-making to improve energy management and increase efficiency for better building performance and comfort, reduced carbon, and more sustainable building environments. Failure to apply the remediations below may risk exposure of local files or denial of service, which could result in data breaches, and operational disruptions.\nThe following versions of Schneider Electric EcoStruxure Building Operation Workstation are affected:\nEcoStruxure Building Operation Workstation vers:generic/>=7.0.x|<7.0.3.2000_","tags":["SOFTWARE"]},{"title":"Building Secure SaaS Architecture: Why Identity Must Be Designed from Day One","source":"Security Boulevard","date":"2026-02-24T09:35:57.000Z","url":"https://securityboulevard.com/2026/02/building-secure-saas-architecture-why-identity-must-be-designed-from-day-one/","summary":"Learn why identity must be built into SaaS architecture from day one to ensure secure authentication, compliance, and scalable growth.","tags":["SAAS"]},{"title":"Building Resilient Operations With Incident Management Software","source":"Comodo","date":"2026-02-18T18:35:00.000Z","url":"https://blog.comodo.com/it-management/incident-management-software/","summary":"Discover how incident management software improves response times, reduces risk, and strengthens cybersecurity and business resilience.","tags":["SOFTWARE"]},{"title":"Building Secure Authentication Faster: When SaaS Teams Should Go Passwordless","source":"Security Boulevard","date":"2026-02-16T11:28:32.000Z","url":"https://securityboulevard.com/2026/02/building-secure-authentication-faster-when-saas-teams-should-go-passwordless/","summary":"Learn when SaaS teams should adopt passwordless authentication to boost security, reduce friction, and accelerate secure product development.","tags":["SAAS"]},{"title":"AI Governance. When AI becomes an Identity.","source":"Security Boulevard","date":"2026-02-13T06:17:51.000Z","url":"https://securityboulevard.com/2026/02/ai-governance-when-ai-becomes-an-identity/","summary":"Building the Control Plane for ERP, Finance, and SaaS AI didn’t come with a rollout plan; it crept in unnoticed. Someone turned on a copilot in a finance or CRM application, an IT team tested an agent on a non‑production system that still contained real audit data, or a regional team started using an AI The post AI Governance. When AI becomes an Identity. appeared first on Safepaas.","tags":["SAAS"]},{"title":"AI and Regulation Redefine Application Security, New Global Study Finds","source":"IT Security Guru","date":"2026-02-04T18:14:26.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ai-and-regulation-redefine-application-security-new-global-study-finds/?utm_source=rss&utm_medium=rss&utm_campaign=ai-and-regulation-redefine-application-security-new-global-study-finds","summary":"Artificial intelligence has overtaken all other forces shaping application security, according to a major new industry study that shows organisations racing to secure AI-generated code while responding to growing regulatory pressure. The 16th edition of the Building Security In Maturity Model (BSIMM), released by Black Duck, analysed real-world software security practices across 111 organisations worldwide, […]\nThe post AI and Regulation Redefine Application Security, New Global Study Finds appeared first on IT Security Guru.","tags":["SOFTWARE","CODE"]},{"title":"Building Stronger Cyber Resilience With Automated Patch Management Software","source":"Comodo","date":"2026-02-02T11:29:28.000Z","url":"https://blog.comodo.com/pc-security/automated-patch-management-software/","summary":"Discover how automated patch management software strengthens security reduces risk and simplifies system updates for modern organizations.","tags":["SOFTWARE"]},{"title":"Pompelmi: Open-source secure file upload scanning for Node.js","source":"Help Net Security","date":"2026-02-02T06:00:01.000Z","url":"https://www.helpnetsecurity.com/2026/02/02/pompelmi-open-source-secure-file-upload-scanning-node-js/","summary":"Software teams building services in JavaScript are adding more layers of defense to handle untrusted file uploads. An open-source project called Pompelmi","tags":["SOFTWARE"]},{"title":"Why Your Dev Team Isn’t Broken, Just Misaligned","source":"Security Boulevard","date":"2026-01-28T14:47:57.000Z","url":"https://securityboulevard.com/2026/01/why-your-dev-team-isnt-broken-just-misaligned/","summary":"You’ve got smart engineers and developers. A fast-moving product team. Plenty of Jira tickets. So why does it still feel like you’re building in the...Read More The post Why Your Dev Team Isn’t Broken, Just Misaligned appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["SOFTWARE"]}]},{"id":"agriculture","label":"Agriculture","description":"Keywords: agriculture, farm, crops, seeds, livestock, agritech, produce food, soil","articles":[]},{"id":"consulting","label":"Consulting","description":"Keywords: consult, consulting, solutions, consultant","articles":[]},{"id":"food","label":"Food & Beverage","description":"Keywords: food, beverage, catering, FMCG, restaurant","articles":[]},{"id":"insurance","label":"Insurance","description":"Keywords: insurance, insure, reinsurance, underwriting, underwriter","articles":[]},{"id":"real-estate","label":"Real Estate","description":"Keywords: real estate, REIT, property, realtor","articles":[]},{"id":"manufacturing","label":"Manufacturing","description":"Keywords: industrial, manufacturing, ICS","articles":[]},{"id":"energy","label":"Energy & Utilities","description":"Keywords: energy, grid, renewables, utilities, oil, gas, power, OT","articles":[{"title":"Schneider Electric EcoStruxure Building Operation Workstation","source":"CISA (Alerts)","date":"2026-02-24T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-02","summary":"View CSAF\nSummary\nSchneider Electric is aware of a vulnerability in EcoStruxure Building Operation Workstation and EcoStruxure Building Operation WebStation. [EcoStruxure Building Operation (EBO)](https://www.se.com/ww/en/product-range/62111-ecostruxure-building-operation-software/#overview) is an open and scalable software platform providing insight, control and management of multiple building systems and devices in one mobile-enabled convenient view. It delivers valuable data for decision-making to improve energy management and increase efficiency for better building performance and comfort, reduced carbon, and more sustainable building environments. Failure to apply the remediations below may risk exposure of local files or denial of service, which could result in data breaches, and operational disruptions.\nThe following versions of Schneider Electric EcoStruxure Building Operation Workstation are affected:\nEcoStruxure Building Operation Workstation vers:generic/>=7.0.x|<7.0.3.2000_","tags":["ENERGY"]},{"title":"Building a Detection Foundation: Part 1 - The Single-Source Problem","source":"TrustedSec","date":"2026-02-24T05:00:00.000Z","url":"https://trustedsec.com/blog/building-a-detection-foundation-part-1-the-single-source-problem","summary":"<p>The Uncomfortable Truth About Your Telemetry Let me start with an observation that might hit close to home. In my years working Incident Response cases and running Tabletop Exercises, I&#039;ve noticed a pattern that…</p>","tags":["OT"]},{"title":"Using threat modeling and prompt injection to audit Comet","source":"Security Boulevard","date":"2026-02-20T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/using-threat-modeling-and-prompt-injection-to-audit-comet/","summary":"Before launching their Comet browser, Perplexity hired us to test the security of their AI-powered browsing features. Using adversarial testing guided by our TRAIL threat model, we demonstrated how four prompt injection techniques could extract users’ private information from Gmail by exploiting the browser’s AI assistant. The vulnerabilities we found reflect how AI agents behave when external content isn’t treated as untrusted input. We’ve distilled our findings into five recommendations that any team building AI-powered products should consider before deployment. If you want to learn more about how Perplexity addressed these findings, please see their corresponding blog post and research paper on addressing prompt injection within AI browser agents. Background Comet is a web browser that provides LLM-powered agentic browsing capabilities. The Perplexity assistant is available on a sidebar, which the user can interact with on any web page. The assistant has access to information like","tags":["POWER"]},{"title":"How to Organize Safely in the Age of Surveillance","source":"Wired","date":"2026-02-19T10:00:00.000Z","url":"https://www.wired.com/story/how-to-organize-safely-in-the-age-of-surveillance/","summary":"From threat modeling to encrypted collaboration apps, we’ve collected experts’ tips and tools for safely and effectively building a group—even while being targeted and tracked by the powerful.","tags":["POWER"]},{"title":"Smashing Security podcast #455: Face off: Meta’s Glasses and America’s internet kill switch","source":"Graham Cluley","date":"2026-02-19T00:30:44.000Z","url":"https://grahamcluley.com/smashing-security-podcast-455/","summary":"Could America turn off Europe's internet?\r\n\r\nThat’s one of the questions that Graham and special guest James Ball will be exploring as they discuss tech sovereignty.  Could Gmail, cloud services, and critical infrastructure really become geopolitical leverage? And is anyone actually building a Plan B?\r\n\r\nPlus we explore if Meta is quietly plotting to turn its smart glasses into face-recognising surveillance specs? With reports of internal memos suggesting they plan to launch controversial features while everyone’s distracted by political chaos, we ask: is this innovation really wanted by the public... or something far creepier?\r\n\r\nAll of this, and much more, in episode 455 of the award-winning \"Smashing Security\" podcast with cybersecurity veteran Graham Cluley, joined this week by journalist and author James Ball.","tags":["OT"]},{"title":"Building an Effective Incident Response Strategy to Combat Cyberattacks","source":"Security Boulevard","date":"2026-02-18T11:22:41.000Z","url":"https://securityboulevard.com/2026/02/building-an-effective-incident-response-strategy-to-combat-cyberattacks/","summary":"Developing a robust Incident Response (IR) strategy is vital for minimizing risks and damage during cyberattacks. Learn how to create an effective IR plan, the six phases of incident response, and the importance of assembling a skilled IR team with the right tools to ensure swift recovery and protection.\"","tags":["OT"]},{"title":"CVE-2021-3602 An information disclosure flaw was found in Buildah when building containers using chroot isolation. Running processes in container builds (e.g. Dockerfile RUN commands) can access environment variables from parent and grandparent processes. When run in a container in a CI/CD environment environment variables may include sensitive information that was shared with the container in order to be used only by Buildah itself (e.g. container registry credentials).","source":"Microsoft MSRC","date":"2026-02-18T10:21:51.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-3602","summary":"Information published.","tags":["OT"]},{"title":"CVE-2024-28835 Gnutls: potential crash during chain building/verification","source":"Microsoft MSRC","date":"2026-02-18T10:11:02.000Z","url":"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-28835","summary":"Information published.","tags":["OT"]},{"title":"Building an AI-powered defense-in-depth security architecture for serverless microservices","source":"AWS Security Blog","date":"2026-02-16T20:10:44.000Z","url":"https://aws.amazon.com/blogs/security/building-an-ai-powered-defense-in-depth-security-architecture-for-serverless-microservices/","summary":"Enterprise customers face an unprecedented security landscape where sophisticated cyber threats use artificial intelligence to identify vulnerabilities, automate attacks, and evade detection at machine speed. Traditional perimeter-based security models are insufficient when adversaries can analyze millions of attack vectors in seconds and exploit zero-day vulnerabilities before patches are available. The distributed nature of serverless architectures […]","tags":["POWER"]},{"title":"AI Governance. When AI becomes an Identity.","source":"Security Boulevard","date":"2026-02-13T06:17:51.000Z","url":"https://securityboulevard.com/2026/02/ai-governance-when-ai-becomes-an-identity/","summary":"Building the Control Plane for ERP, Finance, and SaaS AI didn’t come with a rollout plan; it crept in unnoticed. Someone turned on a copilot in a finance or CRM application, an IT team tested an agent on a non‑production system that still contained real audit data, or a regional team started using an AI The post AI Governance. When AI becomes an Identity. appeared first on Safepaas.","tags":["OT"]},{"title":"The Clean Way to Access AWS, Azure, and GCP From Kubernetes (No Secrets, No Rotations)","source":"Hacker Noon","date":"2026-02-13T04:27:32.000Z","url":"https://hackernoon.com/the-clean-way-to-access-aws-azure-and-gcp-from-kubernetes-no-secrets-no-rotations?source=rss","summary":"A multi-cloud strategy, building a distributed system, your Kubernetes pods need secure, passwordless authentication across AWS, Azure, and GCP.","tags":["OT"]},{"title":"Demand for outpatient medical buildings growing: reports","source":"HealthcareDive","date":"2026-02-12T17:06:40.000Z","url":"https://www.healthcaredive.com/news/demand-for-outpatient-medical-buildings-growing-reports/812336/","summary":"The average fit-out cost to turn space into a medical office building is $412 per square foot, not counting structural upgrades, according to an analysis.","tags":["OT"]},{"title":"Big oil is betting big on Toyota to win the solid-state battery race","source":"Electrek","date":"2026-02-09T23:04:48.000Z","url":"https://electrek.co/2026/02/09/big-oil-is-betting-big-on-toyota-to-win-the-solid-state-battery-race/","summary":"Toyota has been working on a solid-state program with Japanese refining oil giant Idemitsu Kosan since 2023. Now they're building a factory.","tags":["OIL","OT"]},{"title":"The GRU illegals","source":"Lab 52","date":"2026-02-08T09:49:56.000Z","url":"https://lab52.io/blog/the-gru-illegals/","summary":"Illegals are intelligence officers operating abroad under false identities and nationalities, without the protection of diplomatic immunity. Posing as ordinary citizens of other countries, these officers maintain fake identities, spending years building normal lives while spying. In front of other spies, these officers have no diplomatic protection: if they are discovered, they go to prison. […]","tags":["OT"]},{"title":"I Spent 15 Years Building Geospatial Threat Detection Systems. Here's Everything I Learned.","source":"Hacker Noon","date":"2026-02-06T05:28:34.000Z","url":"https://hackernoon.com/i-spent-15-years-building-geospatial-threat-detection-systems-heres-everything-i-learned?source=rss","summary":"The night I watched an attack unfold in real-time and our system caught it 47 minutes before anyone else noticed.","tags":["OT"]},{"title":"AI and Regulation Redefine Application Security, New Global Study Finds","source":"IT Security Guru","date":"2026-02-04T18:14:26.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ai-and-regulation-redefine-application-security-new-global-study-finds/?utm_source=rss&utm_medium=rss&utm_campaign=ai-and-regulation-redefine-application-security-new-global-study-finds","summary":"Artificial intelligence has overtaken all other forces shaping application security, according to a major new industry study that shows organisations racing to secure AI-generated code while responding to growing regulatory pressure. The 16th edition of the Building Security In Maturity Model (BSIMM), released by Black Duck, analysed real-world software security practices across 111 organisations worldwide, […]\nThe post AI and Regulation Redefine Application Security, New Global Study Finds appeared first on IT Security Guru.","tags":["OT"]},{"title":"Why Your Dev Team Isn’t Broken, Just Misaligned","source":"Security Boulevard","date":"2026-01-28T14:47:57.000Z","url":"https://securityboulevard.com/2026/01/why-your-dev-team-isnt-broken-just-misaligned/","summary":"You’ve got smart engineers and developers. A fast-moving product team. Plenty of Jira tickets. So why does it still feel like you’re building in the...Read More The post Why Your Dev Team Isn’t Broken, Just Misaligned appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["OT"]},{"title":"Building Visibility to Enable Secure Healthcare AI Adoption","source":"Zscaler","date":"2026-01-27T22:53:44.000Z","url":"https://www.zscaler.com/blogs/product-insights/building-visibility-enable-secure-healthcare-ai-adoption","summary":"Secure generative AI adoption in healthcare. Protect PHI, tackle shadow AI risks, and enable innovation with WebSocket inspection and Zero Trust governance.","tags":["OT"]},{"title":"Botnet Spotlight: Pressure rises on botnets — but the fight is far from over","source":"Security Boulevard","date":"2026-01-27T11:57:32.000Z","url":"https://securityboulevard.com/2026/01/botnet-spotlight-pressure-rises-on-botnets-but-the-fight-is-far-from-over/","summary":"Momentum is building in the fight against botnets, as network operators and law enforcement ramp up crackdowns on botnet infrastructure, malware, and bulletproof hosting providers. While major takedowns show progress, cybercriminals are still adapting — learn more in this latest edition of the Botnet Spotlight.","tags":["OT"]}]},{"id":"finance","label":"Banking & Finance","description":"Keywords: finance, banking, fintech, investment, cryptocurrency, SEC, wire fraud","articles":[{"title":"Building Secure SaaS Architecture: Why Identity Must Be Designed from Day One","source":"Security Boulevard","date":"2026-02-24T09:35:57.000Z","url":"https://securityboulevard.com/2026/02/building-secure-saas-architecture-why-identity-must-be-designed-from-day-one/","summary":"Learn why identity must be built into SaaS architecture from day one to ensure secure authentication, compliance, and scalable growth.","tags":["SEC"]},{"title":"Modern Workplaces Demand a New Meaning for “Site” in Network Security","source":"Security Boulevard","date":"2026-02-23T12:44:53.000Z","url":"https://securityboulevard.com/2026/02/modern-workplaces-demand-a-new-meaning-for-site-in-network-security/","summary":"The Problem with the Traditional Idea of a Site For a long time, the concept of a “site” in networking and security was synonymous with a physical office. This included: a headquarters building a branch office a campus connected to the corporate network This traditional model was built on several assumptions: employees primarily worked from... The post Modern Workplaces Demand a New Meaning for “Site” in Network Security appeared first on Aryaka.","tags":["SEC"]},{"title":"Building Resilient Operations With Predictive Issue Resolution","source":"Comodo","date":"2026-02-23T11:32:04.000Z","url":"https://blog.comodo.com/it-security/predictive-issue-resolution/","summary":"Discover how predictive issue resolution prevents downtime, strengthens cybersecurity, and improves operational efficiency across modern organizations.","tags":["SEC"]},{"title":"Building an Agentic Cloud Security Ecosystem: A Reference Architecture with Wiz MCP and Infosys Cyber Next","source":"Wiz","date":"2026-02-20T17:28:34.000Z","url":"https://www.wiz.io/blog/infosys-mcp","summary":"Discover how Wiz MCP bridges AI and cloud security data to enable multi-agent risk analysis with human-governed remediation.","tags":["SEC"]},{"title":"Building Stronger Control and Visibility With IT Asset Management","source":"Comodo","date":"2026-02-20T16:28:26.000Z","url":"https://blog.comodo.com/it-management/it-asset-management/","summary":"Discover how IT asset management improves visibility, security, compliance, and cost control across modern digital environments.","tags":["SEC"]},{"title":"Using threat modeling and prompt injection to audit Comet","source":"Security Boulevard","date":"2026-02-20T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/using-threat-modeling-and-prompt-injection-to-audit-comet/","summary":"Before launching their Comet browser, Perplexity hired us to test the security of their AI-powered browsing features. Using adversarial testing guided by our TRAIL threat model, we demonstrated how four prompt injection techniques could extract users’ private information from Gmail by exploiting the browser’s AI assistant. The vulnerabilities we found reflect how AI agents behave when external content isn’t treated as untrusted input. We’ve distilled our findings into five recommendations that any team building AI-powered products should consider before deployment. If you want to learn more about how Perplexity addressed these findings, please see their corresponding blog post and research paper on addressing prompt injection within AI browser agents. Background Comet is a web browser that provides LLM-powered agentic browsing capabilities. The Perplexity assistant is available on a sidebar, which the user can interact with on any web page. The assistant has access to information like","tags":["SEC"]},{"title":"Building Application Security from the Ground Up: An Organizational Approach","source":"Orca Security","date":"2026-02-19T13:50:00.000Z","url":"https://orca.security/resources/blog/building-application-security-from-the-ground-up/","summary":"Learn why technology alone can't fix security. Discover a proven framework for building an application security program to stop vulnerabilities at the source.","tags":["SEC"]},{"title":"Smashing Security podcast #455: Face off: Meta’s Glasses and America’s internet kill switch","source":"Graham Cluley","date":"2026-02-19T00:30:44.000Z","url":"https://grahamcluley.com/smashing-security-podcast-455/","summary":"Could America turn off Europe's internet?\r\n\r\nThat’s one of the questions that Graham and special guest James Ball will be exploring as they discuss tech sovereignty.  Could Gmail, cloud services, and critical infrastructure really become geopolitical leverage? And is anyone actually building a Plan B?\r\n\r\nPlus we explore if Meta is quietly plotting to turn its smart glasses into face-recognising surveillance specs? With reports of internal memos suggesting they plan to launch controversial features while everyone’s distracted by political chaos, we ask: is this innovation really wanted by the public... or something far creepier?\r\n\r\nAll of this, and much more, in episode 455 of the award-winning \"Smashing Security\" podcast with cybersecurity veteran Graham Cluley, joined this week by journalist and author James Ball.","tags":["SEC"]},{"title":"From Firewall Management to Adaptive Security: What IDC’s 2026 Report Means for Security Leaders","source":"Security Boulevard","date":"2026-02-18T22:24:03.000Z","url":"https://securityboulevard.com/2026/02/from-firewall-management-to-adaptive-security-what-idcs-2026-report-means-for-security-leaders/","summary":"Last year, IDC called firewall policy management a foundation organizations could no longer ignore. This year, the message is more direct. In its 2026 report, Building on Enforcement: Network Security...","tags":["SEC"]},{"title":"Building Resilient Operations With Incident Management Software","source":"Comodo","date":"2026-02-18T18:35:00.000Z","url":"https://blog.comodo.com/it-management/incident-management-software/","summary":"Discover how incident management software improves response times, reduces risk, and strengthens cybersecurity and business resilience.","tags":["SEC"]},{"title":"Will Your Organization Take the Quantum Leap in 2026? Read This First","source":"Security Boulevard","date":"2026-02-18T10:20:54.000Z","url":"https://securityboulevard.com/2026/02/will-your-organization-take-the-quantum-leap-in-2026-read-this-first/","summary":"Explore how organizations can prepare for the quantum age by developing quantum security intelligence, establishing governance plans, and prioritizing system updates. Learn strategies for building resilience without exorbitant investments as quantum computing technology advances","tags":["INVESTMENT","SEC"]},{"title":"Building Operational Excellence With an ITIL Aligned Service Desk","source":"Comodo","date":"2026-02-17T16:49:36.000Z","url":"https://blog.comodo.com/it-security/itil-aligned-service-desk/","summary":"Discover how an ITIL aligned service desk improves service quality streamlines workflows and strengthens operational and security outcomes.","tags":["SEC"]},{"title":"Zero Trust Execution: Building Verified Confidence at the Zscaler Public Sector Summit","source":"Zscaler","date":"2026-02-17T14:00:14.000Z","url":"https://www.zscaler.com/blogs/product-insights/zero-trust-execution-building-verified-confidence-zscaler-public-sector","summary":"Join Zscaler's Public Sector Summit (March 3, 2026, D.C.) to master Zero Trust execution, build verified confidence, and hear from top cyber policy leaders.","tags":["SEC"]},{"title":"Healthcare Cyber Resilience: Building a Trusted Data Foundation for Secure, AI-Ready Operations","source":"Inforisk","date":"2026-02-17T00:14:49.010Z","url":"https://www.inforisktoday.com/webinars/healthcare-cyber-resilience-building-trusted-data-foundation-for-w-6851","summary":". information risk management","tags":["SEC"]},{"title":"Building an AI-powered defense-in-depth security architecture for serverless microservices","source":"AWS Security Blog","date":"2026-02-16T20:10:44.000Z","url":"https://aws.amazon.com/blogs/security/building-an-ai-powered-defense-in-depth-security-architecture-for-serverless-microservices/","summary":"Enterprise customers face an unprecedented security landscape where sophisticated cyber threats use artificial intelligence to identify vulnerabilities, automate attacks, and evade detection at machine speed. Traditional perimeter-based security models are insufficient when adversaries can analyze millions of attack vectors in seconds and exploit zero-day vulnerabilities before patches are available. The distributed nature of serverless architectures […]","tags":["SEC"]},{"title":"Building Secure Authentication Faster: When SaaS Teams Should Go Passwordless","source":"Security Boulevard","date":"2026-02-16T11:28:32.000Z","url":"https://securityboulevard.com/2026/02/building-secure-authentication-faster-when-saas-teams-should-go-passwordless/","summary":"Learn when SaaS teams should adopt passwordless authentication to boost security, reduce friction, and accelerate secure product development.","tags":["SEC"]},{"title":"AI Governance. When AI becomes an Identity.","source":"Security Boulevard","date":"2026-02-13T06:17:51.000Z","url":"https://securityboulevard.com/2026/02/ai-governance-when-ai-becomes-an-identity/","summary":"Building the Control Plane for ERP, Finance, and SaaS AI didn’t come with a rollout plan; it crept in unnoticed. Someone turned on a copilot in a finance or CRM application, an IT team tested an agent on a non‑production system that still contained real audit data, or a regional team started using an AI The post AI Governance. When AI becomes an Identity. appeared first on Safepaas.","tags":["FINANCE"]},{"title":"The Clean Way to Access AWS, Azure, and GCP From Kubernetes (No Secrets, No Rotations)","source":"Hacker Noon","date":"2026-02-13T04:27:32.000Z","url":"https://hackernoon.com/the-clean-way-to-access-aws-azure-and-gcp-from-kubernetes-no-secrets-no-rotations?source=rss","summary":"A multi-cloud strategy, building a distributed system, your Kubernetes pods need secure, passwordless authentication across AWS, Azure, and GCP.","tags":["SEC"]},{"title":"United Airlines CISO on building resilience when disruption is inevitable","source":"Help Net Security","date":"2026-02-09T06:30:29.000Z","url":"https://www.helpnetsecurity.com/2026/02/09/deneen-defiore-united-airlines-aviation-cybersecurity-strategy/","summary":"United Airlines CISO shares how aviation cybersecurity strategy balances modernization, safety-critical systems, resilience, and risk.","tags":["SEC"]},{"title":"Automating GOAD and Live Malware Labs","source":"Elastic","date":"2026-02-05T00:00:00.000Z","url":"https://www.elastic.co/security-labs/automating-goad-and-live-malware-labs","summary":"Stop building labs by hand. Automate the deployment of a fully instrumented Purple Team range using Ludus and Elastic Security. Spin up infrastructure, execute attacks, and validate detection rules in a single, repeatable workflow.","tags":["SEC"]},{"title":"AI and Regulation Redefine Application Security, New Global Study Finds","source":"IT Security Guru","date":"2026-02-04T18:14:26.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ai-and-regulation-redefine-application-security-new-global-study-finds/?utm_source=rss&utm_medium=rss&utm_campaign=ai-and-regulation-redefine-application-security-new-global-study-finds","summary":"Artificial intelligence has overtaken all other forces shaping application security, according to a major new industry study that shows organisations racing to secure AI-generated code while responding to growing regulatory pressure. The 16th edition of the Building Security In Maturity Model (BSIMM), released by Black Duck, analysed real-world software security practices across 111 organisations worldwide, […]\nThe post AI and Regulation Redefine Application Security, New Global Study Finds appeared first on IT Security Guru.","tags":["SEC"]},{"title":"AI is now the #1 challenge in application security","source":"Beta News","date":"2026-02-04T14:00:14.000Z","url":"https://betanews.com/article/ai-is-now-the-1-challenge-in-application-security/","summary":"The 16th edition of the Building Security In Maturity Model (BSIMM) shows that AI is now the defining challenge in application security. Organizations are","tags":["SEC"]},{"title":"Building a Zero-Trust Framework for Cloud Banking","source":"Security Boulevard","date":"2026-02-04T08:24:38.000Z","url":"https://securityboulevard.com/2026/02/building-a-zero-trust-framework-for-cloud-banking/","summary":"Zero-trust architecture helps banks secure cloud environments, meet regulations, and scale innovation through identity-first security.","tags":["BANKING","SEC"]},{"title":"Building AI Security Together: New Ways to Partner with Wiz for AI Security in 2026","source":"Wiz","date":"2026-02-02T15:29:34.000Z","url":"https://www.wiz.io/blog/win-ai-partnerships","summary":"Wiz announces a new AI Security category in the Wiz Integration Network. Discover new dev tools like WIN MCP and Winnie AI Agent to scale your integrations.","tags":["SEC"]},{"title":"Shift Left Is Dead for Cloud PAM","source":"Security Boulevard","date":"2026-02-02T12:05:36.000Z","url":"https://securityboulevard.com/2026/02/shift-left-is-dead-for-cloud-pam/","summary":"Why I Stopped JIT’ing Users and Started JIT’ing Permissions By Cole HorsmanField CTO, Sonrai Security I first tried to “shift left” cloud identity in early 2020. We were building a greenfield AWS environment with a strong cloud team and leadership support to do things properly. The idea was familiar: push security decisions earlier, give developers","tags":["SEC"]},{"title":"Shift Left Is Dead for Cloud PAM","source":"Sonrai Security","date":"2026-02-02T12:05:36.000Z","url":"https://sonraisecurity.com/blog/shift-left-is-dead-for-cloud-pam/","summary":"Why I Stopped JIT’ing Users and Started JIT’ing Permissions By Cole HorsmanField CTO, Sonrai Security I first tried to “shift left” cloud identity in early 2020. We were building a greenfield AWS environment with a strong cloud team and leadership support to do things properly. The idea was familiar: push security decisions earlier, give developers […]","tags":["SEC"]},{"title":"Building Stronger Cyber Resilience With Automated Patch Management Software","source":"Comodo","date":"2026-02-02T11:29:28.000Z","url":"https://blog.comodo.com/pc-security/automated-patch-management-software/","summary":"Discover how automated patch management software strengthens security reduces risk and simplifies system updates for modern organizations.","tags":["SEC"]},{"title":"Pompelmi: Open-source secure file upload scanning for Node.js","source":"Help Net Security","date":"2026-02-02T06:00:01.000Z","url":"https://www.helpnetsecurity.com/2026/02/02/pompelmi-open-source-secure-file-upload-scanning-node-js/","summary":"Software teams building services in JavaScript are adding more layers of defense to handle untrusted file uploads. An open-source project called Pompelmi","tags":["SEC"]},{"title":"Building Visibility to Enable Secure Healthcare AI Adoption","source":"Zscaler","date":"2026-01-27T22:53:44.000Z","url":"https://www.zscaler.com/blogs/product-insights/building-visibility-enable-secure-healthcare-ai-adoption","summary":"Secure generative AI adoption in healthcare. Protect PHI, tackle shadow AI risks, and enable innovation with WebSocket inspection and Zero Trust governance.","tags":["SEC"]},{"title":"Top AI Technology & Cybersecurity Podcasts to Follow in 2026","source":"Security Boulevard","date":"2026-01-27T15:24:11.000Z","url":"https://securityboulevard.com/2026/01/top-ai-technology-cybersecurity-podcasts-to-follow-in-2026/","summary":"From AI agents and MCP to cybersecurity threats - discover the podcasts that industry leaders rely on. After scaling a CIAM platform to 1B+ users, I've identified the shows delivering real value in 2026. No hype, just practical insights from practitioners building the future.","tags":["SEC"]},{"title":"Russian security systems firm Delta hit by cyberattack, services disrupted","source":"The Record","date":"2026-01-27T13:44:39.000Z","url":"https://therecord.media/russia-delta-security-alarm-company-cyberattack","summary":"Building and car alarm systems managed by Russian company Delta have been disrupted by a cyberattack blamed on a \"hostile foreign state.\"","tags":["SEC"]}]},{"id":"telecom","label":"Telecommunications","description":"Keywords: telecom, network, ISP, broadband, 5G, carrier","articles":[{"title":"Modern Workplaces Demand a New Meaning for “Site” in Network Security","source":"Security Boulevard","date":"2026-02-23T12:44:53.000Z","url":"https://securityboulevard.com/2026/02/modern-workplaces-demand-a-new-meaning-for-site-in-network-security/","summary":"The Problem with the Traditional Idea of a Site For a long time, the concept of a “site” in networking and security was synonymous with a physical office. This included: a headquarters building a branch office a campus connected to the corporate network This traditional model was built on several assumptions: employees primarily worked from... The post Modern Workplaces Demand a New Meaning for “Site” in Network Security appeared first on Aryaka.","tags":["NETWORK"]},{"title":"From Firewall Management to Adaptive Security: What IDC’s 2026 Report Means for Security Leaders","source":"Security Boulevard","date":"2026-02-18T22:24:03.000Z","url":"https://securityboulevard.com/2026/02/from-firewall-management-to-adaptive-security-what-idcs-2026-report-means-for-security-leaders/","summary":"Last year, IDC called firewall policy management a foundation organizations could no longer ignore. This year, the message is more direct. In its 2026 report, Building on Enforcement: Network Security...","tags":["NETWORK"]},{"title":"Building AI Security Together: New Ways to Partner with Wiz for AI Security in 2026","source":"Wiz","date":"2026-02-02T15:29:34.000Z","url":"https://www.wiz.io/blog/win-ai-partnerships","summary":"Wiz announces a new AI Security category in the Wiz Integration Network. Discover new dev tools like WIN MCP and Winnie AI Agent to scale your integrations.","tags":["NETWORK"]},{"title":"Botnet Spotlight: Pressure rises on botnets — but the fight is far from over","source":"Security Boulevard","date":"2026-01-27T11:57:32.000Z","url":"https://securityboulevard.com/2026/01/botnet-spotlight-pressure-rises-on-botnets-but-the-fight-is-far-from-over/","summary":"Momentum is building in the fight against botnets, as network operators and law enforcement ramp up crackdowns on botnet infrastructure, malware, and bulletproof hosting providers. While major takedowns show progress, cybercriminals are still adapting — learn more in this latest edition of the Botnet Spotlight.","tags":["NETWORK"]}]}]}