{"updated":"2026-02-25T01:06:21.663Z","industries":[{"id":"government","label":"Government","description":"Keywords: government, county, federal, defense, court","articles":[{"title":"From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses","source":"Security Boulevard","date":"2026-02-18T12:00:00.000Z","url":"https://securityboulevard.com/2026/02/from-shadow-apis-to-shadow-ai-how-the-api-threat-model-is-expanding-faster-than-most-defenses/","summary":"The shadow technology problem is getting worse.  Over the past few years, organizations have scaled microservices, cloud-native apps, and partner integrations faster than corporate governance models could keep up, resulting in undocumented or shadow APIs.  We’re now seeing this pattern all over again with AI systems. And, even worse, AI introduces non-deterministic behavior, autonomous actions, The post From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses appeared first on Wallarm.","tags":["DEFENSE"]},{"title":"From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses","source":"Wallarm","date":"2026-02-18T12:00:00.000Z","url":"https://lab.wallarm.com/shadow-ai-api-security-risk/","summary":"The shadow technology problem is getting worse.  Over the past few years, organizations have scaled microservices, cloud-native apps, and partner integrations faster than corporate governance models could keep up, resulting in undocumented or shadow APIs.  We’re now seeing this pattern all over again with AI systems. And, even worse, AI introduces non-deterministic behavior, autonomous actions, [...]\nThe post From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses appeared first on Wallarm.","tags":["DEFENSE"]},{"title":"Koi Purchase Bolsters Palo Alto's AI Attack Surface Defense","source":"Inforisk","date":"2026-02-18T00:00:00.000Z","url":"https://www.inforisktoday.com/koi-purchase-bolsters-palo-altos-ai-attack-surface-defense-a-30789","summary":"Palo Alto Networks plans to acquire Koi Security for $300 million to address growing AI-driven endpoint risks. The startup's technology adds deep visibility into AI","tags":["DEFENSE"]},{"title":"Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety","source":"Security Boulevard","date":"2026-02-17T12:16:00.000Z","url":"https://securityboulevard.com/2026/02/ahead-of-the-curve-hickman-county-school-districts-proactive-approach-to-student-safety/","summary":"How Cloud Monitor provides long-term value and consistent student protection in Google Workspace In Centerville, Tennessee, Hickman County School District serves approximately 2,500 students across nine schools with a small but highly capable technology team. Leading that effort is Brad Gilbert, Director of Technology, a forward-thinking IT leader who has long recognized that student safety ... The post Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety appeared first on ManagedMethods Cybersecurity, Safety & Compliance for K-12.","tags":["COUNTY"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["DEFENSE"]},{"title":"Transparent Tribe Hacker Group Attacking India’s Startup Ecosystem","source":"Cyber Security News","date":"2026-02-06T19:46:29.000Z","url":"https://cybersecuritynews.com/transparent-tribe-hacker-group/","summary":"The threat landscape for India’s technology sector has taken an unexpected turn. A Pakistan-based hacking group called Transparent Tribe has shifted its focus from traditional government targets to the country’s vibrant startup ecosystem, particularly companies working in cybersecurity and intelligence domains. The group, also tracked as APT36, has been active since 2013 and now uses […]\nThe post Transparent Tribe Hacker Group Attacking India’s Startup Ecosystem appeared first on Cyber Security News.","tags":["GOVERNMENT"]}]},{"id":"healthcare","label":"Healthcare","description":"Keywords: healthcare, hospital, clinic, medical, biotech, pharmacy, pharma, hipaa","articles":[{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["HEALTHCARE","MEDICAL"]},{"title":"The AI Influx is Here. Time to Establish Your “Department of Know.”","source":"Netskope","date":"2026-02-17T16:21:35.000Z","url":"https://www.netskope.com/blog/the-ai-influx-is-here-time-to-establish-your-department-of-know","summary":"AI has forced healthcare leaders into a precarious position. While many were still debating whether the technology should be used, its value was so clear","tags":["HEALTHCARE"]},{"title":"Healthcare Technology Company Discloses Ransomware Attack","source":"HIPAA Journal","date":"2026-02-05T14:58:22.000Z","url":"https://www.hipaajournal.com/insightin-health-clinic-service-corporation-data-breach/","summary":"Cyberattacks and data breaches have recently been announced by the healthcare technology company Insightin Health and the Colorado-based medical billing […]\nThe post Healthcare Technology Company Discloses Ransomware Attack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","MEDICAL","HIPAA"]}]},{"id":"construction","label":"Construction","description":"Keywords: construction, construct, HVAC, building","articles":[{"title":"Top Technology Stacks for MVP Development in 2026","source":"HackRead","date":"2026-02-23T13:53:40.000Z","url":"https://hackread.com/top-technology-stacks-mvp-development-2026/","summary":"Top technology stacks for MVP development in 2026, best tools for fast launch, scalability, cost efficiency, and proven frameworks for startups building products.","tags":["BUILDING"]},{"title":"Building Application Security from the Ground Up: An Organizational Approach","source":"Orca Security","date":"2026-02-19T13:50:00.000Z","url":"https://orca.security/resources/blog/building-application-security-from-the-ground-up/","summary":"Learn why technology alone can't fix security. Discover a proven framework for building an application security program to stop vulnerabilities at the source.","tags":["BUILDING"]},{"title":"Will Your Organization Take the Quantum Leap in 2026? Read This First","source":"Security Boulevard","date":"2026-02-18T10:20:54.000Z","url":"https://securityboulevard.com/2026/02/will-your-organization-take-the-quantum-leap-in-2026-read-this-first/","summary":"Explore how organizations can prepare for the quantum age by developing quantum security intelligence, establishing governance plans, and prioritizing system updates. Learn strategies for building resilience without exorbitant investments as quantum computing technology advances","tags":["BUILDING"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["BUILDING"]}]},{"id":"business-services","label":"Business Services","description":"Keywords: business, professional, services, accounting, law firm, LLP, associates, law","articles":[{"title":"Honor to unveil first humanoid robot targeting consumer services","source":"Techmonitor","date":"2026-02-24T10:12:40.000Z","url":"https://www.techmonitor.ai/news/honor-to-unveil-first-humanoid-robot-targeting-consumer-services","summary":"Chinese smartphone manufacturer Honor will present its inaugural humanoid robot at the MWC Barcelona technology conference this weekend.","tags":["SERVICES"]},{"title":"Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","source":"Arctic Wolf","date":"2026-02-23T16:59:04.000Z","url":"https://arcticwolf.com/resources/blog/welcoming-sevco-security-expanding-the-aurora-platform-with-visionary-exposure-management/","summary":"By Dan Schiappa, President, Technology and Services, Arctic Wolf Security operations is undergoing a fundamental shift. For years, organizations have focused primarily on detecting and responding to threats after they occur. But as attack surfaces expand across endpoints, cloud, identity, SaaS, and infrastructure, that reactive model is no longer enough. Security teams are increasingly being ... Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","tags":["SERVICES"]},{"title":"Ransomware Readiness is the Difference Between A Bad Day at Work and No More Workplace","source":"Security Boulevard","date":"2026-02-23T09:52:15.000Z","url":"https://securityboulevard.com/2026/02/ransomware-readiness-is-the-difference-between-a-bad-day-at-work-and-no-more-workplace/","summary":"Ransomware is now a routine business risk. True resilience comes from governance, tested incident response plans, recovery readiness, legal preparation, and trained leadership—not just security technology.","tags":["BUSINESS"]},{"title":"SerpApi Files Suit Against SearchApi for Stealing Proprietary Technology","source":"Cyber Security News","date":"2026-02-21T14:23:56.000Z","url":"https://cybersecuritynews.com/serpapi-files-suit-against-searchapi-for-stealing-proprietary-technology/","summary":"SerpApi files a lawsuit against SearchApi, alleging theft of proprietary technology and unfair competition in the search data industry.","tags":["LAW"]},{"title":"Why White Label MSP Services Are Key to Growing Businesses","source":"Security Boulevard","date":"2026-02-19T12:06:43.000Z","url":"https://securityboulevard.com/2026/02/why-white-label-msp-services-are-key-to-growing-businesses/","summary":"Originally published at Why White Label MSP Services Are Key to Growing Businesses by EasyDMARC. Running a modern business means relying on technology ... The post Why White Label MSP Services Are Key to Growing Businesses appeared first on EasyDMARC.","tags":["BUSINESS","SERVICES"]},{"title":"From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses","source":"Security Boulevard","date":"2026-02-18T12:00:00.000Z","url":"https://securityboulevard.com/2026/02/from-shadow-apis-to-shadow-ai-how-the-api-threat-model-is-expanding-faster-than-most-defenses/","summary":"The shadow technology problem is getting worse.  Over the past few years, organizations have scaled microservices, cloud-native apps, and partner integrations faster than corporate governance models could keep up, resulting in undocumented or shadow APIs.  We’re now seeing this pattern all over again with AI systems. And, even worse, AI introduces non-deterministic behavior, autonomous actions, The post From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses appeared first on Wallarm.","tags":["SERVICES"]},{"title":"From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses","source":"Wallarm","date":"2026-02-18T12:00:00.000Z","url":"https://lab.wallarm.com/shadow-ai-api-security-risk/","summary":"The shadow technology problem is getting worse.  Over the past few years, organizations have scaled microservices, cloud-native apps, and partner integrations faster than corporate governance models could keep up, resulting in undocumented or shadow APIs.  We’re now seeing this pattern all over again with AI systems. And, even worse, AI introduces non-deterministic behavior, autonomous actions, [...]\nThe post From Shadow APIs to Shadow AI: How the API Threat Model Is Expanding Faster Than Most Defenses appeared first on Wallarm.","tags":["SERVICES"]},{"title":"Why technology revolutions spark unexpected consequences [Q&A]","source":"Beta News","date":"2026-02-18T09:50:04.000Z","url":"https://betanews.com/article/why-technology-revolutions-spark-unexpected-consequences-qa/","summary":"The current technology revolution -- a culmination of computing power, global networks, and learning algorithms -- is remaking our world in real time. We spoke to Jamie Dobson, the founder of digital services company Container Solutions and author of Visionaries, Rebels and Machines: The story of humanity’s extraordinary journey from electrification to cloudification to discuss the unexpected consequences of technological progress. BN: Of all the technologies available to us, Artificial Intelligence is the current headline act, and it’s becoming an increasingly important part of modern life, but it’s not welcomed by everyone. Do they have a point? JD: What we… [Continue Reading]","tags":["SERVICES"]},{"title":"Data-only extortion grows as ransomware gangs seek better profits","source":"Cybersecurity Dive","date":"2026-02-17T15:31:42.000Z","url":"https://www.cybersecuritydive.com/news/ransomware-extortion-bec-arctic-wolf/812321/","summary":"Businesses should prioritize securing one type of technology in particular, the security firm Arctic Wolf said in a new report.","tags":["BUSINESS"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"NSFOCUS","date":"2026-02-13T08:11:25.000Z","url":"https://nsfocusglobal.com/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related […]","tags":["PROFESSIONAL"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"Security Boulevard","date":"2026-02-13T08:11:25.000Z","url":"https://securityboulevard.com/2026/02/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related The post Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group appeared first on NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks..","tags":["PROFESSIONAL"]},{"title":"The FBI Recovered “Deleted” Nest Cam Footage — Here’s Why Every CISO Should Panic","source":"Security Boulevard","date":"2026-02-12T09:02:29.000Z","url":"https://securityboulevard.com/2026/02/the-fbi-recovered-deleted-nest-cam-footage-heres-why-every-ciso-should-panic/","summary":"The Nancy Guthrie case has raised serious concerns about data retention in cloud technology and IoT devices. After a Google Nest camera captured footage of a suspect at her home, investigators were able to recover this footage, despite the absence of an active subscription that would typically lead to automatic deletion. This highlights a critical issue: data marked for deletion may still exist and be recoverable, posing risks for organizations relying on cloud vendors. As cybersecurity professionals, we must advocate for stronger data management practices and transparency. Let's audit our vendor contracts and ensure we implement robust cybersecurity measures. 🛡️💻 #Cybersecurity #DataPrivacy #IoT #CloudTechnology","tags":["PROFESSIONAL"]},{"title":"The New CIO Mandate: From IT Operator to Strategy Architect","source":"Inforisk","date":"2026-02-12T00:00:00.000Z","url":"https://www.inforisktoday.com/new-cio-mandate-from-operator-to-strategy-architect-a-30745","summary":"Before artificial intelligence dominated every technology conversation, the successful CIO focused on keeping business systems up and running while keeping costs in","tags":["BUSINESS"]},{"title":"iOS and Android users beware: This new spyware kit allows hackers to take full control of your device","source":"IT Pro","date":"2026-02-11T12:07:05.000Z","url":"https://www.itpro.com/technology/artificial-intelligence/this-new-mobile-compromise-toolkit-enables-spyware-surveillance-and-data-theft","summary":"The professional package allows even unsophisticated attackers to take full control of devices","tags":["PROFESSIONAL"]},{"title":"NTT Data deepens Middle East cloud push with acquisition of UAE-based Zero&One","source":"Computer Weekly","date":"2026-02-09T09:45:00.000Z","url":"https://www.computerweekly.com/news/366638731/NTT-DATA-deepens-Middle-East-cloud-push-with-acquisition-of-UAE-based-ZeroOne","summary":"Deal highlights growing strategic importance of the UAE as global technology firms race to scale cloud, AI and digital services across the region.","tags":["SERVICES"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["PROFESSIONAL"]},{"title":"OT attacks surge as threat actors embrace cloud and AI, warns Forescout","source":"IT Security Guru","date":"2026-02-04T14:42:41.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout/?utm_source=rss&utm_medium=rss&utm_campaign=ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout","summary":"Cyberattacks targeting operational technology (OT) environments rose sharply in 2025, according to new research from Forescout, highlighting growing risks to critical infrastructure as attackers adapt to cloud services, AI platforms and increasingly distributed attack infrastructure. Forescout’s 2025 Threat Roundup Report, produced by its research arm Vedere Labs, analysed more than 900 million cyberattacks observed globally […]\nThe post OT attacks surge as threat actors embrace cloud and AI, warns Forescout appeared first on IT Security Guru.","tags":["SERVICES"]}]},{"id":"education","label":"Education","description":"Keywords: education, school, district, K-12, college, higher education, highered, university","articles":[{"title":"AI Has Entered Schools—But What About Its Responsible Use?","source":"The Cyber Express","date":"2026-02-19T08:13:36.000Z","url":"https://thecyberexpress.com/ai-in-education-shaping-classrooms-of-tomorrow/","summary":"As global leaders emphasized, AI in education is not just about technology—it is about people, pedagogy, and trust.","tags":["EDUCATION","SCHOOL"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["UNIVERSITY"]},{"title":"Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety","source":"Security Boulevard","date":"2026-02-17T12:16:00.000Z","url":"https://securityboulevard.com/2026/02/ahead-of-the-curve-hickman-county-school-districts-proactive-approach-to-student-safety/","summary":"How Cloud Monitor provides long-term value and consistent student protection in Google Workspace In Centerville, Tennessee, Hickman County School District serves approximately 2,500 students across nine schools with a small but highly capable technology team. Leading that effort is Brad Gilbert, Director of Technology, a forward-thinking IT leader who has long recognized that student safety ... The post Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety appeared first on ManagedMethods Cybersecurity, Safety & Compliance for K-12.","tags":["SCHOOL","DISTRICT","K-12"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["UNIVERSITY"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["UNIVERSITY"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["SCHOOL","UNIVERSITY"]}]},{"id":"retail","label":"Retail","description":"Keywords: retail, e-commerce, stores, consumer, buyer, goods, fmcg, franchise, ATO","articles":[{"title":"Honor to unveil first humanoid robot targeting consumer services","source":"Techmonitor","date":"2026-02-24T10:12:40.000Z","url":"https://www.techmonitor.ai/news/honor-to-unveil-first-humanoid-robot-targeting-consumer-services","summary":"Chinese smartphone manufacturer Honor will present its inaugural humanoid robot at the MWC Barcelona technology conference this weekend.","tags":["CONSUMER"]},{"title":"Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","source":"Arctic Wolf","date":"2026-02-23T16:59:22.000Z","url":"https://arcticwolf.com/resources/press-releases/arctic-wolf-acquires-exposure-assessment-platform-visionary-sevco-security/","summary":"Acquisition to strengthen proactive security by adding next-generation asset intelligence and exposure assessment to the Aurora Platform EDEN PRAIRIE, Minn. – February 23, 2026 – Arctic Wolf®, a global leader in security operations, today announced it has acquired Sevco Security, an innovator in exposure assessment platforms. Sevco’s cloud-native technology will operate on the Arctic Wolf ... Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","tags":["ATO"]},{"title":"NDSS 2025 -DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing","source":"Security Boulevard","date":"2026-02-21T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-dumpling-fine-grained-differential-javascript-engine-fuzzing/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Liam Wachter (EPFL), Julian Gremminger (EPFL), Christian Wressnegger (Karlsruhe Institute of Technology (KIT)), Mathias Payer (EPFL), Flavio Toffalini (EPFL) PAPER DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing Web browsers are ubiquitous and execute untrusted JavaScript (JS) code. JS engines optimize frequently executed code through just-in-time (JIT) compilation. Subtly conflicting assumptions between optimizations frequently result in JS engine vulnerabilities. Attackers can take advantage of such diverging assumptions and use the flexibility of JS to craft exploits that produce a miscalculation, remove bounds checks in JIT compiled code, and ultimately gain arbitrary code execution. Classical fuzzing approaches for JS engines only detect bugs if the engine crashes or a runtime assertion fails. Differential fuzzing can compare interpreted code against optimized JIT compiled code to detect differences in","tags":["ATO"]},{"title":"Jinan USR IOT Technology Limited (PUSR) USR-W610","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials.\nThe following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected:\nUSR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nJinan USR IOT Technology Limited (PUSR)\nJinan USR IOT Technology Limited (PUSR) USR-W610\nWeak Password Requirements, Cleartext Transmission of Sensitive Information, Insufficiently Protected Credentials, Missing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25715\nThe web management interface of the device allows the administrator username and password to be set to blank va","tags":["ATO"]},{"title":"Figure Breach Enters New Phase After Data Leak Claims","source":"Security Boulevard","date":"2026-02-18T21:53:41.000Z","url":"https://securityboulevard.com/2026/02/figure-breach-enters-new-phase-after-data-leak-claims/","summary":"The data breach disclosed by fintech lender Figure Technology Solutions is moving beyond a contained security incident, as reports that stolen customer information is circulating online coincide with early legal investigations. The developments mark the point where an internal breach begins to create broader consumer risk and potential liability. Latest Developments Data associated with the The post Figure Breach Enters New Phase After Data Leak Claims appeared first on Centraleyes.","tags":["CONSUMER"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ATO"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["ATO"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ATO"]},{"title":"3D Printer Surveillance","source":"Schneier on Security","date":"2026-02-12T12:01:31.000Z","url":"https://www.schneier.com/blog/archives/2026/02/3d-printer-surveillance.html","summary":"New York is contemplating a bill that adds surveillance to 3D printers: New York’s 2026­2027 executive budget bill (S.9005 / A.10005) includes language that should alarm every maker, educator, and small manufacturer in the state. Buried in Part C is a provision requiring all 3D printers sold or delivered in New York to include “blocking technology.” This is defined as software or firmware that scans every print file through a “firearms blueprint detection algorithm” and refuses to print anything it flags as a potential firearm or firearm component...","tags":["ATO"]},{"title":"The FBI Recovered “Deleted” Nest Cam Footage — Here’s Why Every CISO Should Panic","source":"Security Boulevard","date":"2026-02-12T09:02:29.000Z","url":"https://securityboulevard.com/2026/02/the-fbi-recovered-deleted-nest-cam-footage-heres-why-every-ciso-should-panic/","summary":"The Nancy Guthrie case has raised serious concerns about data retention in cloud technology and IoT devices. After a Google Nest camera captured footage of a suspect at her home, investigators were able to recover this footage, despite the absence of an active subscription that would typically lead to automatic deletion. This highlights a critical issue: data marked for deletion may still exist and be recoverable, posing risks for organizations relying on cloud vendors. As cybersecurity professionals, we must advocate for stronger data management practices and transparency. Let's audit our vendor contracts and ensure we implement robust cybersecurity measures. 🛡️💻 #Cybersecurity #DataPrivacy #IoT #CloudTechnology","tags":["ATO"]},{"title":"The New CIO Mandate: From IT Operator to Strategy Architect","source":"Inforisk","date":"2026-02-12T00:00:00.000Z","url":"https://www.inforisktoday.com/new-cio-mandate-from-operator-to-strategy-architect-a-30745","summary":"Before artificial intelligence dominated every technology conversation, the successful CIO focused on keeping business systems up and running while keeping costs in","tags":["ATO"]},{"title":"9th February – Threat Intelligence Report","source":"Checkpoint Research","date":"2026-02-09T12:50:16.000Z","url":"https://research.checkpoint.com/2026/9th-february-threat-intelligence-report/","summary":"For the latest discoveries in cyber research for the week of 9th February, please download our Threat Intelligence Bulletin. TOP ATTACKS AND BREACHES Romania’s national oil pipeline operator, Conpet, has suffered a cyberattack that disrupted its IT systems and took its website offline. The company said operational technology, including pipeline control and telecommunications systems, remained […]","tags":["ATO"]},{"title":"Romania’s oil pipeline operator confirms cyberattack as hackers claim data theft","source":"Databreaches.net","date":"2026-02-08T15:09:19.000Z","url":"https://databreaches.net/2026/02/08/romanias-oil-pipeline-operator-confirms-cyberattack-as-hackers-claim-data-theft/?pk_campaign=feed&pk_kwd=romanias-oil-pipeline-operator-confirms-cyberattack-as-hackers-claim-data-theft","summary":"Daryna Antoniuk reports: Romania’s national oil pipeline operator Conpet said a cyberattack disrupted parts of its technology infrastructure and knocked its web","tags":["ATO"]},{"title":"Romania’s oil pipeline operator confirms cyberattack as hackers claim data theft","source":"The Record","date":"2026-02-06T11:55:20.000Z","url":"https://therecord.media/romania-conpet-oil-pipeline-ransomware-attack","summary":"Romania’s national oil pipeline operator Conpet said a cyberattack disrupted parts of its technology infrastructure and knocked its website offline earlier this week, adding that oil transport operations were not affected.","tags":["ATO"]}]},{"id":"transportation","label":"Transportation","description":"Keywords: transportation, truck, logistics, shipping, cars, trucking, freight, airline, air traffic control","articles":[]},{"id":"software","label":"Software","description":"Keywords: software, SaaS, applications, platforms, code, XSS, OWASP","articles":[{"title":"Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","source":"Arctic Wolf","date":"2026-02-23T16:59:22.000Z","url":"https://arcticwolf.com/resources/press-releases/arctic-wolf-acquires-exposure-assessment-platform-visionary-sevco-security/","summary":"Acquisition to strengthen proactive security by adding next-generation asset intelligence and exposure assessment to the Aurora Platform EDEN PRAIRIE, Minn. – February 23, 2026 – Arctic Wolf®, a global leader in security operations, today announced it has acquired Sevco Security, an innovator in exposure assessment platforms. Sevco’s cloud-native technology will operate on the Arctic Wolf ... Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","tags":["PLATFORMS"]},{"title":"Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","source":"Arctic Wolf","date":"2026-02-23T16:59:04.000Z","url":"https://arcticwolf.com/resources/blog/welcoming-sevco-security-expanding-the-aurora-platform-with-visionary-exposure-management/","summary":"By Dan Schiappa, President, Technology and Services, Arctic Wolf Security operations is undergoing a fundamental shift. For years, organizations have focused primarily on detecting and responding to threats after they occur. But as attack surfaces expand across endpoints, cloud, identity, SaaS, and infrastructure, that reactive model is no longer enough. Security teams are increasingly being ... Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","tags":["SAAS"]},{"title":"NDSS 2025 -DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing","source":"Security Boulevard","date":"2026-02-21T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-dumpling-fine-grained-differential-javascript-engine-fuzzing/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Liam Wachter (EPFL), Julian Gremminger (EPFL), Christian Wressnegger (Karlsruhe Institute of Technology (KIT)), Mathias Payer (EPFL), Flavio Toffalini (EPFL) PAPER DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing Web browsers are ubiquitous and execute untrusted JavaScript (JS) code. JS engines optimize frequently executed code through just-in-time (JIT) compilation. Subtly conflicting assumptions between optimizations frequently result in JS engine vulnerabilities. Attackers can take advantage of such diverging assumptions and use the flexibility of JS to craft exploits that produce a miscalculation, remove bounds checks in JIT compiled code, and ultimately gain arbitrary code execution. Classical fuzzing approaches for JS engines only detect bugs if the engine crashes or a runtime assertion fails. Differential fuzzing can compare interpreted code against optimized JIT compiled code to detect differences in","tags":["CODE"]},{"title":"Loan applications, drivers licences, personal data of 440k Aussies exposed after hacker hits Sydney finance tech company youX","source":"Databreaches","date":"2026-02-20T13:20:13.000Z","url":"https://databreaches.net/2026/02/20/loan-applications-drivers-licences-personal-data-of-440k-aussies-exposed-after-hacker-hits-sydney-finance-tech-company-youx/?pk_campaign=feed&pk_kwd=loan-applications-drivers-licences-personal-data-of-440k-aussies-exposed-after-hacker-hits-sydney-finance-tech-company-youx","summary":"Emma Kirk reports: A hacker has exposed personal data belonging to hundreds of thousands of Australians it allegedly stole from a Sydney finance technology comp","tags":["APPLICATIONS"]},{"title":"Hackers target Microsoft Entra accounts in device code vishing attacks","source":"Bleeping Computer","date":"2026-02-19T12:30:37.000Z","url":"https://www.bleepingcomputer.com/news/security/hackers-target-microsoft-entra-accounts-in-device-code-vishing-attacks/","summary":"Threat actors are targeting technology, manufacturing, and financial organizations in campaigns that combine device code phishing and voice phishing (vishing) to abuse the OAuth 2.0 Device Authorization flow and compromise Microsoft Entra accounts.","tags":["CODE"]},{"title":"EnOcean SmartServer IoT","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-01","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could allow an attacker to remotely execute arbitrary code and bypass ASLR.\nThe following versions of EnOcean SmartServer IoT are affected:\nSmartServer IoT <=4.60.009 (CVE-2026-20761, CVE-2026-22885)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 8.1\nEnOcean Edge Inc\nEnOcean SmartServer IoT\nImproper Neutralization of Special Elements used in a Command ('Command Injection'), Out-of-bounds Read\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\nVulnerabilities\nExpand All +\nCVE-2026-20761\nA vulnerability exists in EnOcean SmartServer IoT version 4.60.009 and prior, which would allow remote attackers, in the LON IP-852 management messages, to send specially crafted IP-852 messages resulting in arbitrary OS command execution on the device.\nView CVE Details\nAffected Products\nEnOcean SmartServer IoT\nVendor:\nEnOcean Edge Inc\nProdu","tags":["CODE"]},{"title":"Securing our Critical Infrastructure with Zero Trust","source":"Security Boulevard","date":"2026-02-18T15:00:10.000Z","url":"https://securityboulevard.com/2026/02/securing-our-critical-infrastructure-with-zero-trust/","summary":"We are seeing a steady rise in cyberattacks against critical infrastructure and it’s not surprising. Many of these systems rely on legacy software riddled with known vulnerabilities. When these systems fail, the impact moves quickly from networks to operations, and from operations to public safety. There is still a dangerous misconception that operational technology (OT) The post Securing our Critical Infrastructure with Zero Trust appeared first on ColorTokens.","tags":["SOFTWARE"]},{"title":"NDSS 2025 – Automated Mass Malware Factory","source":"Security Boulevard","date":"2026-02-13T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-automated-mass-malware-factory/","summary":"Session 12B: Malware   Authors, Creators & Presenters: Heng Li (Huazhong University of Science and Technology), Zhiyuan Yao (Huazhong University of Science and Technology), Bang Wu (Huazhong University of Science and Technology), Cuiying Gao (Huazhong University of Science and Technology), Teng Xu (Huazhong University of Science and Technology), Wei Yuan (Huazhong University of Science and Technology), Xiapu Luo (The Hong Kong Polytechnic University) PAPER Automated Mass Malware Factory: The Convergence of Piggybacking and Adversarial Example in Android Malicious Software Generation Adversarial example techniques have been demonstrated to be highly effective against Android malware detection systems, enabling malware to evade detection with minimal code modifications. However, existing adversarial example techniques overlook the process of malware generation, thus restricting the applicability of adversarial example techniques. In this paper, we investigate piggybacked malware, a type","tags":["SOFTWARE","CODE"]},{"title":"3D Printer Surveillance","source":"Schneier on Security","date":"2026-02-12T12:01:31.000Z","url":"https://www.schneier.com/blog/archives/2026/02/3d-printer-surveillance.html","summary":"New York is contemplating a bill that adds surveillance to 3D printers: New York’s 2026­2027 executive budget bill (S.9005 / A.10005) includes language that should alarm every maker, educator, and small manufacturer in the state. Buried in Part C is a provision requiring all 3D printers sold or delivered in New York to include “blocking technology.” This is defined as software or firmware that scans every print file through a “firearms blueprint detection algorithm” and refuses to print anything it flags as a potential firearm or firearm component...","tags":["SOFTWARE"]},{"title":"Siemens SINEC NMS","source":"CISA (Alerts)","date":"2026-02-12T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-01","summary":"View CSAF\nSummary\nMultiple Siemens products are affected by two local privilege escalation vulnerabilities which could allow an low privileged attacker to load malicious DLLs, potentially leading to arbitrary code execution with elevated privileges. Siemens has released new versions for the affected products and recommends to update to the latest versions.\nThe following versions of Siemens SINEC NMS are affected:\nSINEC NMS: Versions prior to V4.0 SP2 (CVE-2026-25655)\nSINEC NMS: All Versions (CVE-2026-25656)\nUser Management Component (UMC) vers:intdot/<2.15.2.1 (CVE-2026-25656)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 7.8\nSiemens\nSiemens SINEC NMS\nUncontrolled Search Path Element\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology, Energy, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\nVulnerabilities\nExpand All +\nCVE-2026-25655\nThe affected application permits improper modification of a configuration file by a lo","tags":["CODE"]},{"title":"CVE-2026-25806 | Praskla-Technology assessment-placipy 1.0.0 student.routes.ts authorization (GHSA-99gr-8933-3vwj)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345052","summary":"A vulnerability was found in Praskla-Technology assessment-placipy 1.0.0. It has been rated as critical. This vulnerability affects unknown code of the file backend/src/routes/student.routes.ts. Performing a manipulation results in missing authorization.\n\nThis vulnerability is identified as CVE-2026-25806. The attack can be initiated remotely. There is not any exploit available.","tags":["CODE"]},{"title":"CVE-2026-25753 | Praskla-Technology assessment-placipy up to 1.0.0 hard-coded password (GHSA-6537-cf56-j9w2)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.344738","summary":"A vulnerability, which was classified as critical, has been found in Praskla-Technology assessment-placipy up to 1.0.0. This affects an unknown function. This manipulation causes use of hard-coded password.\n\nThis vulnerability is tracked as CVE-2026-25753. The attack is possible to be carried out remotely. No exploit exists.","tags":["CODE"]},{"title":"CVE-2026-25809 | Praskla-Technology assessment-placipy 1.0.0 Code Evaluation Endpoint improper authorization (GHSA-cc32-rp29-w9x7)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345068","summary":"A vulnerability identified as critical has been detected in Praskla-Technology assessment-placipy 1.0.0. This affects an unknown function of the component Code Evaluation Endpoint. This manipulation causes improper authorization.\n\nThis vulnerability is tracked as CVE-2026-25809. The attack is possible to be carried out remotely. No exploit exists.","tags":["CODE"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:55:25.000Z","url":"https://arcticwolf.com/resources/glossary-uk/virtual-private-network/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["APPLICATIONS"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:37:15.000Z","url":"https://arcticwolf.com/resources/glossary/virtual-private-network-vpn/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["APPLICATIONS"]},{"title":"CVE-2025-6967 | Sarman CMS up to 10022026 Technology Service redirect","source":"Vuldb","date":"2026-02-10T14:30:39.000Z","url":"https://vuldb.com/?id.345195","summary":"A vulnerability labeled as critical has been found in Sarman CMS up to 10022026. This vulnerability affects unknown code of the component Technology Service. Such manipulation leads to execution after redirect.\n\nThis vulnerability is traded as CVE-2025-6967. The attack may be launched remotely. There is no exploit available.","tags":["CODE"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["APPLICATIONS"]},{"title":"OT attacks surge as threat actors embrace cloud and AI, warns Forescout","source":"IT Security Guru","date":"2026-02-04T14:42:41.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout/?utm_source=rss&utm_medium=rss&utm_campaign=ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout","summary":"Cyberattacks targeting operational technology (OT) environments rose sharply in 2025, according to new research from Forescout, highlighting growing risks to critical infrastructure as attackers adapt to cloud services, AI platforms and increasingly distributed attack infrastructure. Forescout’s 2025 Threat Roundup Report, produced by its research arm Vedere Labs, analysed more than 900 million cyberattacks observed globally […]\nThe post OT attacks surge as threat actors embrace cloud and AI, warns Forescout appeared first on IT Security Guru.","tags":["PLATFORMS"]}]},{"id":"agriculture","label":"Agriculture","description":"Keywords: agriculture, farm, crops, seeds, livestock, agritech, produce food, soil","articles":[]},{"id":"consulting","label":"Consulting","description":"Keywords: consult, consulting, solutions, consultant","articles":[{"title":"Nearly 1 Million User Records Compromised in Figure Data Breach","source":"Security Week","date":"2026-02-19T13:19:08.000Z","url":"https://www.securityweek.com/nearly-1-million-user-records-compromised-in-figure-data-breach/","summary":"Nearly 1 million user records have been compromised in a data breach at blockchain-powered lender Figure Technology Solutions.","tags":["SOLUTIONS"]},{"title":"Figure Breach Enters New Phase After Data Leak Claims","source":"Security Boulevard","date":"2026-02-18T21:53:41.000Z","url":"https://securityboulevard.com/2026/02/figure-breach-enters-new-phase-after-data-leak-claims/","summary":"The data breach disclosed by fintech lender Figure Technology Solutions is moving beyond a contained security incident, as reports that stolen customer information is circulating online coincide with early legal investigations. The developments mark the point where an internal breach begins to create broader consumer risk and potential liability. Latest Developments Data associated with the The post Figure Breach Enters New Phase After Data Leak Claims appeared first on Centraleyes.","tags":["SOLUTIONS"]},{"title":"Data breach at fintech firm Figure affects nearly 1 million accounts","source":"Bleeping Computer","date":"2026-02-18T14:01:08.000Z","url":"https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/","summary":"Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company.","tags":["SOLUTIONS"]},{"title":"Why technology revolutions spark unexpected consequences [Q&A]","source":"Beta News","date":"2026-02-18T09:50:04.000Z","url":"https://betanews.com/article/why-technology-revolutions-spark-unexpected-consequences-qa/","summary":"The current technology revolution -- a culmination of computing power, global networks, and learning algorithms -- is remaking our world in real time. We spoke to Jamie Dobson, the founder of digital services company Container Solutions and author of Visionaries, Rebels and Machines: The story of humanity’s extraordinary journey from electrification to cloudification to discuss the unexpected consequences of technological progress. BN: Of all the technologies available to us, Artificial Intelligence is the current headline act, and it’s becoming an increasingly important part of modern life, but it’s not welcomed by everyone. Do they have a point? JD: What we… [Continue Reading]","tags":["SOLUTIONS"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["SOLUTIONS"]},{"title":"Arctic Wolf Product Updates: February 2026","source":"Arctic Wolf","date":"2026-02-12T17:35:28.000Z","url":"https://arcticwolf.com/resources/blog-uk/arctic-wolf-product-updates-feb-2026/","summary":"Dive into the latest updates, innovations, and integrations for Arctic Wolf products and solutions, and a look at what’s new in the Arctic Wolf Aurora® Platform — the technology that makes it all possible.","tags":["SOLUTIONS"]},{"title":"Arctic Wolf Product Updates: February 2026","source":"Arctic Wolf","date":"2026-02-12T17:03:12.000Z","url":"https://arcticwolf.com/resources/blog/arctic-wolf-product-updates-february-2026/","summary":"Dive into the latest updates, innovations, and integrations for Arctic Wolf products and solutions, and take a look at what’s new in the Arctic Wolf Aurora® Platform — the technology that makes it all possible.","tags":["SOLUTIONS"]}]},{"id":"food","label":"Food & Beverage","description":"Keywords: food, beverage, catering, FMCG, restaurant","articles":[]},{"id":"insurance","label":"Insurance","description":"Keywords: insurance, insure, reinsurance, underwriting, underwriter","articles":[]},{"id":"real-estate","label":"Real Estate","description":"Keywords: real estate, REIT, property, realtor","articles":[]},{"id":"manufacturing","label":"Manufacturing","description":"Keywords: industrial, manufacturing, ICS","articles":[{"title":"Hackers target Microsoft Entra accounts in device code vishing attacks","source":"Bleeping Computer","date":"2026-02-19T12:30:37.000Z","url":"https://www.bleepingcomputer.com/news/security/hackers-target-microsoft-entra-accounts-in-device-code-vishing-attacks/","summary":"Threat actors are targeting technology, manufacturing, and financial organizations in campaigns that combine device code phishing and voice phishing (vishing) to abuse the OAuth 2.0 Device Authorization flow and compromise Microsoft Entra accounts.","tags":["MANUFACTURING"]},{"title":"Jinan USR IOT Technology Limited (PUSR) USR-W610","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials.\nThe following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected:\nUSR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nJinan USR IOT Technology Limited (PUSR)\nJinan USR IOT Technology Limited (PUSR) USR-W610\nWeak Password Requirements, Cleartext Transmission of Sensitive Information, Insufficiently Protected Credentials, Missing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25715\nThe web management interface of the device allows the administrator username and password to be set to blank va","tags":["MANUFACTURING"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["ICS"]},{"title":"Agentic AI must be deployed at scale with a systematic approach","source":"Techmonitor","date":"2026-02-17T11:08:43.000Z","url":"https://www.techmonitor.ai/comment-2/agentic-ai-must-be-deployed-at-scale-with-a-systematic-approach","summary":"Rajan Padmanabhan, principal technology architect for data analytics and AI at Infosys advises data readiness for effective agentic AI deployment.","tags":["ICS"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["ICS"]},{"title":"Siemens SINEC NMS","source":"CISA (Alerts)","date":"2026-02-12T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-01","summary":"View CSAF\nSummary\nMultiple Siemens products are affected by two local privilege escalation vulnerabilities which could allow an low privileged attacker to load malicious DLLs, potentially leading to arbitrary code execution with elevated privileges. Siemens has released new versions for the affected products and recommends to update to the latest versions.\nThe following versions of Siemens SINEC NMS are affected:\nSINEC NMS: Versions prior to V4.0 SP2 (CVE-2026-25655)\nSINEC NMS: All Versions (CVE-2026-25656)\nUser Management Component (UMC) vers:intdot/<2.15.2.1 (CVE-2026-25656)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 7.8\nSiemens\nSiemens SINEC NMS\nUncontrolled Search Path Element\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology, Energy, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\nVulnerabilities\nExpand All +\nCVE-2026-25655\nThe affected application permits improper modification of a configuration file by a lo","tags":["MANUFACTURING"]},{"title":"ZLAN Information Technology Co. ZLAN5143D","source":"CISA (Alerts)","date":"2026-02-10T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-02","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in an attacker bypassing authentication, or resetting the device password.\nThe following versions of ZLAN Information Technology Co. ZLAN5143D are affected:\nZLAN5143D v1.600 (CVE-2026-25084, CVE-2026-24789)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nZLAN Information Technology Co.\nZLAN Information Technology Co. ZLAN5143D\nMissing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25084\nAuthentication for the device can be bypassed by directly accessing internal URLs.\nView CVE Details\nAffected Products\nZLAN Information Technology Co. ZLAN5143D\nVendor:\nZLAN Information Technology Co.\nProduct Version:\nZLAN Information Technology Co. ZLAN5143D: v1.600\nProduct Status:\nknown_affected\nRemediations\nVendor fix\nZLAN Information Technology Co. did","tags":["MANUFACTURING"]},{"title":"APT Threat Landscape in APAC 2025: Industrialization of Intrusions","source":"Team 5","date":"2026-02-08T16:00:00.000Z","url":"https://teamt5.org/en/posts/apt-threat-landscape-in-apac-2025-industrialization-of-intrusions?utm_source=rss&utm_medium=rss","summary":"With geopolitical tensions continuing to escalate across the APAC region, APT activities in the region are intensifying in both volume and sophistication. **In 2025, TeamT5 tracked more than 510 APT operations affecting 67 countries globally, up steadily from 2024. Of these, 173 attacks targeted Taiwan, far exceeding activity levels seen in other regional targets.**\n\nOver the years, we observe Taiwan remains the most consistently and heavily targeted environment for cyber operations, with China responsible for the majority of observed activity. Taiwan’s role in geopolitical tensions and values in global technology supply chain makes it uniquely vulnerable for adversaries who seek intelligence or long-term access to achieve political and military objectives. The scale, diversity, and persistence of these campaigns position Taiwan not only as a frontline target, but also as an early-warning bellwether for the direction of China-nexus intrusion tradecraft. Campaigns observed in Taiwan fre","tags":["INDUSTRIAL"]}]},{"id":"energy","label":"Energy & Utilities","description":"Keywords: energy, grid, renewables, utilities, oil, gas, power, OT","articles":[{"title":"Honor to unveil first humanoid robot targeting consumer services","source":"Techmonitor","date":"2026-02-24T10:12:40.000Z","url":"https://www.techmonitor.ai/news/honor-to-unveil-first-humanoid-robot-targeting-consumer-services","summary":"Chinese smartphone manufacturer Honor will present its inaugural humanoid robot at the MWC Barcelona technology conference this weekend.","tags":["OT"]},{"title":"Anthropic says DeepSeek, Moonshot, and MiniMax used 24,000 fake accounts to rip off Claude","source":"Venture Beat","date":"2026-02-23T22:20:00.000Z","url":"https://venturebeat.com/technology/anthropic-says-deepseek-moonshot-and-minimax-used-24-000-fake-accounts-to","summary":"The San Francisco-based company said the three labs collectively generated more than 16 million exchanges with Claude through approximately 24,000 fake accounts,","tags":["OT"]},{"title":"Vodafone turns its network into a Europe-wide “virtual weather station”","source":"Techmonitor","date":"2026-02-23T10:23:29.000Z","url":"https://www.techmonitor.ai/news/vodafone-turns-its-network-into-a-europe-wide-virtual-weather-station","summary":"Vodafone’s existing IoT relationships and integration experience can make network-as-a-sensor technology easier to adopt.","tags":["OT"]},{"title":"Vodafone turns its network into a Europe-wide “virtual weather station”","source":"Techmonitor","date":"2026-02-23T10:23:29.000Z","url":"https://www.techmonitor.ai/comment-2/vodafone-turns-its-network-into-a-europe-wide-virtual-weather-station","summary":"Vodafone’s existing IoT relationships and integration experience can make network-as-a-sensor technology easier to adopt.","tags":["OT"]},{"title":"Ransomware Readiness is the Difference Between A Bad Day at Work and No More Workplace","source":"Security Boulevard","date":"2026-02-23T09:52:15.000Z","url":"https://securityboulevard.com/2026/02/ransomware-readiness-is-the-difference-between-a-bad-day-at-work-and-no-more-workplace/","summary":"Ransomware is now a routine business risk. True resilience comes from governance, tested incident response plans, recovery readiness, legal preparation, and trained leadership—not just security technology.","tags":["OT"]},{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["OT"]},{"title":"Applying green energy tax policies to improve cybersecurity","source":"Help Net Security","date":"2026-02-20T06:30:04.000Z","url":"https://www.helpnetsecurity.com/2026/02/20/applying-cybersecurity-tax-policies/","summary":"Tax policies and digital trust labels can strengthen cybersecurity, improve accountability, and reward secure technology development.","tags":["ENERGY"]},{"title":"Nearly 1 Million User Records Compromised in Figure Data Breach","source":"Security Week","date":"2026-02-19T13:19:08.000Z","url":"https://www.securityweek.com/nearly-1-million-user-records-compromised-in-figure-data-breach/","summary":"Nearly 1 million user records have been compromised in a data breach at blockchain-powered lender Figure Technology Solutions.","tags":["POWER"]},{"title":"EnOcean SmartServer IoT","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-01","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could allow an attacker to remotely execute arbitrary code and bypass ASLR.\nThe following versions of EnOcean SmartServer IoT are affected:\nSmartServer IoT <=4.60.009 (CVE-2026-20761, CVE-2026-22885)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 8.1\nEnOcean Edge Inc\nEnOcean SmartServer IoT\nImproper Neutralization of Special Elements used in a Command ('Command Injection'), Out-of-bounds Read\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\nVulnerabilities\nExpand All +\nCVE-2026-20761\nA vulnerability exists in EnOcean SmartServer IoT version 4.60.009 and prior, which would allow remote attackers, in the LON IP-852 management messages, to send specially crafted IP-852 messages resulting in arbitrary OS command execution on the device.\nView CVE Details\nAffected Products\nEnOcean SmartServer IoT\nVendor:\nEnOcean Edge Inc\nProdu","tags":["OT"]},{"title":"Jinan USR IOT Technology Limited (PUSR) USR-W610","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials.\nThe following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected:\nUSR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nJinan USR IOT Technology Limited (PUSR)\nJinan USR IOT Technology Limited (PUSR) USR-W610\nWeak Password Requirements, Cleartext Transmission of Sensitive Information, Insufficiently Protected Credentials, Missing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25715\nThe web management interface of the device allows the administrator username and password to be set to blank va","tags":["OT"]},{"title":"AI Has Entered Schools—But What About Its Responsible Use?","source":"The Cyber Express","date":"2026-02-19T08:13:36.000Z","url":"https://thecyberexpress.com/ai-in-education-shaping-classrooms-of-tomorrow/","summary":"As global leaders emphasized, AI in education is not just about technology—it is about people, pedagogy, and trust.","tags":["OT"]},{"title":"Red Flags for OT Abound in Dragos Review of 2025","source":"Inforisk","date":"2026-02-19T00:00:00.000Z","url":"https://www.inforisktoday.com/red-flags-for-ot-abound-in-dragos-review-2025-a-30809","summary":"There is a silent epidemic of ransomware attacks on commercial operational technology systems, which are mischaracterized as IT incidents even though they impact","tags":["OT"]},{"title":"Figure Breach Enters New Phase After Data Leak Claims","source":"Security Boulevard","date":"2026-02-18T21:53:41.000Z","url":"https://securityboulevard.com/2026/02/figure-breach-enters-new-phase-after-data-leak-claims/","summary":"The data breach disclosed by fintech lender Figure Technology Solutions is moving beyond a contained security incident, as reports that stolen customer information is circulating online coincide with early legal investigations. The developments mark the point where an internal breach begins to create broader consumer risk and potential liability. Latest Developments Data associated with the The post Figure Breach Enters New Phase After Data Leak Claims appeared first on Centraleyes.","tags":["OT"]},{"title":"Securing our Critical Infrastructure with Zero Trust","source":"Security Boulevard","date":"2026-02-18T15:00:10.000Z","url":"https://securityboulevard.com/2026/02/securing-our-critical-infrastructure-with-zero-trust/","summary":"We are seeing a steady rise in cyberattacks against critical infrastructure and it’s not surprising. Many of these systems rely on legacy software riddled with known vulnerabilities. When these systems fail, the impact moves quickly from networks to operations, and from operations to public safety. There is still a dangerous misconception that operational technology (OT) The post Securing our Critical Infrastructure with Zero Trust appeared first on ColorTokens.","tags":["OT"]},{"title":"Why technology revolutions spark unexpected consequences [Q&A]","source":"Beta News","date":"2026-02-18T09:50:04.000Z","url":"https://betanews.com/article/why-technology-revolutions-spark-unexpected-consequences-qa/","summary":"The current technology revolution -- a culmination of computing power, global networks, and learning algorithms -- is remaking our world in real time. We spoke to Jamie Dobson, the founder of digital services company Container Solutions and author of Visionaries, Rebels and Machines: The story of humanity’s extraordinary journey from electrification to cloudification to discuss the unexpected consequences of technological progress. BN: Of all the technologies available to us, Artificial Intelligence is the current headline act, and it’s becoming an increasingly important part of modern life, but it’s not welcomed by everyone. Do they have a point? JD: What we… [Continue Reading]","tags":["POWER","OT"]},{"title":"Most VMware users still \"actively reducing their VMware footprint,\" survey finds","source":"Ars Technica","date":"2026-02-17T18:38:10.000Z","url":"https://arstechnica.com/information-technology/2026/02/most-vmware-users-still-actively-reducing-their-vmware-footprint-survey-finds/","summary":"Broadcom's \"strategy was never to keep every customer,\" CloudBolt report says.","tags":["OT"]},{"title":"Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety","source":"Security Boulevard","date":"2026-02-17T12:16:00.000Z","url":"https://securityboulevard.com/2026/02/ahead-of-the-curve-hickman-county-school-districts-proactive-approach-to-student-safety/","summary":"How Cloud Monitor provides long-term value and consistent student protection in Google Workspace In Centerville, Tennessee, Hickman County School District serves approximately 2,500 students across nine schools with a small but highly capable technology team. Leading that effort is Brad Gilbert, Director of Technology, a forward-thinking IT leader who has long recognized that student safety ... The post Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety appeared first on ManagedMethods Cybersecurity, Safety & Compliance for K-12.","tags":["OT"]},{"title":"‘They are able to move fast now’: AI is expanding attack surfaces – and hackers are looking to reap the same rewards as enterprises with the technology","source":"IT Pro","date":"2026-02-16T12:12:02.000Z","url":"https://www.itpro.com/security/they-are-able-to-move-fast-now-ai-is-expanding-attack-surfaces-and-hackers-are-looking-to-reap-the-same-rewards-as-enterprises-with-the-technology","summary":"Potent new malware strains, faster attack times, and the rise of shadow AI are causing havoc","tags":["OT"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["OT"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"Security Boulevard","date":"2026-02-13T08:11:25.000Z","url":"https://securityboulevard.com/2026/02/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related The post Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group appeared first on NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks..","tags":["OT"]},{"title":"Kettering Adventist Health now notifying patients affected by May 2025 ransomware attack","source":"Databreaches.net","date":"2026-02-12T17:57:01.000Z","url":"https://databreaches.net/2026/02/12/kettering-adventist-health-now-notifying-patients-affected-by-may-2025-ransomware-attack/?pk_campaign=feed&pk_kwd=kettering-adventist-health-now-notifying-patients-affected-by-may-2025-ransomware-attack","summary":"On May 20, 2025, CNN reported that a ransomware attack had triggered a \"system-wide technology outage\" at Kettering Adventist Health in Ohio. Disclosures by Ket","tags":["OT"]},{"title":"FTC push for age verification a ‘major landmark’ for spread of the tool","source":"The Record","date":"2026-02-12T16:41:35.000Z","url":"https://therecord.media/ftc-push-for-age-verification-a-major-landmark-for-implementation","summary":"The FTC's COPPA rule should not be an “impediment to the most child protective technology to emerge in decades,” a senior agency official said recently.","tags":["OT"]},{"title":"3D Printer Surveillance","source":"Schneier on Security","date":"2026-02-12T12:01:31.000Z","url":"https://www.schneier.com/blog/archives/2026/02/3d-printer-surveillance.html","summary":"New York is contemplating a bill that adds surveillance to 3D printers: New York’s 2026­2027 executive budget bill (S.9005 / A.10005) includes language that should alarm every maker, educator, and small manufacturer in the state. Buried in Part C is a provision requiring all 3D printers sold or delivered in New York to include “blocking technology.” This is defined as software or firmware that scans every print file through a “firearms blueprint detection algorithm” and refuses to print anything it flags as a potential firearm or firearm component...","tags":["OT"]},{"title":"Siemens SINEC NMS","source":"CISA (Alerts)","date":"2026-02-12T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-01","summary":"View CSAF\nSummary\nMultiple Siemens products are affected by two local privilege escalation vulnerabilities which could allow an low privileged attacker to load malicious DLLs, potentially leading to arbitrary code execution with elevated privileges. Siemens has released new versions for the affected products and recommends to update to the latest versions.\nThe following versions of Siemens SINEC NMS are affected:\nSINEC NMS: Versions prior to V4.0 SP2 (CVE-2026-25655)\nSINEC NMS: All Versions (CVE-2026-25656)\nUser Management Component (UMC) vers:intdot/<2.15.2.1 (CVE-2026-25656)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 7.8\nSiemens\nSiemens SINEC NMS\nUncontrolled Search Path Element\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology, Energy, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\nVulnerabilities\nExpand All +\nCVE-2026-25655\nThe affected application permits improper modification of a configuration file by a lo","tags":["ENERGY","OT"]},{"title":"CVE-2026-25875 | Praskla-Technology assessment-placipy 1.0.0 JWT authorization (GHSA-mx95-8ppg-v574)","source":"Vuldb (Updates)","date":"2026-02-12T10:08:59.000Z","url":"https://vuldb.com/?id.345075","summary":"A vulnerability, which was classified as critical, was found in Praskla-Technology assessment-placipy 1.0.0. This issue affects some unknown processing of the component JWT Handler. Such manipulation leads to incorrect authorization.\n\nThis vulnerability is traded as CVE-2026-25875. The attack may be launched remotely. There is no exploit available.","tags":["OT"]},{"title":"The FBI Recovered “Deleted” Nest Cam Footage — Here’s Why Every CISO Should Panic","source":"Security Boulevard","date":"2026-02-12T09:02:29.000Z","url":"https://securityboulevard.com/2026/02/the-fbi-recovered-deleted-nest-cam-footage-heres-why-every-ciso-should-panic/","summary":"The Nancy Guthrie case has raised serious concerns about data retention in cloud technology and IoT devices. After a Google Nest camera captured footage of a suspect at her home, investigators were able to recover this footage, despite the absence of an active subscription that would typically lead to automatic deletion. This highlights a critical issue: data marked for deletion may still exist and be recoverable, posing risks for organizations relying on cloud vendors. As cybersecurity professionals, we must advocate for stronger data management practices and transparency. Let's audit our vendor contracts and ensure we implement robust cybersecurity measures. 🛡️💻 #Cybersecurity #DataPrivacy #IoT #CloudTechnology","tags":["OT"]},{"title":"CVE-2026-25810 | Praskla-Technology assessment-placipy 1.0.0 student.submission.routes.ts authorization (GHSA-2gqv-gxrj-p8x3)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345057","summary":"A vulnerability described as critical has been identified in Praskla-Technology assessment-placipy 1.0.0. This affects an unknown function of the file backend/src/routes/student.submission.routes.ts. Such manipulation leads to missing authorization.\n\nThis vulnerability is documented as CVE-2026-25810. The attack can be executed remotely. There is not any exploit available.","tags":["OT"]},{"title":"CVE-2026-25806 | Praskla-Technology assessment-placipy 1.0.0 student.routes.ts authorization (GHSA-99gr-8933-3vwj)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345052","summary":"A vulnerability was found in Praskla-Technology assessment-placipy 1.0.0. It has been rated as critical. This vulnerability affects unknown code of the file backend/src/routes/student.routes.ts. Performing a manipulation results in missing authorization.\n\nThis vulnerability is identified as CVE-2026-25806. The attack can be initiated remotely. There is not any exploit available.","tags":["OT"]},{"title":"CVE-2026-25876 | Praskla-Technology assessment-placipy 1.0.0 results.routes.ts authorization (GHSA-w238-w4mg-j357)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345060","summary":"A vulnerability, which was classified as critical, has been found in Praskla-Technology assessment-placipy 1.0.0. Affected by this vulnerability is an unknown functionality of the file backend/src/routes/results.routes.ts. The manipulation leads to missing authorization.\n\nThis vulnerability is traded as CVE-2026-25876. It is possible to initiate the attack remotely. There is no exploit available.","tags":["OT"]},{"title":"CVE-2026-25753 | Praskla-Technology assessment-placipy up to 1.0.0 hard-coded password (GHSA-6537-cf56-j9w2)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.344738","summary":"A vulnerability, which was classified as critical, has been found in Praskla-Technology assessment-placipy up to 1.0.0. This affects an unknown function. This manipulation causes use of hard-coded password.\n\nThis vulnerability is tracked as CVE-2026-25753. The attack is possible to be carried out remotely. No exploit exists.","tags":["OT"]},{"title":"CVE-2026-25809 | Praskla-Technology assessment-placipy 1.0.0 Code Evaluation Endpoint improper authorization (GHSA-cc32-rp29-w9x7)","source":"Vuldb (Updates)","date":"2026-02-12T07:47:13.000Z","url":"https://vuldb.com/?id.345068","summary":"A vulnerability identified as critical has been detected in Praskla-Technology assessment-placipy 1.0.0. This affects an unknown function of the component Code Evaluation Endpoint. This manipulation causes improper authorization.\n\nThis vulnerability is tracked as CVE-2026-25809. The attack is possible to be carried out remotely. No exploit exists.","tags":["OT"]},{"title":"OpenAI researcher quits over ChatGPT ads, warns of \"Facebook\" path","source":"Ars Technica","date":"2026-02-11T20:44:19.000Z","url":"https://arstechnica.com/information-technology/2026/02/openai-researcher-quits-over-fears-that-chatgpt-ads-could-manipulate-users/","summary":"Zoë Hitzig resigned on the same day OpenAI began testing ads in its chatbot.","tags":["OT"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:55:25.000Z","url":"https://arcticwolf.com/resources/glossary-uk/virtual-private-network/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["OT"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:37:15.000Z","url":"https://arcticwolf.com/resources/glossary/virtual-private-network-vpn/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["OT"]},{"title":"CVE-2025-6967 | Sarman CMS up to 10022026 Technology Service redirect","source":"Vuldb","date":"2026-02-10T14:30:39.000Z","url":"https://vuldb.com/?id.345195","summary":"A vulnerability labeled as critical has been found in Sarman CMS up to 10022026. This vulnerability affects unknown code of the component Technology Service. Such manipulation leads to execution after redirect.\n\nThis vulnerability is traded as CVE-2025-6967. The attack may be launched remotely. There is no exploit available.","tags":["OT"]},{"title":"DPRK IT Workers Impersonating Individuals Using Real LinkedIn Accounts to Apply for Remote Roles","source":"Cyber Security News","date":"2026-02-10T04:02:10.000Z","url":"https://cybersecuritynews.com/dprk-it-workers-impersonating-individuals/","summary":"The landscape of remote employment faces a persistent and evolving challenge as North Korean operatives refine their strategies to infiltrate global organizations. For years, these actors have sought remote information technology roles to generate revenue for the regime, often relying on fabricated identities. However, a significant shift in their methodology has recently surfaced, complicating the […]\nThe post DPRK IT Workers Impersonating Individuals Using Real LinkedIn Accounts to Apply for Remote Roles appeared first on Cyber Security News.","tags":["OT"]},{"title":"Why Banks Need AI-Driven Segmentation Against Ransomware","source":"Inforisk","date":"2026-02-10T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/banks-need-ai-driven-segmentation-against-ransomware-i-5524","summary":"AI-powered ransomware compresses attacks from weeks to minutes. Michael Villar, director of field security technology at Akamai, says banks need AI-driven","tags":["POWER"]},{"title":"9th February – Threat Intelligence Report","source":"Checkpoint Research","date":"2026-02-09T12:50:16.000Z","url":"https://research.checkpoint.com/2026/9th-february-threat-intelligence-report/","summary":"For the latest discoveries in cyber research for the week of 9th February, please download our Threat Intelligence Bulletin. TOP ATTACKS AND BREACHES Romania’s national oil pipeline operator, Conpet, has suffered a cyberattack that disrupted its IT systems and took its website offline. The company said operational technology, including pipeline control and telecommunications systems, remained […]","tags":["OIL"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["POWER"]},{"title":"APT Threat Landscape in APAC 2025: Industrialization of Intrusions","source":"Team 5","date":"2026-02-08T16:00:00.000Z","url":"https://teamt5.org/en/posts/apt-threat-landscape-in-apac-2025-industrialization-of-intrusions?utm_source=rss&utm_medium=rss","summary":"With geopolitical tensions continuing to escalate across the APAC region, APT activities in the region are intensifying in both volume and sophistication. **In 2025, TeamT5 tracked more than 510 APT operations affecting 67 countries globally, up steadily from 2024. Of these, 173 attacks targeted Taiwan, far exceeding activity levels seen in other regional targets.**\n\nOver the years, we observe Taiwan remains the most consistently and heavily targeted environment for cyber operations, with China responsible for the majority of observed activity. Taiwan’s role in geopolitical tensions and values in global technology supply chain makes it uniquely vulnerable for adversaries who seek intelligence or long-term access to achieve political and military objectives. The scale, diversity, and persistence of these campaigns position Taiwan not only as a frontline target, but also as an early-warning bellwether for the direction of China-nexus intrusion tradecraft. Campaigns observed in Taiwan fre","tags":["OT"]},{"title":"Romania’s oil pipeline operator confirms cyberattack as hackers claim data theft","source":"Databreaches.net","date":"2026-02-08T15:09:19.000Z","url":"https://databreaches.net/2026/02/08/romanias-oil-pipeline-operator-confirms-cyberattack-as-hackers-claim-data-theft/?pk_campaign=feed&pk_kwd=romanias-oil-pipeline-operator-confirms-cyberattack-as-hackers-claim-data-theft","summary":"Daryna Antoniuk reports: Romania’s national oil pipeline operator Conpet said a cyberattack disrupted parts of its technology infrastructure and knocked its web","tags":["OIL"]},{"title":"Romania’s oil pipeline operator confirms cyberattack as hackers claim data theft","source":"The Record","date":"2026-02-06T11:55:20.000Z","url":"https://therecord.media/romania-conpet-oil-pipeline-ransomware-attack","summary":"Romania’s national oil pipeline operator Conpet said a cyberattack disrupted parts of its technology infrastructure and knocked its website offline earlier this week, adding that oil transport operations were not affected.","tags":["OIL","OT"]},{"title":"AI companies want you to stop chatting with bots and start managing them","source":"Ars Technica","date":"2026-02-05T22:47:54.000Z","url":"https://arstechnica.com/information-technology/2026/02/ai-companies-want-you-to-stop-chatting-with-bots-and-start-managing-them/","summary":"Claude Opus 4.6 and OpenAI Frontier pitch a future of supervising AI agents.","tags":["OT"]},{"title":"Field Effect Issued New U.S. Patent for AROs","source":"Field Effect","date":"2026-02-05T15:25:50.000Z","url":"https://fieldeffect.com/blog/field-effect-u.s.-patent-actionable-cybersecurity-alerting-technology","summary":"Field Effect announces new patent protecting the technology behind its Action, Recommendation, and Observation (ARO) framework for cybersecurity alerting.","tags":["OT"]},{"title":"ScotlandIs Digital Technology Awards","source":"Arctic Wolf","date":"2026-02-05T11:22:27.000Z","url":"https://arcticwolf.com/resources/upcoming-events-and-webinars-uk/scotlandis-digital-technology-awards/","summary":"","tags":["OT"]},{"title":"MomentProof Deploys Patented Digital Asset Protection","source":"Cyber Security News","date":"2026-02-04T15:49:08.000Z","url":"https://cybersecuritynews.com/momentproof-digital-asset-protection/","summary":"MomentProof introduces patented technology to secure digital assets with stronger protection, verification, and fraud prevention.","tags":["OT"]},{"title":"OT attacks surge as threat actors embrace cloud and AI, warns Forescout","source":"IT Security Guru","date":"2026-02-04T14:42:41.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout/?utm_source=rss&utm_medium=rss&utm_campaign=ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout","summary":"Cyberattacks targeting operational technology (OT) environments rose sharply in 2025, according to new research from Forescout, highlighting growing risks to critical infrastructure as attackers adapt to cloud services, AI platforms and increasingly distributed attack infrastructure. Forescout’s 2025 Threat Roundup Report, produced by its research arm Vedere Labs, analysed more than 900 million cyberattacks observed globally […]\nThe post OT attacks surge as threat actors embrace cloud and AI, warns Forescout appeared first on IT Security Guru.","tags":["OT"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["OT"]}]},{"id":"finance","label":"Banking & Finance","description":"Keywords: finance, banking, fintech, investment, cryptocurrency, SEC, wire fraud","articles":[{"title":"Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","source":"Arctic Wolf","date":"2026-02-23T16:59:22.000Z","url":"https://arcticwolf.com/resources/press-releases/arctic-wolf-acquires-exposure-assessment-platform-visionary-sevco-security/","summary":"Acquisition to strengthen proactive security by adding next-generation asset intelligence and exposure assessment to the Aurora Platform EDEN PRAIRIE, Minn. – February 23, 2026 – Arctic Wolf®, a global leader in security operations, today announced it has acquired Sevco Security, an innovator in exposure assessment platforms. Sevco’s cloud-native technology will operate on the Arctic Wolf ... Arctic Wolf Acquires Exposure Assessment Platform Visionary Sevco Security","tags":["SEC"]},{"title":"Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","source":"Arctic Wolf","date":"2026-02-23T16:59:04.000Z","url":"https://arcticwolf.com/resources/blog/welcoming-sevco-security-expanding-the-aurora-platform-with-visionary-exposure-management/","summary":"By Dan Schiappa, President, Technology and Services, Arctic Wolf Security operations is undergoing a fundamental shift. For years, organizations have focused primarily on detecting and responding to threats after they occur. But as attack surfaces expand across endpoints, cloud, identity, SaaS, and infrastructure, that reactive model is no longer enough. Security teams are increasingly being ... Welcoming Sevco Security: Expanding the Aurora Platform with Visionary Exposure Management","tags":["SEC"]},{"title":"Ransomware Readiness is the Difference Between A Bad Day at Work and No More Workplace","source":"Security Boulevard","date":"2026-02-23T09:52:15.000Z","url":"https://securityboulevard.com/2026/02/ransomware-readiness-is-the-difference-between-a-bad-day-at-work-and-no-more-workplace/","summary":"Ransomware is now a routine business risk. True resilience comes from governance, tested incident response plans, recovery readiness, legal preparation, and trained leadership—not just security technology.","tags":["SEC"]},{"title":"The Danger of IT, OT, Medical Device Cyber Turf Wars","source":"Inforisk","date":"2026-02-23T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/danger-it-ot-medical-device-cyber-turf-wars-i-5526","summary":"What often appears to be turf wars between healthcare technology management, facilities OT staff, IT departments and security teams are often the result of unclear","tags":["SEC"]},{"title":"NDSS 2025 -DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing","source":"Security Boulevard","date":"2026-02-21T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-dumpling-fine-grained-differential-javascript-engine-fuzzing/","summary":"Session 13A: JavaScript Security  Authors, Creators & Presenters: Liam Wachter (EPFL), Julian Gremminger (EPFL), Christian Wressnegger (Karlsruhe Institute of Technology (KIT)), Mathias Payer (EPFL), Flavio Toffalini (EPFL) PAPER DUMPLING: Fine-Grained Differential JavaScript Engine Fuzzing Web browsers are ubiquitous and execute untrusted JavaScript (JS) code. JS engines optimize frequently executed code through just-in-time (JIT) compilation. Subtly conflicting assumptions between optimizations frequently result in JS engine vulnerabilities. Attackers can take advantage of such diverging assumptions and use the flexibility of JS to craft exploits that produce a miscalculation, remove bounds checks in JIT compiled code, and ultimately gain arbitrary code execution. Classical fuzzing approaches for JS engines only detect bugs if the engine crashes or a runtime assertion fails. Differential fuzzing can compare interpreted code against optimized JIT compiled code to detect differences in","tags":["SEC"]},{"title":"Loan applications, drivers licences, personal data of 440k Aussies exposed after hacker hits Sydney finance tech company youX","source":"Databreaches","date":"2026-02-20T13:20:13.000Z","url":"https://databreaches.net/2026/02/20/loan-applications-drivers-licences-personal-data-of-440k-aussies-exposed-after-hacker-hits-sydney-finance-tech-company-youx/?pk_campaign=feed&pk_kwd=loan-applications-drivers-licences-personal-data-of-440k-aussies-exposed-after-hacker-hits-sydney-finance-tech-company-youx","summary":"Emma Kirk reports: A hacker has exposed personal data belonging to hundreds of thousands of Australians it allegedly stole from a Sydney finance technology comp","tags":["FINANCE"]},{"title":"Applying green energy tax policies to improve cybersecurity","source":"Help Net Security","date":"2026-02-20T06:30:04.000Z","url":"https://www.helpnetsecurity.com/2026/02/20/applying-cybersecurity-tax-policies/","summary":"Tax policies and digital trust labels can strengthen cybersecurity, improve accountability, and reward secure technology development.","tags":["SEC"]},{"title":"Building Application Security from the Ground Up: An Organizational Approach","source":"Orca Security","date":"2026-02-19T13:50:00.000Z","url":"https://orca.security/resources/blog/building-application-security-from-the-ground-up/","summary":"Learn why technology alone can't fix security. Discover a proven framework for building an application security program to stop vulnerabilities at the source.","tags":["SEC"]},{"title":"EnOcean SmartServer IoT","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-01","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could allow an attacker to remotely execute arbitrary code and bypass ASLR.\nThe following versions of EnOcean SmartServer IoT are affected:\nSmartServer IoT <=4.60.009 (CVE-2026-20761, CVE-2026-22885)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 8.1\nEnOcean Edge Inc\nEnOcean SmartServer IoT\nImproper Neutralization of Special Elements used in a Command ('Command Injection'), Out-of-bounds Read\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\nVulnerabilities\nExpand All +\nCVE-2026-20761\nA vulnerability exists in EnOcean SmartServer IoT version 4.60.009 and prior, which would allow remote attackers, in the LON IP-852 management messages, to send specially crafted IP-852 messages resulting in arbitrary OS command execution on the device.\nView CVE Details\nAffected Products\nEnOcean SmartServer IoT\nVendor:\nEnOcean Edge Inc\nProdu","tags":["SEC"]},{"title":"Jinan USR IOT Technology Limited (PUSR) USR-W610","source":"CISA (Alerts)","date":"2026-02-19T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials.\nThe following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected:\nUSR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nJinan USR IOT Technology Limited (PUSR)\nJinan USR IOT Technology Limited (PUSR) USR-W610\nWeak Password Requirements, Cleartext Transmission of Sensitive Information, Insufficiently Protected Credentials, Missing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25715\nThe web management interface of the device allows the administrator username and password to be set to blank va","tags":["SEC"]},{"title":"Figure Breach Enters New Phase After Data Leak Claims","source":"Security Boulevard","date":"2026-02-18T21:53:41.000Z","url":"https://securityboulevard.com/2026/02/figure-breach-enters-new-phase-after-data-leak-claims/","summary":"The data breach disclosed by fintech lender Figure Technology Solutions is moving beyond a contained security incident, as reports that stolen customer information is circulating online coincide with early legal investigations. The developments mark the point where an internal breach begins to create broader consumer risk and potential liability. Latest Developments Data associated with the The post Figure Breach Enters New Phase After Data Leak Claims appeared first on Centraleyes.","tags":["FINTECH","SEC"]},{"title":"Securing our Critical Infrastructure with Zero Trust","source":"Security Boulevard","date":"2026-02-18T15:00:10.000Z","url":"https://securityboulevard.com/2026/02/securing-our-critical-infrastructure-with-zero-trust/","summary":"We are seeing a steady rise in cyberattacks against critical infrastructure and it’s not surprising. Many of these systems rely on legacy software riddled with known vulnerabilities. When these systems fail, the impact moves quickly from networks to operations, and from operations to public safety. There is still a dangerous misconception that operational technology (OT) The post Securing our Critical Infrastructure with Zero Trust appeared first on ColorTokens.","tags":["SEC"]},{"title":"Data breach at fintech firm Figure affects nearly 1 million accounts","source":"Bleeping Computer","date":"2026-02-18T14:01:08.000Z","url":"https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/","summary":"Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company.","tags":["FINTECH"]},{"title":"Will Your Organization Take the Quantum Leap in 2026? Read This First","source":"Security Boulevard","date":"2026-02-18T10:20:54.000Z","url":"https://securityboulevard.com/2026/02/will-your-organization-take-the-quantum-leap-in-2026-read-this-first/","summary":"Explore how organizations can prepare for the quantum age by developing quantum security intelligence, establishing governance plans, and prioritizing system updates. Learn strategies for building resilience without exorbitant investments as quantum computing technology advances","tags":["INVESTMENT","SEC"]},{"title":"Koi Purchase Bolsters Palo Alto's AI Attack Surface Defense","source":"Inforisk","date":"2026-02-18T00:00:00.000Z","url":"https://www.inforisktoday.com/koi-purchase-bolsters-palo-altos-ai-attack-surface-defense-a-30789","summary":"Palo Alto Networks plans to acquire Koi Security for $300 million to address growing AI-driven endpoint risks. The startup's technology adds deep visibility into AI","tags":["SEC"]},{"title":"Data-only extortion grows as ransomware gangs seek better profits","source":"Cybersecurity Dive","date":"2026-02-17T15:31:42.000Z","url":"https://www.cybersecuritydive.com/news/ransomware-extortion-bec-arctic-wolf/812321/","summary":"Businesses should prioritize securing one type of technology in particular, the security firm Arctic Wolf said in a new report.","tags":["SEC"]},{"title":"Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety","source":"Security Boulevard","date":"2026-02-17T12:16:00.000Z","url":"https://securityboulevard.com/2026/02/ahead-of-the-curve-hickman-county-school-districts-proactive-approach-to-student-safety/","summary":"How Cloud Monitor provides long-term value and consistent student protection in Google Workspace In Centerville, Tennessee, Hickman County School District serves approximately 2,500 students across nine schools with a small but highly capable technology team. Leading that effort is Brad Gilbert, Director of Technology, a forward-thinking IT leader who has long recognized that student safety ... The post Ahead of the Curve: Hickman County School District’s Proactive Approach to Student Safety appeared first on ManagedMethods Cybersecurity, Safety & Compliance for K-12.","tags":["SEC"]},{"title":"New threat actor UAT-9921 deploys VoidLink against enterprise sectors","source":"Security Affairs","date":"2026-02-13T22:18:18.000Z","url":"https://securityaffairs.com/187969/ai/new-threat-actor-uat-9921-deploys-voidlink-against-enterprise-sectors.html","summary":"A new threat actor, UAT-9921, uses the modular VoidLink framework to target technology and financial organizations, Cisco Talos reports.","tags":["SEC"]},{"title":"NDSS 2025 – Density Boosts Everything","source":"Security Boulevard","date":"2026-02-13T16:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-density-boosts-everything/","summary":"Session 12B: Malware  Authors, Creators & Presenters: Jianwen Tian (Academy of Military Sciences), Wei Kong (Zhejiang Sci-Tech University), Debin Gao (Singapore Management University), Tong Wang (Academy of Military Sciences), Taotao Gu (Academy of Military Sciences), Kefan Qiu (Beijing Institute of Technology), Zhi Wang (Nankai University), Xiaohui Kuang (Academy of Military Sciences) PAPER Density Boosts Everything: A One-stop Strategy For Improving Performance, Robustness, And Sustainability of Malware Detectors In the contemporary landscape of cybersecurity, AI-driven detectors have emerged as pivotal in the realm of malware detection. However, existing AI-driven detectors encounter a myriad of challenges, including poisoning attacks, evasion attacks, and concept drift, which stem from the inherent characteristics of AI methodologies. While numerous solutions have been proposed to address these issues, they often concentrate on isolated problems, neglecting the broader implications","tags":["SEC"]},{"title":"UAT-9921 Deploys VoidLink Malware to Target Technology and Financial Sectors","source":"The Hackers News","date":"2026-02-13T15:23:00.000Z","url":"https://thehackernews.com/2026/02/uat-9921-deploys-voidlink-malware-to.html","summary":"Cisco Talos links UAT-9921 to VoidLink, a modular Zig-based malware targeting Linux cloud systems with stealth plugins and C2 control.","tags":["SEC"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"NSFOCUS","date":"2026-02-13T08:11:25.000Z","url":"https://nsfocusglobal.com/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related […]","tags":["SEC"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"Security Boulevard","date":"2026-02-13T08:11:25.000Z","url":"https://securityboulevard.com/2026/02/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related The post Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group appeared first on NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks..","tags":["SEC"]},{"title":"Siemens SINEC NMS","source":"CISA (Alerts)","date":"2026-02-12T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-01","summary":"View CSAF\nSummary\nMultiple Siemens products are affected by two local privilege escalation vulnerabilities which could allow an low privileged attacker to load malicious DLLs, potentially leading to arbitrary code execution with elevated privileges. Siemens has released new versions for the affected products and recommends to update to the latest versions.\nThe following versions of Siemens SINEC NMS are affected:\nSINEC NMS: Versions prior to V4.0 SP2 (CVE-2026-25655)\nSINEC NMS: All Versions (CVE-2026-25656)\nUser Management Component (UMC) vers:intdot/<2.15.2.1 (CVE-2026-25656)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 7.8\nSiemens\nSiemens SINEC NMS\nUncontrolled Search Path Element\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Information Technology, Energy, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\nVulnerabilities\nExpand All +\nCVE-2026-25655\nThe affected application permits improper modification of a configuration file by a lo","tags":["SEC"]},{"title":"The FBI Recovered “Deleted” Nest Cam Footage — Here’s Why Every CISO Should Panic","source":"Security Boulevard","date":"2026-02-12T09:02:29.000Z","url":"https://securityboulevard.com/2026/02/the-fbi-recovered-deleted-nest-cam-footage-heres-why-every-ciso-should-panic/","summary":"The Nancy Guthrie case has raised serious concerns about data retention in cloud technology and IoT devices. After a Google Nest camera captured footage of a suspect at her home, investigators were able to recover this footage, despite the absence of an active subscription that would typically lead to automatic deletion. This highlights a critical issue: data marked for deletion may still exist and be recoverable, posing risks for organizations relying on cloud vendors. As cybersecurity professionals, we must advocate for stronger data management practices and transparency. Let's audit our vendor contracts and ensure we implement robust cybersecurity measures. 🛡️💻 #Cybersecurity #DataPrivacy #IoT #CloudTechnology","tags":["SEC"]},{"title":"State of Security Report | Recorded Future","source":"Recorded Future","date":"2026-02-12T00:00:00.000Z","url":"https://www.recordedfuture.com/research/state-of-security","summary":"Download Recorded Future's 2026 State of Security report which provides comprehensive threat intelligence on geopolitical fragmentation, state-sponsored operations, ransomware evolution, and emerging technology risk.","tags":["SEC"]},{"title":"What elements ensure stability in NHI Lifecycle Management","source":"Security Boulevard","date":"2026-02-11T22:00:00.000Z","url":"https://securityboulevard.com/2026/02/what-elements-ensure-stability-in-nhi-lifecycle-management/","summary":"How Can Organizations Achieve Stability Through NHI Lifecycle Management? How can organizations secure their digital infrastructures effectively? Managing Non-Human Identities (NHIs) presents a formidable challenge, when they necessitate a nuanced approach that addresses every stage of their lifecycle. With technology advances, these machine identities become critical components in safeguarding sensitive data and maintaining robust cybersecurity The post What elements ensure stability in NHI Lifecycle Management appeared first on Entro.","tags":["SEC"]},{"title":"Google-Intel Security Audit Reveals Severe TDX Vulnerability Allowing Full Compromise","source":"Security Week","date":"2026-02-11T08:41:31.000Z","url":"https://www.securityweek.com/google-intel-security-audit-reveals-severe-tdx-vulnerability-allowing-full-compromise/","summary":"Intel has partnered with Google to conduct a security review of its TDX technology, which led to the discovery of 5 vulnerabilities.","tags":["SEC"]},{"title":"ZLAN Information Technology Co. ZLAN5143D","source":"CISA (Alerts)","date":"2026-02-10T12:00:00.000Z","url":"https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-02","summary":"View CSAF\nSummary\nSuccessful exploitation of these vulnerabilities could result in an attacker bypassing authentication, or resetting the device password.\nThe following versions of ZLAN Information Technology Co. ZLAN5143D are affected:\nZLAN5143D v1.600 (CVE-2026-25084, CVE-2026-24789)\nCVSS\nVendor\nEquipment\nVulnerabilities\n\n\n\n\nv3 9.8\nZLAN Information Technology Co.\nZLAN Information Technology Co. ZLAN5143D\nMissing Authentication for Critical Function\n\n\n\n\nBackground\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\nVulnerabilities\nExpand All +\nCVE-2026-25084\nAuthentication for the device can be bypassed by directly accessing internal URLs.\nView CVE Details\nAffected Products\nZLAN Information Technology Co. ZLAN5143D\nVendor:\nZLAN Information Technology Co.\nProduct Version:\nZLAN Information Technology Co. ZLAN5143D: v1.600\nProduct Status:\nknown_affected\nRemediations\nVendor fix\nZLAN Information Technology Co. did","tags":["SEC"]},{"title":"DPRK IT Workers Impersonating Individuals Using Real LinkedIn Accounts to Apply for Remote Roles","source":"Cyber Security News","date":"2026-02-10T04:02:10.000Z","url":"https://cybersecuritynews.com/dprk-it-workers-impersonating-individuals/","summary":"The landscape of remote employment faces a persistent and evolving challenge as North Korean operatives refine their strategies to infiltrate global organizations. For years, these actors have sought remote information technology roles to generate revenue for the regime, often relying on fabricated identities. However, a significant shift in their methodology has recently surfaced, complicating the […]\nThe post DPRK IT Workers Impersonating Individuals Using Real LinkedIn Accounts to Apply for Remote Roles appeared first on Cyber Security News.","tags":["SEC"]},{"title":"Why Banks Need AI-Driven Segmentation Against Ransomware","source":"Inforisk","date":"2026-02-10T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/banks-need-ai-driven-segmentation-against-ransomware-i-5524","summary":"AI-powered ransomware compresses attacks from weeks to minutes. Michael Villar, director of field security technology at Akamai, says banks need AI-driven","tags":["SEC"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["SEC"]},{"title":"Transparent Tribe Hacker Group Attacking India’s Startup Ecosystem","source":"Cyber Security News","date":"2026-02-06T19:46:29.000Z","url":"https://cybersecuritynews.com/transparent-tribe-hacker-group/","summary":"The threat landscape for India’s technology sector has taken an unexpected turn. A Pakistan-based hacking group called Transparent Tribe has shifted its focus from traditional government targets to the country’s vibrant startup ecosystem, particularly companies working in cybersecurity and intelligence domains. The group, also tracked as APT36, has been active since 2013 and now uses […]\nThe post Transparent Tribe Hacker Group Attacking India’s Startup Ecosystem appeared first on Cyber Security News.","tags":["SEC"]},{"title":"EU Envisions Military Data Sharing Sans US Tech","source":"Inforisk","date":"2026-02-06T00:00:00.000Z","url":"https://www.inforisktoday.com/eu-envisions-military-data-sharing-sans-us-tech-a-30707","summary":"Europe is quietly planning to set up a secure military data-sharing platform - without U.S.-made technology. Discussions about the need for more European tech","tags":["SEC"]},{"title":"Field Effect Issued New U.S. Patent for AROs","source":"Field Effect","date":"2026-02-05T15:25:50.000Z","url":"https://fieldeffect.com/blog/field-effect-u.s.-patent-actionable-cybersecurity-alerting-technology","summary":"Field Effect announces new patent protecting the technology behind its Action, Recommendation, and Observation (ARO) framework for cybersecurity alerting.","tags":["SEC"]},{"title":"MomentProof Deploys Patented Digital Asset Protection","source":"Cyber Security News","date":"2026-02-04T15:49:08.000Z","url":"https://cybersecuritynews.com/momentproof-digital-asset-protection/","summary":"MomentProof introduces patented technology to secure digital assets with stronger protection, verification, and fraud prevention.","tags":["SEC"]},{"title":"OT attacks surge as threat actors embrace cloud and AI, warns Forescout","source":"IT Security Guru","date":"2026-02-04T14:42:41.000Z","url":"https://www.itsecurityguru.org/2026/02/04/ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout/?utm_source=rss&utm_medium=rss&utm_campaign=ot-attacks-surge-as-threat-actors-embrace-cloud-and-ai-warns-forescout","summary":"Cyberattacks targeting operational technology (OT) environments rose sharply in 2025, according to new research from Forescout, highlighting growing risks to critical infrastructure as attackers adapt to cloud services, AI platforms and increasingly distributed attack infrastructure. Forescout’s 2025 Threat Roundup Report, produced by its research arm Vedere Labs, analysed more than 900 million cyberattacks observed globally […]\nThe post OT attacks surge as threat actors embrace cloud and AI, warns Forescout appeared first on IT Security Guru.","tags":["SEC"]},{"title":"One Identity Appoints Gihan Munasinghe as Chief Technology Officer","source":"Cyber Security News","date":"2026-02-04T10:35:07.000Z","url":"https://cybersecuritynews.com/one-identity-appoints-gihan-munasinghe-as-chief-technology-officer/","summary":"One Identity appoints Gihan Munasinghe as CTO to drive product innovation, strengthen identity security, and accelerate enterprise growth.","tags":["SEC"]},{"title":"How SCSU Is Rebuilding Campus Technology for the AI Era","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/how-scsu-rebuilding-campus-technology-for-ai-era-a-30680","summary":"Like other schools, Southern Connecticut State University is under pressure to modernize legacy systems, strengthen security and adopt AI. CIO Tom Armstrong must","tags":["SEC"]},{"title":"Nvidia's $100 billion OpenAI deal has seemingly vanished","source":"Ars Technica","date":"2026-02-03T22:44:15.000Z","url":"https://arstechnica.com/information-technology/2026/02/five-months-later-nvidias-100-billion-openai-investment-plan-has-fizzled-out/","summary":"Two AI giants shake market confidence after investment fails to materialize.","tags":["INVESTMENT"]}]},{"id":"telecom","label":"Telecommunications","description":"Keywords: telecom, network, ISP, broadband, 5G, carrier","articles":[{"title":"Vodafone turns its network into a Europe-wide “virtual weather station”","source":"Techmonitor","date":"2026-02-23T10:23:29.000Z","url":"https://www.techmonitor.ai/news/vodafone-turns-its-network-into-a-europe-wide-virtual-weather-station","summary":"Vodafone’s existing IoT relationships and integration experience can make network-as-a-sensor technology easier to adopt.","tags":["NETWORK"]},{"title":"Vodafone turns its network into a Europe-wide “virtual weather station”","source":"Techmonitor","date":"2026-02-23T10:23:29.000Z","url":"https://www.techmonitor.ai/comment-2/vodafone-turns-its-network-into-a-europe-wide-virtual-weather-station","summary":"Vodafone’s existing IoT relationships and integration experience can make network-as-a-sensor technology easier to adopt.","tags":["NETWORK"]},{"title":"Securing our Critical Infrastructure with Zero Trust","source":"Security Boulevard","date":"2026-02-18T15:00:10.000Z","url":"https://securityboulevard.com/2026/02/securing-our-critical-infrastructure-with-zero-trust/","summary":"We are seeing a steady rise in cyberattacks against critical infrastructure and it’s not surprising. Many of these systems rely on legacy software riddled with known vulnerabilities. When these systems fail, the impact moves quickly from networks to operations, and from operations to public safety. There is still a dangerous misconception that operational technology (OT) The post Securing our Critical Infrastructure with Zero Trust appeared first on ColorTokens.","tags":["NETWORK"]},{"title":"Why technology revolutions spark unexpected consequences [Q&A]","source":"Beta News","date":"2026-02-18T09:50:04.000Z","url":"https://betanews.com/article/why-technology-revolutions-spark-unexpected-consequences-qa/","summary":"The current technology revolution -- a culmination of computing power, global networks, and learning algorithms -- is remaking our world in real time. We spoke to Jamie Dobson, the founder of digital services company Container Solutions and author of Visionaries, Rebels and Machines: The story of humanity’s extraordinary journey from electrification to cloudification to discuss the unexpected consequences of technological progress. BN: Of all the technologies available to us, Artificial Intelligence is the current headline act, and it’s becoming an increasingly important part of modern life, but it’s not welcomed by everyone. Do they have a point? JD: What we… [Continue Reading]","tags":["NETWORK"]},{"title":"Koi Purchase Bolsters Palo Alto's AI Attack Surface Defense","source":"Inforisk","date":"2026-02-18T00:00:00.000Z","url":"https://www.inforisktoday.com/koi-purchase-bolsters-palo-altos-ai-attack-surface-defense-a-30789","summary":"Palo Alto Networks plans to acquire Koi Security for $300 million to address growing AI-driven endpoint risks. The startup's technology adds deep visibility into AI","tags":["NETWORK"]},{"title":"NDSS 2025 – LADDER: Multi-Objective Backdoor Attack Via Evolutionary Algorithm","source":"Security Boulevard","date":"2026-02-17T20:00:00.000Z","url":"https://securityboulevard.com/2026/02/ndss-2025-ladder-multi-objective-backdoor-attack-via-evolutionary-algorithm/","summary":"Session 12D: ML Backdoors  Authors, Creators & Presenters: Dazhuang Liu (Delft University of Technology), Yanqi Qiao (Delft University of Technology), Rui Wang (Delft University of Technology), Kaitai Liang (Delft University of Technology), Georgios Smaragdakis (Delft University of Technology) PAPER LADDER: Multi-Objective Backdoor Attack via Evolutionary Algorithm Current black-box backdoor attacks in convolutional neural networks formulate attack objective(s) as single-objective optimization problems in single domain. Designing triggers in single domain harms semantics and trigger robustness as well as introduces visual and spectral anomaly. This work proposes a multi-objective black-box backdoor attack in dual domains via evolutionary algorithm (LADDER), the first instance of achieving multiple attack objectives simultaneously by optimizing triggers without requiring prior knowledge about victim model. In particular, we formulate LADDER as a multi-objective optimization problem (MOP","tags":["NETWORK"]},{"title":"Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group","source":"Security Boulevard","date":"2026-02-13T08:11:25.000Z","url":"https://securityboulevard.com/2026/02/top-security-incidents-of-2025-the-emergence-of-the-chainedshark-apt-group/","summary":"In 2025, NSFOCUS Fuying Lab disclosed a new APT group targeting China’s scientific research sector, dubbed “ChainedShark” (tracking number: Actor240820). Been active since May 2024, the group’s operations are marked by high strategic coherence and technical sophistication. Its primary targets are professionals in Chinese universities and research institutions specializing in international relations, marine technology, and related The post Top Security Incidents of 2025:  The Emergence of the ChainedShark APT Group appeared first on NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks..","tags":["NETWORK","CARRIER"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:55:25.000Z","url":"https://arcticwolf.com/resources/glossary-uk/virtual-private-network/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["NETWORK"]},{"title":"Virtual Private Network (VPN)","source":"Arctic Wolf","date":"2026-02-10T18:37:15.000Z","url":"https://arcticwolf.com/resources/glossary/virtual-private-network-vpn/","summary":"What Is a Virtual Private Network (VPN?) A Virtual Private Network (VPN) is a technology that creates an encrypted connection between a user’s device and a remote network or service. This encrypted connection protects data as it travels across public networks, allowing users to access internal systems and applications as if they were directly connected ... Virtual Private Network (VPN)","tags":["NETWORK"]},{"title":"9th February – Threat Intelligence Report","source":"Checkpoint Research","date":"2026-02-09T12:50:16.000Z","url":"https://research.checkpoint.com/2026/9th-february-threat-intelligence-report/","summary":"For the latest discoveries in cyber research for the week of 9th February, please download our Threat Intelligence Bulletin. TOP ATTACKS AND BREACHES Romania’s national oil pipeline operator, Conpet, has suffered a cyberattack that disrupted its IT systems and took its website offline. The company said operational technology, including pipeline control and telecommunications systems, remained […]","tags":["TELECOM"]},{"title":"AI-PTS: Breaking Traditional Barriers, Revolutionizing Penetration Testing","source":"NSFOCUS","date":"2026-02-09T03:34:07.000Z","url":"https://nsfocusglobal.com/ai-pts-breaking-traditional-barriers-revolutionizing-penetration-testing/","summary":"AI Penetration Testing System (AI-PTS) Leveraging AI to empower penetration testing, the AI-PTS integrates AI technology with traditional penetration testing methods. It delivers an AI+ defense system tailored for real-world attack scenarios. The AI-PTS is designed to help security professionals conduct non-destructive security assessments for networks, systems, and applications, significantly improving testing efficiency and quality. […]","tags":["NETWORK"]}]}]}