{"updated":"2026-02-25T01:05:13.788Z","industries":[{"id":"government","label":"Government","description":"Keywords: government, county, federal, defense, court","articles":[{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["GOVERNMENT"]},{"title":"Three Healthcare Providers Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-11T16:16:24.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-settle-class-action-data-breach-lawsuits/","summary":"Settlements have received preliminary approval from the courts to resolve class action lawsuits against Northeast Rehabilitation Hospital Network, American Addiction […]\nThe post Three Healthcare Providers Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["COURT"]},{"title":"FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience","source":"HIPAA Journal","date":"2026-02-05T13:05:37.000Z","url":"https://www.hipaajournal.com/fbi-operation-winter-shield-cybersecurity/","summary":"The Federal Bureau of Investigation (FBI) has launched a campaign to improve the resilience of industry, government, and critical infrastructure […]\nThe post FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience appeared first on The HIPAA Journal.","tags":["GOVERNMENT","FEDERAL"]},{"title":"Questions Loom Ahead of Substance Abuse Privacy Rules Shift","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/questions-loom-ahead-substance-abuse-privacy-rules-shift-i-5522","summary":"As the compliance deadline quickly approaches for changes to align the federal rules for the confidentiality of substance use disorder records with HIPAA, entities","tags":["FEDERAL"]},{"title":"Aligning Substance Use Privacy Regs With HIPAA Isn’t Simple","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/aligning-substance-use-privacy-regs-hipaa-isnt-simple-i-5519","summary":"Revisions to 42 CFR Part 2 that go into effect soon to better align federal regulations for the confidentiality of substance use disorder records with HIPAA require","tags":["FEDERAL"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["COUNTY"]}]},{"id":"healthcare","label":"Healthcare","description":"Keywords: healthcare, hospital, clinic, medical, biotech, pharmacy, pharma, hipaa","articles":[{"title":"Catholic Health System & Northwell Health Settle Pixel Lawsuits","source":"HIPAA Journal","date":"2026-02-24T16:16:40.000Z","url":"https://www.hipaajournal.com/catholic-health-northwell-health-pixel-settlements/","summary":"The New York-based health systems, Catholic Health System & Northwell Health, have agreed to settle class action lawsuits stemming from […]\nThe post Catholic Health System & Northwell Health Settle Pixel Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"How to maximize HEDIS scores with synthetic data","source":"Security Boulevard","date":"2026-02-24T15:10:31.000Z","url":"https://securityboulevard.com/2026/02/how-to-maximize-hedis-scores-with-synthetic-data/","summary":"Accessing PHI for development and testing is often blocked by stringent HIPAA compliance requirements. Learn how synthetic data helps engineers build tools to close care gaps and improve HEDIS scores.","tags":["HIPAA"]},{"title":"Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals","source":"HIPAA Journal","date":"2026-02-24T09:04:29.000Z","url":"https://www.hipaajournal.com/greater-pittsburgh-orthopedic-associates-data-breach/","summary":"Greater Pittsburgh Orthopedic Associates has experienced a ransomware attack that has affected almost 57,000 individuals. Data breaches have also been […]\nThe post Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor","source":"HIPAA Journal","date":"2026-02-23T17:51:12.000Z","url":"https://www.hipaajournal.com/vikor-scientific-catalyst-rcm-data-breach/","summary":"Vikor Scientific (now rebranded as Vanta Diagnostics), a molecular diagnostics company based in Charleston, South Carolina, has been affected by […]\nThe post Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System","source":"HIPAA Journal","date":"2026-02-23T16:35:18.000Z","url":"https://www.hipaajournal.com/va-oig-security-deficiencies-va-spokane-healthcare-system/","summary":"An audit of the Department of Veterans’ Affairs Spokane Healthcare System in Washington state by the Department of Veterans Affairs […]\nThe post VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement","source":"HIPAA Journal","date":"2026-02-23T13:13:53.000Z","url":"https://www.hipaajournal.com/senators-demand-answers-decline-osha-safety-health-enforcement/","summary":"Six Democratic Senators have written to the United States Secretary of Labor, Lori Chavez-DeReme, demanding answers about an apparent rollback […]\nThe post Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Interview: Hoala Greevy, Founder & CEO, Paubox","source":"HIPAA Journal","date":"2026-02-23T11:08:26.000Z","url":"https://www.hipaajournal.com/interview-hoala-greevy-founder-ceo-paubox/","summary":"The HIPAA Journal has spoken with Paubox founder and CEO, Hoala Greevy to find out more about their work and […]\nThe post Interview: Hoala Greevy, Founder & CEO, Paubox appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Why Healthcare Staff Need HIPAA Training for Social Media","source":"HIPAA Journal","date":"2026-02-23T06:50:30.000Z","url":"https://www.hipaajournal.com/why-healthcare-staff-need-hipaa-training-for-social-media/","summary":"Healthcare staff need HIPAA training for social media because a single post, photo, or comment can expose Protected Health Information […]\nThe post Why Healthcare Staff Need HIPAA Training for Social Media appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses","source":"HIPAA Journal","date":"2026-02-20T15:52:09.000Z","url":"https://www.hipaajournal.com/utah-department-health-human-services-audit-security-weaknesses/","summary":"An audit of the Utah Department of Health and Human Services (DHHS) by the Office of the Utah State Auditor […]\nThe post Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["CLINIC","MEDICAL","HIPAA"]},{"title":"Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-20T11:05:42.000Z","url":"https://www.hipaajournal.com/granite-wellness-centers-pediatric-home-service-data-breach-settlements/","summary":"Granite Wellness Centers in California and Pediatric Home Service in Minnesota have both settled lawsuits stemming from cyberattacks that exposed […]\nThe post Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center","source":"HIPAA Journal","date":"2026-02-20T11:00:37.000Z","url":"https://www.hipaajournal.com/cyberattacks-wirx-pharmacy-emanuel-medical-center/","summary":"WIRX Pharmacy in Pennsylvania has experienced a security incident that exposed the protected health information of more than 20,000 current […]\nThe post Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center appeared first on The HIPAA Journal.","tags":["MEDICAL","PHARMACY","PHARMA","HIPAA"]},{"title":"Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation","source":"HIPAA Journal","date":"2026-02-20T10:06:08.000Z","url":"https://www.hipaajournal.com/top-of-the-world-treatment-center-hipaa-settlement/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has announced its first financial penalty of […]\nThe post Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HHS OCR Settles HIPAA Security Rule Investigation with Top of the World Ranch Treatment Center","source":"Databreaches.net","date":"2026-02-20T02:22:00.000Z","url":"https://databreaches.net/2026/02/19/hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center/?pk_campaign=feed&pk_kwd=hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center","summary":"Settlement Marks OCR's 11th Enforcement Action in OCR's Risk Analysis Initiative Today, the U.S. Department of Health and Human Services' (HHS) Office for Civil","tags":["HIPAA"]},{"title":"Data Shows Elevenfold Increase in Data-only Extortion Attacks","source":"HIPAA Journal","date":"2026-02-19T17:39:07.000Z","url":"https://www.hipaajournal.com/data-shows-elevenfold-increase-data-only-extortion-attacks/","summary":"There has been a sharp increase in data-only extortion incidents, with ransomware gangs increasingly opting not to encrypt files, instead […]\nThe post Data Shows Elevenfold Increase in Data-only Extortion Attacks appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Three Healthcare Providers Affected by Ransomware Attacks","source":"HIPAA Journal","date":"2026-02-19T11:00:45.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-ransomware-attacks/","summary":"Issaqueena Pediatric Dentistry in South Carolina, Enhabit Home Health & Hospice in Texas, and AltaMed Health Services in California have […]\nThe post Three Healthcare Providers Affected by Ransomware Attacks appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"March 1, 2026: Small Healthcare Data Breach HIPAA Reporting Deadline","source":"HIPAA Journal","date":"2026-02-18T15:44:56.000Z","url":"https://www.hipaajournal.com/march-1-2026-small-healthcare-data-breach-hipaa-reporting-deadline/","summary":"Healthcare data breaches discovered in calendar year 2025 that affected fewer than 500 individuals must be reported to the HHS’ […]\nThe post March 1, 2026: Small Healthcare Data Breach HIPAA Reporting Deadline appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients","source":"HIPAA Journal","date":"2026-02-18T15:01:31.000Z","url":"https://www.hipaajournal.com/academic-urology-urogynecology-of-arizona-data-breach/","summary":"Academic Urology & Urogynecology of Arizona, a division of Palo Verde Hematology and Oncology that serves patients throughout Arizona, has […]\nThe post Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"March 2, 2025: Deadline for Electronic Submission of 2025 Workplace Injury and Illness Data","source":"HIPAA Journal","date":"2026-02-17T15:52:15.000Z","url":"https://www.hipaajournal.com/march-2-2025-deadline-electronic-submission-2025-workplace-injury-illness-data/","summary":"The deadline for submitting electronic workplace injury and illness information to the Occupational Safety and Health Administration (OSHA) is March […]\nThe post March 2, 2025: Deadline for Electronic Submission of 2025 Workplace Injury and Illness Data appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-17T11:00:22.000Z","url":"https://www.hipaajournal.com/carespring-health-care-management-lifebridge-health-data-breach-settlements/","summary":"Carespring Health Care Management in Ohio and LifeBridge Health in Maryland have agreed to settle class action lawsuits stemming from […]\nThe post Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Do your Staff need Training on HIPAA in Emergency Situations?","source":"HIPAA Journal","date":"2026-02-16T11:55:09.000Z","url":"https://www.hipaajournal.com/do-your-staff-need-training-on-hipaa-in-emergency-situations/","summary":"Emergencies in healthcare are not limited to extreme weather, wildfires, or other natural disasters. Today’s most disruptive incidents are just […]\nThe post Do your Staff need Training on HIPAA in Emergency Situations? appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"HHS Office for Civil Rights Establishes Part 2 Enforcement Program","source":"HIPAA Journal","date":"2026-02-16T11:35:05.000Z","url":"https://www.hipaajournal.com/hhs-part2-enforcement-program/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has established a civil enforcement program for […]\nThe post HHS Office for Civil Rights Establishes Part 2 Enforcement Program appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons","source":"HIPAA Journal","date":"2026-02-16T11:00:29.000Z","url":"https://www.hipaajournal.com/data-breach-settlements-centrelake-medical-group-des-moines-orthopaedic-surgeons/","summary":"Class action lawsuits over data breaches at Centrelake Medical Group and Des Moines Orthopaedic Surgeons have been resolved with settlements. […]\nThe post Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons appeared first on The HIPAA Journal.","tags":["MEDICAL","HIPAA"]},{"title":"2025 Healthcare Data Breach Report","source":"HIPAA Journal","date":"2026-02-13T23:54:17.000Z","url":"https://www.hipaajournal.com/2025-healthcare-data-breach-report/","summary":"More than 700 healthcare data breaches affecting 500 or more individuals are being reported to the Department of Health and […]\nThe post 2025 Healthcare Data Breach Report appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation","source":"HIPAA Journal","date":"2026-02-13T11:00:10.000Z","url":"https://www.hipaajournal.com/emergency-medical-services-authority-compassion-health-care-data-breach-settlements/","summary":"Emergency Medical Services Authority in Oklahoma and Compassion Health Care in North Carolina were sued over cyberattacks and data breaches. […]\nThe post Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation appeared first on The HIPAA Journal.","tags":["MEDICAL","HIPAA"]},{"title":"AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance","source":"Security Boulevard","date":"2026-02-13T10:00:18.000Z","url":"https://securityboulevard.com/2026/02/ai-powered-hipaa-compliance-readiness-testing-in-healthcare-software-a-qa-leaders-guide-to-continuous-compliance/","summary":"In healthcare software, quality is inseparable from compliance. A feature working as designed is not enough. Every workflow, integration, and data exchange must protect Protected...Read More The post AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["HEALTHCARE","HIPAA"]},{"title":"Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY","source":"HIPAA Journal","date":"2026-02-12T14:15:13.000Z","url":"https://www.hipaajournal.com/healthcare-most-targeted-sector-2025-ransomware/","summary":"A new record was set for ransomware attacks last year, with disclosed ransomware attacks increasing by 49% year-over-year to a […]\nThe post Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Data Breaches Announced by MedRevenu & EyeCare Partners","source":"HIPAA Journal","date":"2026-02-12T13:43:46.000Z","url":"https://www.hipaajournal.com/data-breach-medrevenu-eyecare-partners/","summary":"Data breaches have been confirmed by the revenue cycle management company MedRevenu Inland Physicians Hospitalist Services, and the Missouri-based eye […]\nThe post Data Breaches Announced by MedRevenu & EyeCare Partners appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-12T12:00:57.000Z","url":"https://www.hipaajournal.com/pinehurst-radiology-tallahassee-memorial-healthcare-settlements/","summary":"Pinehurst Radiology Associates has agreed to settle a class action lawsuit over a January 2025 data breach, and Tallahassee Memorial […]\nThe post Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Your AI doctor doesn’t have to follow the same privacy rules as your real one","source":"CyberScoop","date":"2026-02-11T19:51:01.000Z","url":"https://cyberscoop.com/ai-healthcare-apps-hipaa-privacy-risks-openai-anthropic/","summary":"AI apps are making their way into healthcare. It’s not clear that rigorous data security or privacy practices will be part of the package.","tags":["HEALTHCARE"]},{"title":"Three Healthcare Providers Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-11T16:16:24.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-settle-class-action-data-breach-lawsuits/","summary":"Settlements have received preliminary approval from the courts to resolve class action lawsuits against Northeast Rehabilitation Hospital Network, American Addiction […]\nThe post Three Healthcare Providers Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HOSPITAL","HIPAA"]},{"title":"Therapy Practice Management Software","source":"HIPAA Journal","date":"2026-02-11T15:59:01.000Z","url":"https://www.hipaajournal.com/therapy-practice-management-software/","summary":"Therapy practice management software is an administrative and clinical operations system used by behavioral health providers to manage scheduling, documentation, […]\nThe post Therapy Practice Management Software appeared first on The HIPAA Journal.","tags":["CLINIC","HIPAA"]},{"title":"83,000 Clients Affected by Cyberattack on Ohio Counseling Center","source":"HIPAA Journal","date":"2026-02-11T13:34:40.000Z","url":"https://www.hipaajournal.com/ohio-counseling-center-cyberattack/","summary":"The Counseling Center of Wayne and Holmes Counties has experienced a cyberattack affecting 83,350 individuals. Data breaches have also been […]\nThe post 83,000 Clients Affected by Cyberattack on Ohio Counseling Center appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["MEDICAL","HIPAA"]},{"title":"McLaren Health Care Pays $14 Million to Settle Litigation Over Ransomware Attacks","source":"HIPAA Journal","date":"2026-02-10T10:32:12.000Z","url":"https://www.hipaajournal.com/mclaren-health-care-data-breach-settlement/","summary":"McLaren Health Care has agreed to pay $14 million to settle class action litigation stemming from two ransomware attacks in […]\nThe post McLaren Health Care Pays $14 Million to Settle Litigation Over Ransomware Attacks appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients","source":"HIPAA Journal","date":"2026-02-09T15:42:00.000Z","url":"https://www.hipaajournal.com/jbs-mental-health-authority-data-breach/","summary":"Jefferson-Blount-St. Clair Mental Health Authority in Alabama, Cottage Hospital in New Hampshire, WindRose Health Network in Indiana, and Iroquois Memorial […]\nThe post Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty","source":"HIPAA Journal","date":"2026-02-09T15:33:06.000Z","url":"https://www.hipaajournal.com/cordell-memorial-holmes-regional-medical-center-emtala-penalties/","summary":"Two hospitals have entered into settlement agreements with the Department of Health and Human Services (HHS) Office of Inspector General […]\nThe post Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty appeared first on The HIPAA Journal.","tags":["HOSPITAL","MEDICAL","HIPAA"]},{"title":"What Is Healthcare-Adjacent Data?","source":"HIPAA Journal","date":"2026-02-06T17:13:28.000Z","url":"https://www.hipaajournal.com/what-is-healthcare-adjacent-data/","summary":"Healthcare-adjacent data is any health‑related or health‑influenced information that falls outside HIPAA’s definition of Protected Health Information because it is […]\nThe post What Is Healthcare-Adjacent Data? appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches","source":"HIPAA Journal","date":"2026-02-06T15:02:28.000Z","url":"https://www.hipaajournal.com/docs-dermatology-group-center-for-neuropsychology-learning-disclose-data-breaches/","summary":"Central States Dermatology Services (DOCS Dermatology Group) in Ohio and The Center for Neuropsychology and Learning in Michigan have identified […]\nThe post DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"What is Medical Practice Management Software?","source":"HIPAA Journal","date":"2026-02-05T17:31:02.000Z","url":"https://www.hipaajournal.com/medical-practice-management-software/","summary":"Medical practice management software is a clinic operations system that helps a medical practice schedule patients, manage billing and payments, […]\nThe post What is Medical Practice Management Software? appeared first on The HIPAA Journal.","tags":["CLINIC","MEDICAL","HIPAA"]},{"title":"Healthcare Technology Company Discloses Ransomware Attack","source":"HIPAA Journal","date":"2026-02-05T14:58:22.000Z","url":"https://www.hipaajournal.com/insightin-health-clinic-service-corporation-data-breach/","summary":"Cyberattacks and data breaches have recently been announced by the healthcare technology company Insightin Health and the Colorado-based medical billing […]\nThe post Healthcare Technology Company Discloses Ransomware Attack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","MEDICAL","HIPAA"]},{"title":"FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience","source":"HIPAA Journal","date":"2026-02-05T13:05:37.000Z","url":"https://www.hipaajournal.com/fbi-operation-winter-shield-cybersecurity/","summary":"The Federal Bureau of Investigation (FBI) has launched a campaign to improve the resilience of industry, government, and critical infrastructure […]\nThe post FBI Urges Organziations to Take 10 Actions to Improve Cyber Resilience appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools","source":"HIPAA Journal","date":"2026-02-05T11:58:57.000Z","url":"https://www.hipaajournal.com/legacy-health-garnet-health-pixel-settlements/","summary":"Two healthcare providers have agreed to settle class action lawsuits over their use of website tracking technologies. Website tracking technologies, […]\nThe post Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"HIPAA, Healthcare Data, and Artificial Intelligence","source":"HIPAA Journal","date":"2026-02-05T07:35:48.000Z","url":"https://www.hipaajournal.com/hipaa-healthcare-data-and-artificial-intelligence/","summary":"Artificial intelligence is rapidly reshaping healthcare, offering new ways to analyze data, support clinical decisions, streamline operations, and improve patient […]\nThe post HIPAA, Healthcare Data, and Artificial Intelligence appeared first on The HIPAA Journal.","tags":["HEALTHCARE","CLINIC","HIPAA"]},{"title":"HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital","source":"HIPAA Journal","date":"2026-02-04T15:57:00.000Z","url":"https://www.hipaajournal.com/hhs-oig-web-application-security-weaknesses-audit-large-hospital/","summary":"An audit of a large Southeastern hospital by the Department of Health and Human Services Office of Inspector General (HHS-OIG) […]\nThe post HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital appeared first on The HIPAA Journal.","tags":["HOSPITAL","HIPAA"]},{"title":"Central Ozarks Medical Center Discloses Data Breach Affecting Almost 12,000 Patients","source":"HIPAA Journal","date":"2026-02-04T14:49:43.000Z","url":"https://www.hipaajournal.com/central-ozarks-medical-center-data-breach/","summary":"Data breaches have recently been announced by Central Ozarks Medical Center in Missouri, AdventHealth Daytona Beach in Florida, and the […]\nThe post Central Ozarks Medical Center Discloses Data Breach Affecting Almost 12,000 Patients appeared first on The HIPAA Journal.","tags":["MEDICAL","HIPAA"]},{"title":"Is Wix HIPAA Compliant?","source":"HIPAA Journal","date":"2026-02-04T13:21:40.000Z","url":"https://www.hipaajournal.com/is-wix-hipaa-compliant/","summary":"When this article was first published in early 2025, Wix was not a HIPAA-compliant service; however, the company has since […]\nThe post Is Wix HIPAA Compliant? appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Capital Health Data Breach Litigation Settled for $4.5M","source":"HIPAA Journal","date":"2026-02-04T12:20:48.000Z","url":"https://www.hipaajournal.com/capital-health-class-action-data-breach-settlement/","summary":"Capital Health has agreed to pay $4.5 million to settle a class action lawsuit stemming from a 2023 ransomware attack. […]\nThe post Capital Health Data Breach Litigation Settled for $4.5M appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit","source":"HIPAA Journal","date":"2026-02-04T11:33:13.000Z","url":"https://www.hipaajournal.com/gryphon-healthcare-class-action-data-breach-lawsuits/","summary":"Gryphon Healthcare, a Houston, TX-based revenue cycle, coding, compliance, consultancy, and management services vendor, faced multiple class action lawsuits over […]\nThe post Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Why do Hackers Focus on Medical Records?","source":"HIPAA Journal","date":"2026-02-04T10:50:06.000Z","url":"https://www.hipaajournal.com/hackers-and-medical-records/","summary":"Hackers focus on medical records because the combination of demographic data, insurance details, clinical information, and financial identifiers creates a […]\nThe post Why do Hackers Focus on Medical Records? appeared first on The HIPAA Journal.","tags":["CLINIC","MEDICAL","HIPAA"]},{"title":"Questions Loom Ahead of Substance Abuse Privacy Rules Shift","source":"Inforisk","date":"2026-02-04T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/questions-loom-ahead-substance-abuse-privacy-rules-shift-i-5522","summary":"As the compliance deadline quickly approaches for changes to align the federal rules for the confidentiality of substance use disorder records with HIPAA, entities","tags":["HIPAA"]},{"title":"CISA Issues Guidance for Proactively Defending Against Insider Threats","source":"HIPAA Journal","date":"2026-02-03T16:34:41.000Z","url":"https://www.hipaajournal.com/cisa-issues-guidance-proactively-defending-against-insider-threats/","summary":"Insider threats are one of the leading causes of data breaches in healthcare, more so than in many other industry […]\nThe post CISA Issues Guidance for Proactively Defending Against Insider Threats appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Patients Learn Their Health Data Was Compromised More Than a Year Ago","source":"HIPAA Journal","date":"2026-02-03T14:48:35.000Z","url":"https://www.hipaajournal.com/patients-notified-2024-data-breaches/","summary":"Alpine Ear, Nose, and Throat in Colorado, The Phia Group in Massachusetts, and Community Health Northwest Florida have started notifying […]\nThe post Patients Learn Their Health Data Was Compromised More Than a Year Ago appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Bayada Home Health Care Affected by Doctor Alliance Data Breach","source":"HIPAA Journal","date":"2026-02-03T14:37:48.000Z","url":"https://www.hipaajournal.com/bayada-home-health-care-doctor-alliance-data-breach/","summary":"Bayada Home Health Care, a New Jersey-based home healthcare provider serving 22 U.S. states, has recently announced a data breach […]\nThe post Bayada Home Health Care Affected by Doctor Alliance Data Breach appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"December 2025 Healthcare Data Breach Report","source":"HIPAA Journal","date":"2026-02-02T16:00:55.000Z","url":"https://www.hipaajournal.com/december-2025-healthcare-data-breach-report/","summary":"In the final month of 2025, a further 41 healthcare data breaches affecting 500 or more individuals were reported to […]\nThe post December 2025 Healthcare Data Breach Report appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident","source":"HIPAA Journal","date":"2026-01-30T16:06:53.000Z","url":"https://www.hipaajournal.com/healthcare-interactive-data-breach/","summary":"Healthcare Interactive, better known as HCIactive, reported a data breach to the HHS’ Office for Civil Rights on September 22, […]\nThe post Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"U.S. Data Compromises Hit Record High in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-compromises-record-high-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record High in 2025 appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"U.S. Data Compromises Hit Record Breaches in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-breach-record-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record Breaches in 2025 appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Northwell Health & Northbay Healthcare Settle Litigation Over Website Pixel Use","source":"HIPAA Journal","date":"2026-01-30T11:00:15.000Z","url":"https://www.hipaajournal.com/northwell-health-northbay-healthcare-data-breach-settlements/","summary":"Northwell Health & Northbay Healthcare were sued over the use of tracking tools on their websites, which are alleged to […]\nThe post Northwell Health & Northbay Healthcare Settle Litigation Over Website Pixel Use appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Comstar to Pay State AGs $515,000 to Settle Alleged HIPAA Violations","source":"HIPAA Journal","date":"2026-01-29T11:35:21.000Z","url":"https://www.hipaajournal.com/comstar-hipaa-violation-penalty-mass-conn-2025/","summary":"Comstar, a Massachusetts-based ambulance billing and collections company, has been investigated by the Massachusetts Attorney General and found to have […]\nThe post Comstar to Pay State AGs $515,000 to Settle Alleged HIPAA Violations appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HHS Applies Inflation Increase to Penalties for HIPAA Violations","source":"HIPAA Journal","date":"2026-01-28T17:45:00.000Z","url":"https://www.hipaajournal.com/hhs-applies-inflation-increase-penalties-for-hipaa-violations/","summary":"The HHS’ Office for Civil Rights has increased the penalties for HIPAA violations with immediate effect. As of January 28, […]\nThe post HHS Applies Inflation Increase to Penalties for HIPAA Violations appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"HIPAA Training for IT Professionals","source":"HIPAA Journal","date":"2026-01-28T13:59:53.000Z","url":"https://www.hipaajournal.com/hipaa-training-for-it-professionals/","summary":"HIPAA training for IT professionals is required for IT workforce members who support systems that create, receive, maintain, or transmit […]\nThe post HIPAA Training for IT Professionals appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches","source":"HIPAA Journal","date":"2026-01-28T13:33:30.000Z","url":"https://www.hipaajournal.com/four-healthcare-providers-class-action-data-brteach-settlements/","summary":"Settlements have been agreed to resolve class action lawsuits over healthcare data breaches experienced by Alabama Cardiovascular Group, Carolina Arthritis […]\nThe post Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches appeared first on The HIPAA Journal.","tags":["HEALTHCARE","HIPAA"]},{"title":"Blue Cross Blue Shield of Montana Faces Data Breach Probe","source":"HIPAA Journal","date":"2026-01-28T13:23:11.000Z","url":"https://www.hipaajournal.com/blue-cross-blue-shield-montana-data-breach-probe/","summary":"Health Care Service Corporation, doing business as Blue Cross Blue Shield of Montana (BCBSMT), is facing a probe into whether […]\nThe post Blue Cross Blue Shield of Montana Faces Data Breach Probe appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Aligning Substance Use Privacy Regs With HIPAA Isn’t Simple","source":"Inforisk","date":"2026-01-28T00:00:00.000Z","url":"https://www.inforisktoday.com/interviews/aligning-substance-use-privacy-regs-hipaa-isnt-simple-i-5519","summary":"Revisions to 42 CFR Part 2 that go into effect soon to better align federal regulations for the confidentiality of substance use disorder records with HIPAA require","tags":["HIPAA"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-01-27T15:26:06.000Z","url":"https://www.hipaajournal.com/texas-new-jersey-dermatology-practices-data-breach-settlements/","summary":"Two U.S. dermatology practices have agreed to settle class action lawsuits stemming from cybersecurity incidents that exposed patient data. The […]\nThe post Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability","source":"HIPAA Journal","date":"2026-01-27T13:10:22.000Z","url":"https://www.hipaajournal.com/microsoft-issues-emergency-patch-for-actively-exploited-office-vulnerability/","summary":"Microsoft has issued an out-of-band security update to fix an actively exploited zero-day vulnerability in Microsoft Office. The vulnerability is tracked […]\nThe post Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"MACT Health Board Patients Affected by November 2025 Ransomware Attack","source":"HIPAA Journal","date":"2026-01-26T14:35:38.000Z","url":"https://www.hipaajournal.com/mact-health-board-data-breach/","summary":"MACT Health Board has confirmed that patient data was stolen in a November 2025 cyberattack, for which the INC Ransom […]\nThe post MACT Health Board Patients Affected by November 2025 Ransomware Attack appeared first on The HIPAA Journal.","tags":["HIPAA"]},{"title":"More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack","source":"HIPAA Journal","date":"2026-01-26T14:24:54.000Z","url":"https://www.hipaajournal.com/munson-healthcare-cerner-data-breach/","summary":"Munson Healthcare, the largest health system in Northern Michigan, has recently notified patients about unauthorized access to its electronic medical […]\nThe post More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack appeared first on The HIPAA Journal.","tags":["HEALTHCARE","MEDICAL","HIPAA"]}]},{"id":"construction","label":"Construction","description":"Keywords: construction, construct, HVAC, building","articles":[]},{"id":"business-services","label":"Business Services","description":"Keywords: business, professional, services, accounting, law firm, LLP, associates, law","articles":[{"title":"Catholic Health System & Northwell Health Settle Pixel Lawsuits","source":"HIPAA Journal","date":"2026-02-24T16:16:40.000Z","url":"https://www.hipaajournal.com/catholic-health-northwell-health-pixel-settlements/","summary":"The New York-based health systems, Catholic Health System & Northwell Health, have agreed to settle class action lawsuits stemming from […]\nThe post Catholic Health System & Northwell Health Settle Pixel Lawsuits appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals","source":"HIPAA Journal","date":"2026-02-24T09:04:29.000Z","url":"https://www.hipaajournal.com/greater-pittsburgh-orthopedic-associates-data-breach/","summary":"Greater Pittsburgh Orthopedic Associates has experienced a ransomware attack that has affected almost 57,000 individuals. Data breaches have also been […]\nThe post Greater Pittsburgh Orthopedic Associates Data Breach Affects Almost 57,000 Individuals appeared first on The HIPAA Journal.","tags":["ASSOCIATES"]},{"title":"Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses","source":"HIPAA Journal","date":"2026-02-20T15:52:09.000Z","url":"https://www.hipaajournal.com/utah-department-health-human-services-audit-security-weaknesses/","summary":"An audit of the Utah Department of Health and Human Services (DHHS) by the Office of the Utah State Auditor […]\nThe post Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-20T11:05:42.000Z","url":"https://www.hipaajournal.com/granite-wellness-centers-pediatric-home-service-data-breach-settlements/","summary":"Granite Wellness Centers in California and Pediatric Home Service in Minnesota have both settled lawsuits stemming from cyberattacks that exposed […]\nThe post Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation","source":"HIPAA Journal","date":"2026-02-20T10:06:08.000Z","url":"https://www.hipaajournal.com/top-of-the-world-treatment-center-hipaa-settlement/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has announced its first financial penalty of […]\nThe post Top of the World Treatment Center Settles Alleged Risk Analysis HIPAA Violation appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"HHS OCR Settles HIPAA Security Rule Investigation with Top of the World Ranch Treatment Center","source":"Databreaches.net","date":"2026-02-20T02:22:00.000Z","url":"https://databreaches.net/2026/02/19/hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center/?pk_campaign=feed&pk_kwd=hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center","summary":"Settlement Marks OCR's 11th Enforcement Action in OCR's Risk Analysis Initiative Today, the U.S. Department of Health and Human Services' (HHS) Office for Civil","tags":["SERVICES"]},{"title":"Three Healthcare Providers Affected by Ransomware Attacks","source":"HIPAA Journal","date":"2026-02-19T11:00:45.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-ransomware-attacks/","summary":"Issaqueena Pediatric Dentistry in South Carolina, Enhabit Home Health & Hospice in Texas, and AltaMed Health Services in California have […]\nThe post Three Healthcare Providers Affected by Ransomware Attacks appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-17T11:00:22.000Z","url":"https://www.hipaajournal.com/carespring-health-care-management-lifebridge-health-data-breach-settlements/","summary":"Carespring Health Care Management in Ohio and LifeBridge Health in Maryland have agreed to settle class action lawsuits stemming from […]\nThe post Carespring Health Care Management & LifeBridge Health Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"HHS Office for Civil Rights Establishes Part 2 Enforcement Program","source":"HIPAA Journal","date":"2026-02-16T11:35:05.000Z","url":"https://www.hipaajournal.com/hhs-part2-enforcement-program/","summary":"The Department of Health and Human Services (HHS) Office for Civil Rights (OCR) has established a civil enforcement program for […]\nThe post HHS Office for Civil Rights Establishes Part 2 Enforcement Program appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons","source":"HIPAA Journal","date":"2026-02-16T11:00:29.000Z","url":"https://www.hipaajournal.com/data-breach-settlements-centrelake-medical-group-des-moines-orthopaedic-surgeons/","summary":"Class action lawsuits over data breaches at Centrelake Medical Group and Des Moines Orthopaedic Surgeons have been resolved with settlements. […]\nThe post Data Breach Settlements Agreed by Centrelake Medical Group & Des Moines Orthopaedic Surgeons appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation","source":"HIPAA Journal","date":"2026-02-13T11:00:10.000Z","url":"https://www.hipaajournal.com/emergency-medical-services-authority-compassion-health-care-data-breach-settlements/","summary":"Emergency Medical Services Authority in Oklahoma and Compassion Health Care in North Carolina were sued over cyberattacks and data breaches. […]\nThe post Emergency Medical Services Authority & Compassion Health Care Settle Data Breach Litigation appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Data Breaches Announced by MedRevenu & EyeCare Partners","source":"HIPAA Journal","date":"2026-02-12T13:43:46.000Z","url":"https://www.hipaajournal.com/data-breach-medrevenu-eyecare-partners/","summary":"Data breaches have been confirmed by the revenue cycle management company MedRevenu Inland Physicians Hospitalist Services, and the Missouri-based eye […]\nThe post Data Breaches Announced by MedRevenu & EyeCare Partners appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-12T12:00:57.000Z","url":"https://www.hipaajournal.com/pinehurst-radiology-tallahassee-memorial-healthcare-settlements/","summary":"Pinehurst Radiology Associates has agreed to settle a class action lawsuit over a January 2025 data breach, and Tallahassee Memorial […]\nThe post Pinehurst Radiology Associates & Tallahassee Memorial HealthCare Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["ASSOCIATES","LAW"]},{"title":"Three Healthcare Providers Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-11T16:16:24.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-settle-class-action-data-breach-lawsuits/","summary":"Settlements have received preliminary approval from the courts to resolve class action lawsuits against Northeast Rehabilitation Hospital Network, American Addiction […]\nThe post Three Healthcare Providers Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["BUSINESS","LAW"]},{"title":"Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty","source":"HIPAA Journal","date":"2026-02-09T15:33:06.000Z","url":"https://www.hipaajournal.com/cordell-memorial-holmes-regional-medical-center-emtala-penalties/","summary":"Two hospitals have entered into settlement agreements with the Department of Health and Human Services (HHS) Office of Inspector General […]\nThe post Failure to Provide a Medical Screening Examination Results in HHS-OIG Penalty appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches","source":"HIPAA Journal","date":"2026-02-06T15:02:28.000Z","url":"https://www.hipaajournal.com/docs-dermatology-group-center-for-neuropsychology-learning-disclose-data-breaches/","summary":"Central States Dermatology Services (DOCS Dermatology Group) in Ohio and The Center for Neuropsychology and Learning in Michigan have identified […]\nThe post DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools","source":"HIPAA Journal","date":"2026-02-05T11:58:57.000Z","url":"https://www.hipaajournal.com/legacy-health-garnet-health-pixel-settlements/","summary":"Two healthcare providers have agreed to settle class action lawsuits over their use of website tracking technologies. Website tracking technologies, […]\nThe post Legacy Health & Garnet Health Settle Class Action Lawsuits Over Website Tracking Tools appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital","source":"HIPAA Journal","date":"2026-02-04T15:57:00.000Z","url":"https://www.hipaajournal.com/hhs-oig-web-application-security-weaknesses-audit-large-hospital/","summary":"An audit of a large Southeastern hospital by the Department of Health and Human Services Office of Inspector General (HHS-OIG) […]\nThe post HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Capital Health Data Breach Litigation Settled for $4.5M","source":"HIPAA Journal","date":"2026-02-04T12:20:48.000Z","url":"https://www.hipaajournal.com/capital-health-class-action-data-breach-settlement/","summary":"Capital Health has agreed to pay $4.5 million to settle a class action lawsuit stemming from a 2023 ransomware attack. […]\nThe post Capital Health Data Breach Litigation Settled for $4.5M appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit","source":"HIPAA Journal","date":"2026-02-04T11:33:13.000Z","url":"https://www.hipaajournal.com/gryphon-healthcare-class-action-data-breach-lawsuits/","summary":"Gryphon Healthcare, a Houston, TX-based revenue cycle, coding, compliance, consultancy, and management services vendor, faced multiple class action lawsuits over […]\nThe post Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit appeared first on The HIPAA Journal.","tags":["SERVICES","LAW"]},{"title":"HIPAA Training for IT Professionals","source":"HIPAA Journal","date":"2026-01-28T13:59:53.000Z","url":"https://www.hipaajournal.com/hipaa-training-for-it-professionals/","summary":"HIPAA training for IT professionals is required for IT workforce members who support systems that create, receive, maintain, or transmit […]\nThe post HIPAA Training for IT Professionals appeared first on The HIPAA Journal.","tags":["PROFESSIONAL"]},{"title":"Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches","source":"HIPAA Journal","date":"2026-01-28T13:33:30.000Z","url":"https://www.hipaajournal.com/four-healthcare-providers-class-action-data-brteach-settlements/","summary":"Settlements have been agreed to resolve class action lawsuits over healthcare data breaches experienced by Alabama Cardiovascular Group, Carolina Arthritis […]\nThe post Four Healthcare Providers Settle Class Action Lawsuits Over Data Breaches appeared first on The HIPAA Journal.","tags":["LAW"]},{"title":"Blue Cross Blue Shield of Montana Faces Data Breach Probe","source":"HIPAA Journal","date":"2026-01-28T13:23:11.000Z","url":"https://www.hipaajournal.com/blue-cross-blue-shield-montana-data-breach-probe/","summary":"Health Care Service Corporation, doing business as Blue Cross Blue Shield of Montana (BCBSMT), is facing a probe into whether […]\nThe post Blue Cross Blue Shield of Montana Faces Data Breach Probe appeared first on The HIPAA Journal.","tags":["BUSINESS"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["SERVICES"]},{"title":"Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-01-27T15:26:06.000Z","url":"https://www.hipaajournal.com/texas-new-jersey-dermatology-practices-data-breach-settlements/","summary":"Two U.S. dermatology practices have agreed to settle class action lawsuits stemming from cybersecurity incidents that exposed patient data. The […]\nThe post Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["LAW"]}]},{"id":"education","label":"Education","description":"Keywords: education, school, district, K-12, college, higher education, highered, university","articles":[{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach","source":"HIPAA Journal","date":"2026-02-10T14:52:58.000Z","url":"https://www.hipaajournal.com/staten-island-university-hospital-data-breach-settlement/","summary":"Staten Island University Hospital (SIUH) in New York has agreed to settle a class action lawsuit over a 2024 data […]\nThe post Staten Island University Hospital Settles Lawsuit Over Business Associate Data Breach appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["UNIVERSITY"]}]},{"id":"retail","label":"Retail","description":"Keywords: retail, e-commerce, stores, consumer, buyer, goods, fmcg, franchise, ATO","articles":[{"title":"Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement","source":"HIPAA Journal","date":"2026-02-23T13:13:53.000Z","url":"https://www.hipaajournal.com/senators-demand-answers-decline-osha-safety-health-enforcement/","summary":"Six Democratic Senators have written to the United States Secretary of Labor, Lori Chavez-DeReme, demanding answers about an apparent rollback […]\nThe post Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement appeared first on The HIPAA Journal.","tags":["ATO"]},{"title":"Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients","source":"HIPAA Journal","date":"2026-02-18T15:01:31.000Z","url":"https://www.hipaajournal.com/academic-urology-urogynecology-of-arizona-data-breach/","summary":"Academic Urology & Urogynecology of Arizona, a division of Palo Verde Hematology and Oncology that serves patients throughout Arizona, has […]\nThe post Academic Urology & Urogynecology of Arizona Data Breach Affects 73K Patients appeared first on The HIPAA Journal.","tags":["ATO"]},{"title":"Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches","source":"HIPAA Journal","date":"2026-02-10T13:34:35.000Z","url":"https://www.hipaajournal.com/precipio-pit-river-health-tulane-university-medical-group-data-breaches/","summary":"Data breaches have been announced by the Connecticut diagnostic laboratory Precipio, Pit River Health Service in California, and Tulane University […]\nThe post Precipio; Pit River Health Service; Tulane University Medical Group Confirm Data Breaches appeared first on The HIPAA Journal.","tags":["ATO"]},{"title":"DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches","source":"HIPAA Journal","date":"2026-02-06T15:02:28.000Z","url":"https://www.hipaajournal.com/docs-dermatology-group-center-for-neuropsychology-learning-disclose-data-breaches/","summary":"Central States Dermatology Services (DOCS Dermatology Group) in Ohio and The Center for Neuropsychology and Learning in Michigan have identified […]\nThe post DOCS Dermatology Group; Center for Neuropsychology and Learning Disclose Data Breaches appeared first on The HIPAA Journal.","tags":["ATO"]},{"title":"Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-01-27T15:26:06.000Z","url":"https://www.hipaajournal.com/texas-new-jersey-dermatology-practices-data-breach-settlements/","summary":"Two U.S. dermatology practices have agreed to settle class action lawsuits stemming from cybersecurity incidents that exposed patient data. The […]\nThe post Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["ATO"]}]},{"id":"transportation","label":"Transportation","description":"Keywords: transportation, truck, logistics, shipping, cars, trucking, freight, airline, air traffic control","articles":[]},{"id":"software","label":"Software","description":"Keywords: software, SaaS, applications, platforms, code, XSS, OWASP","articles":[{"title":"AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance","source":"Security Boulevard","date":"2026-02-13T10:00:18.000Z","url":"https://securityboulevard.com/2026/02/ai-powered-hipaa-compliance-readiness-testing-in-healthcare-software-a-qa-leaders-guide-to-continuous-compliance/","summary":"In healthcare software, quality is inseparable from compliance. A feature working as designed is not enough. Every workflow, integration, and data exchange must protect Protected...Read More The post AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["SOFTWARE"]},{"title":"Therapy Practice Management Software","source":"HIPAA Journal","date":"2026-02-11T15:59:01.000Z","url":"https://www.hipaajournal.com/therapy-practice-management-software/","summary":"Therapy practice management software is an administrative and clinical operations system used by behavioral health providers to manage scheduling, documentation, […]\nThe post Therapy Practice Management Software appeared first on The HIPAA Journal.","tags":["SOFTWARE"]},{"title":"What is Medical Practice Management Software?","source":"HIPAA Journal","date":"2026-02-05T17:31:02.000Z","url":"https://www.hipaajournal.com/medical-practice-management-software/","summary":"Medical practice management software is a clinic operations system that helps a medical practice schedule patients, manage billing and payments, […]\nThe post What is Medical Practice Management Software? appeared first on The HIPAA Journal.","tags":["SOFTWARE"]}]},{"id":"agriculture","label":"Agriculture","description":"Keywords: agriculture, farm, crops, seeds, livestock, agritech, produce food, soil","articles":[]},{"id":"consulting","label":"Consulting","description":"Keywords: consult, consulting, solutions, consultant","articles":[{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["SOLUTIONS"]},{"title":"Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit","source":"HIPAA Journal","date":"2026-02-04T11:33:13.000Z","url":"https://www.hipaajournal.com/gryphon-healthcare-class-action-data-breach-lawsuits/","summary":"Gryphon Healthcare, a Houston, TX-based revenue cycle, coding, compliance, consultancy, and management services vendor, faced multiple class action lawsuits over […]\nThe post Gryphon Healthcare Agrees to Pay $2.87M to Settle Class Action Data Breach Lawsuit appeared first on The HIPAA Journal.","tags":["CONSULT"]}]},{"id":"food","label":"Food & Beverage","description":"Keywords: food, beverage, catering, FMCG, restaurant","articles":[]},{"id":"insurance","label":"Insurance","description":"Keywords: insurance, insure, reinsurance, underwriting, underwriter","articles":[{"title":"Why do Hackers Focus on Medical Records?","source":"HIPAA Journal","date":"2026-02-04T10:50:06.000Z","url":"https://www.hipaajournal.com/hackers-and-medical-records/","summary":"Hackers focus on medical records because the combination of demographic data, insurance details, clinical information, and financial identifiers creates a […]\nThe post Why do Hackers Focus on Medical Records? appeared first on The HIPAA Journal.","tags":["INSURANCE"]}]},{"id":"real-estate","label":"Real Estate","description":"Keywords: real estate, REIT, property, realtor","articles":[]},{"id":"manufacturing","label":"Manufacturing","description":"Keywords: industrial, manufacturing, ICS","articles":[{"title":"Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor","source":"HIPAA Journal","date":"2026-02-23T17:51:12.000Z","url":"https://www.hipaajournal.com/vikor-scientific-catalyst-rcm-data-breach/","summary":"Vikor Scientific (now rebranded as Vanta Diagnostics), a molecular diagnostics company based in Charleston, South Carolina, has been affected by […]\nThe post Vikor Scientific Affected by Ransomware Attack on Revenue Cycle Management Vendor appeared first on The HIPAA Journal.","tags":["ICS"]},{"title":"UMMC Shuts Clinics While it Grapples with Ransomware Attack","source":"HIPAA Journal","date":"2026-02-20T13:50:25.000Z","url":"https://www.hipaajournal.com/ummc-ransomware-attack/","summary":"University of Mississippi Medical Center (UMMC) has temporarily closed most of its clinics following a ransomware attack, and scheduled appointments […]\nThe post UMMC Shuts Clinics While it Grapples with Ransomware Attack appeared first on The HIPAA Journal.","tags":["ICS"]}]},{"id":"energy","label":"Energy & Utilities","description":"Keywords: energy, grid, renewables, utilities, oil, gas, power, OT","articles":[{"title":"Why Healthcare Staff Need HIPAA Training for Social Media","source":"HIPAA Journal","date":"2026-02-23T06:50:30.000Z","url":"https://www.hipaajournal.com/why-healthcare-staff-need-hipaa-training-for-social-media/","summary":"Healthcare staff need HIPAA training for social media because a single post, photo, or comment can expose Protected Health Information […]\nThe post Why Healthcare Staff Need HIPAA Training for Social Media appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-20T11:05:42.000Z","url":"https://www.hipaajournal.com/granite-wellness-centers-pediatric-home-service-data-breach-settlements/","summary":"Granite Wellness Centers in California and Pediatric Home Service in Minnesota have both settled lawsuits stemming from cyberattacks that exposed […]\nThe post Granite Wellness Centers & Pediatric Home Service Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center","source":"HIPAA Journal","date":"2026-02-20T11:00:37.000Z","url":"https://www.hipaajournal.com/cyberattacks-wirx-pharmacy-emanuel-medical-center/","summary":"WIRX Pharmacy in Pennsylvania has experienced a security incident that exposed the protected health information of more than 20,000 current […]\nThe post Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Data Shows Elevenfold Increase in Data-only Extortion Attacks","source":"HIPAA Journal","date":"2026-02-19T17:39:07.000Z","url":"https://www.hipaajournal.com/data-shows-elevenfold-increase-data-only-extortion-attacks/","summary":"There has been a sharp increase in data-only extortion incidents, with ransomware gangs increasingly opting not to encrypt files, instead […]\nThe post Data Shows Elevenfold Increase in Data-only Extortion Attacks appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Do your Staff need Training on HIPAA in Emergency Situations?","source":"HIPAA Journal","date":"2026-02-16T11:55:09.000Z","url":"https://www.hipaajournal.com/do-your-staff-need-training-on-hipaa-in-emergency-situations/","summary":"Emergencies in healthcare are not limited to extreme weather, wildfires, or other natural disasters. Today’s most disruptive incidents are just […]\nThe post Do your Staff need Training on HIPAA in Emergency Situations? appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance","source":"Security Boulevard","date":"2026-02-13T10:00:18.000Z","url":"https://securityboulevard.com/2026/02/ai-powered-hipaa-compliance-readiness-testing-in-healthcare-software-a-qa-leaders-guide-to-continuous-compliance/","summary":"In healthcare software, quality is inseparable from compliance. A feature working as designed is not enough. Every workflow, integration, and data exchange must protect Protected...Read More The post AI Powered HIPAA Compliance Readiness Testing in Healthcare Software. A QA Leader’s Guide to Continuous Compliance appeared first on ISHIR | Custom AI Software Development Dallas Fort-Worth Texas.","tags":["POWER","OT"]},{"title":"Your AI doctor doesn’t have to follow the same privacy rules as your real one","source":"CyberScoop","date":"2026-02-11T19:51:01.000Z","url":"https://cyberscoop.com/ai-healthcare-apps-hipaa-privacy-risks-openai-anthropic/","summary":"AI apps are making their way into healthcare. It’s not clear that rigorous data security or privacy practices will be part of the package.","tags":["OT"]},{"title":"Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients","source":"HIPAA Journal","date":"2026-02-09T15:42:00.000Z","url":"https://www.hipaajournal.com/jbs-mental-health-authority-data-breach/","summary":"Jefferson-Blount-St. Clair Mental Health Authority in Alabama, Cottage Hospital in New Hampshire, WindRose Health Network in Indiana, and Iroquois Memorial […]\nThe post Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"What Is Healthcare-Adjacent Data?","source":"HIPAA Journal","date":"2026-02-06T17:13:28.000Z","url":"https://www.hipaajournal.com/what-is-healthcare-adjacent-data/","summary":"Healthcare-adjacent data is any health‑related or health‑influenced information that falls outside HIPAA’s definition of Protected Health Information because it is […]\nThe post What Is Healthcare-Adjacent Data? appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Is Wix HIPAA Compliant?","source":"HIPAA Journal","date":"2026-02-04T13:21:40.000Z","url":"https://www.hipaajournal.com/is-wix-hipaa-compliant/","summary":"When this article was first published in early 2025, Wix was not a HIPAA-compliant service; however, the company has since […]\nThe post Is Wix HIPAA Compliant? appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"CISA Issues Guidance for Proactively Defending Against Insider Threats","source":"HIPAA Journal","date":"2026-02-03T16:34:41.000Z","url":"https://www.hipaajournal.com/cisa-issues-guidance-proactively-defending-against-insider-threats/","summary":"Insider threats are one of the leading causes of data breaches in healthcare, more so than in many other industry […]\nThe post CISA Issues Guidance for Proactively Defending Against Insider Threats appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Patients Learn Their Health Data Was Compromised More Than a Year Ago","source":"HIPAA Journal","date":"2026-02-03T14:48:35.000Z","url":"https://www.hipaajournal.com/patients-notified-2024-data-breaches/","summary":"Alpine Ear, Nose, and Throat in Colorado, The Phia Group in Massachusetts, and Community Health Northwest Florida have started notifying […]\nThe post Patients Learn Their Health Data Was Compromised More Than a Year Ago appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"U.S. Data Compromises Hit Record High in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-compromises-record-high-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record High in 2025 appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"U.S. Data Compromises Hit Record Breaches in 2025","source":"HIPAA Journal","date":"2026-01-30T13:16:03.000Z","url":"https://www.hipaajournal.com/u-s-data-breach-record-2025/","summary":"An unwanted new record was set in 2025 for data compromises, which increased by 4% from the record-breaking total in […]\nThe post U.S. Data Compromises Hit Record Breaches in 2025 appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["OT"]},{"title":"More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack","source":"HIPAA Journal","date":"2026-01-26T14:24:54.000Z","url":"https://www.hipaajournal.com/munson-healthcare-cerner-data-breach/","summary":"Munson Healthcare, the largest health system in Northern Michigan, has recently notified patients about unauthorized access to its electronic medical […]\nThe post More than 100K Munson Healthcare Patient Affected by Cerner Cyberattack appeared first on The HIPAA Journal.","tags":["OT"]}]},{"id":"finance","label":"Banking & Finance","description":"Keywords: finance, banking, fintech, investment, cryptocurrency, SEC, wire fraud","articles":[{"title":"VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System","source":"HIPAA Journal","date":"2026-02-23T16:35:18.000Z","url":"https://www.hipaajournal.com/va-oig-security-deficiencies-va-spokane-healthcare-system/","summary":"An audit of the Department of Veterans’ Affairs Spokane Healthcare System in Washington state by the Department of Veterans Affairs […]\nThe post VA OIG Identifies Security Deficiencies in Audit of VA Spokane Healthcare System appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement","source":"HIPAA Journal","date":"2026-02-23T13:13:53.000Z","url":"https://www.hipaajournal.com/senators-demand-answers-decline-osha-safety-health-enforcement/","summary":"Six Democratic Senators have written to the United States Secretary of Labor, Lori Chavez-DeReme, demanding answers about an apparent rollback […]\nThe post Senators Demand Answers from Labor Secretary on Decline in OSHA Safety & Health Enforcement appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses","source":"HIPAA Journal","date":"2026-02-20T15:52:09.000Z","url":"https://www.hipaajournal.com/utah-department-health-human-services-audit-security-weaknesses/","summary":"An audit of the Utah Department of Health and Human Services (DHHS) by the Office of the Utah State Auditor […]\nThe post Audit of Utah Department of Health and Human Services Identifies Critical Privacy & Security Weaknesses appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center","source":"HIPAA Journal","date":"2026-02-20T11:00:37.000Z","url":"https://www.hipaajournal.com/cyberattacks-wirx-pharmacy-emanuel-medical-center/","summary":"WIRX Pharmacy in Pennsylvania has experienced a security incident that exposed the protected health information of more than 20,000 current […]\nThe post Cyberattacks Announced by WIRX Pharmacy and Emanuel Medical Center appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"HHS OCR Settles HIPAA Security Rule Investigation with Top of the World Ranch Treatment Center","source":"Databreaches.net","date":"2026-02-20T02:22:00.000Z","url":"https://databreaches.net/2026/02/19/hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center/?pk_campaign=feed&pk_kwd=hhs-ocr-settles-hipaa-security-rule-investigation-with-top-of-the-world-ranch-treatment-center","summary":"Settlement Marks OCR's 11th Enforcement Action in OCR's Risk Analysis Initiative Today, the U.S. Department of Health and Human Services' (HHS) Office for Civil","tags":["SEC"]},{"title":"Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack","source":"HIPAA Journal","date":"2026-02-18T14:43:35.000Z","url":"https://www.hipaajournal.com/managed-care-advisors-sedgwick-data-breach/","summary":"Managed Care Advisors and Sedgwick Government Solutions recently announced a cybersecurity incident involving unauthorized access to a corporate Secure File […]\nThe post Managed Care Advisors / Sedgwick Notify Patients of Ransomware Attack appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY","source":"HIPAA Journal","date":"2026-02-12T14:15:13.000Z","url":"https://www.hipaajournal.com/healthcare-most-targeted-sector-2025-ransomware/","summary":"A new record was set for ransomware attacks last year, with disclosed ransomware attacks increasing by 49% year-over-year to a […]\nThe post Healthcare Remains the Sector Most Targeted by Ransomware Groups as Attacks Increase 49% YOY appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Your AI doctor doesn’t have to follow the same privacy rules as your real one","source":"CyberScoop","date":"2026-02-11T19:51:01.000Z","url":"https://cyberscoop.com/ai-healthcare-apps-hipaa-privacy-risks-openai-anthropic/","summary":"AI apps are making their way into healthcare. It’s not clear that rigorous data security or privacy practices will be part of the package.","tags":["SEC"]},{"title":"HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital","source":"HIPAA Journal","date":"2026-02-04T15:57:00.000Z","url":"https://www.hipaajournal.com/hhs-oig-web-application-security-weaknesses-audit-large-hospital/","summary":"An audit of a large Southeastern hospital by the Department of Health and Human Services Office of Inspector General (HHS-OIG) […]\nThe post HHS-OIG Identifies Web Application Security Weaknesses at Large U.S. Hospital appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident","source":"HIPAA Journal","date":"2026-01-30T16:06:53.000Z","url":"https://www.hipaajournal.com/healthcare-interactive-data-breach/","summary":"Healthcare Interactive, better known as HCIactive, reported a data breach to the HHS’ Office for Civil Rights on September 22, […]\nThe post Healthcare Interactive: More Than 3 Million Individuals Affected by July 2025 Security Incident appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches","source":"HIPAA Journal","date":"2026-01-27T16:32:50.000Z","url":"https://www.hipaajournal.com/mitchell-county-social-services-360-dental-giacare-data-breaches/","summary":"Protected health information has been exposed in data security incidents at Mitchell County Department of Social Services in North Carolina, […]\nThe post Mitchell County Dept. Social Services; 360 Dental; GiaCare Announce Data Breaches appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-01-27T15:26:06.000Z","url":"https://www.hipaajournal.com/texas-new-jersey-dermatology-practices-data-breach-settlements/","summary":"Two U.S. dermatology practices have agreed to settle class action lawsuits stemming from cybersecurity incidents that exposed patient data. The […]\nThe post Texas & New Jersey Dermatology Practices Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["SEC"]},{"title":"Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability","source":"HIPAA Journal","date":"2026-01-27T13:10:22.000Z","url":"https://www.hipaajournal.com/microsoft-issues-emergency-patch-for-actively-exploited-office-vulnerability/","summary":"Microsoft has issued an out-of-band security update to fix an actively exploited zero-day vulnerability in Microsoft Office. The vulnerability is tracked […]\nThe post Microsoft Issues Emergency Patch for Actively Exploited Office Vulnerability appeared first on The HIPAA Journal.","tags":["SEC"]}]},{"id":"telecom","label":"Telecommunications","description":"Keywords: telecom, network, ISP, broadband, 5G, carrier","articles":[{"title":"Three Healthcare Providers Settle Class Action Data Breach Lawsuits","source":"HIPAA Journal","date":"2026-02-11T16:16:24.000Z","url":"https://www.hipaajournal.com/three-healthcare-providers-settle-class-action-data-breach-lawsuits/","summary":"Settlements have received preliminary approval from the courts to resolve class action lawsuits against Northeast Rehabilitation Hospital Network, American Addiction […]\nThe post Three Healthcare Providers Settle Class Action Data Breach Lawsuits appeared first on The HIPAA Journal.","tags":["NETWORK"]},{"title":"Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients","source":"HIPAA Journal","date":"2026-02-09T15:42:00.000Z","url":"https://www.hipaajournal.com/jbs-mental-health-authority-data-breach/","summary":"Jefferson-Blount-St. Clair Mental Health Authority in Alabama, Cottage Hospital in New Hampshire, WindRose Health Network in Indiana, and Iroquois Memorial […]\nThe post Jefferson-Blount-St. Clair Mental Health Authority Data Breach Affects 30,000 Patients appeared first on The HIPAA Journal.","tags":["NETWORK"]}]}]}